<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args = Args();
#-------------------------------------------------------------------------------
$Search = (string) @$Args['Search'];
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('modules/Authorisation.mod')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Search = MySQL_Escape_String($Search);
#-------------------------------------------------------------------------------
#$Where = SPrintF("`Customer` LIKE '%%%s%%'",$Search);
$Where = "`Customer` LIKE '%" . $Search . "%' OR `ID`='" . $Search . "'";
#-------------------------------------------------------------------------------
$Contracts = DB_Select('Contracts',Array('ID','Customer','(SELECT `Email` FROM `Users` WHERE `Users`.`ID` = `Contracts`.`UserID`) as `Email`'),Array('Limit'=>Array('Start'=>0,'Length'=>15),'Where'=>$Where));
#-------------------------------------------------------------------------------
switch(ValueOf($Contracts)){
  case 'error':
    return ERROR | @Trigger_Error(500);
  case 'exception':
    return new gException('NO_RESULT','Договоры не найдены');
  case 'array':
    #---------------------------------------------------------------------------
    $Result = Array();
    #---------------------------------------------------------------------------
    foreach($Contracts as $Contract)
      $Result[UniqID('ID')] = Array('Value'=>$Contract['ID'],'Label'=>SPrintF('%05u - %s (%s)',$Contract['ID'],$Contract['Customer'],$Contract['Email']));
    #---------------------------------------------------------------------------
    return Array('Options'=>$Result,'Status'=>'Ok');
  default:
    return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------

?>
