<?php

#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Disabled');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$NoBody = new Tag('NOBODY');
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Buttons/Standard',Array('id'=>'ButtonTextQuote','onclick'=>"quote(form.Message);return false;"),'Цитировать','TextQuote.gif');
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$NoBody->AddChild(new Tag('TD',Array('width'=>25),$Comp));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Buttons/Standard',Array('id'=>'ButtonImage'),'Добавить изображение','Image.gif');
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$NoBody->AddChild(new Tag('TD',Array('width'=>25),$Comp));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Buttons/Standard',Array('onclick'=>"bb_code(document.getElementById('Message'),'b');return false;",'id'=>'ButtonTextSize'),'Жирный текст','TextSize.gif');
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$NoBody->AddChild(new Tag('TD',Array('width'=>25),$Comp));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Buttons/Standard',Array('onclick'=>"bb_code(document.getElementById('Message'),'color=green','color');return false;",'id'=>'ButtonTextColor'),'Цвет текста','TextColor.gif');
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$NoBody->AddChild(new Tag('TD',Array('width'=>25),$Comp));
#-------------------------------------------------------------------------------
if(!In_Array('hidden',$Disabled)){
	#-------------------------------------------------------------------------------
	$Comp = Comp_Load('Buttons/Standard',Array('onclick'=>"bb_code(document.getElementById('Message'),'hidden');return false;",'id'=>'ButtonTextLock'),'Вставить невидимый текст','TextLock.gif');
	if(Is_Error($Comp))
		return ERROR | @Trigger_Error(500);
	#-------------------------------------------------------------------------------
	$NoBody->AddChild(new Tag('TD',Array('width'=>25),$Comp));
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return $NoBody;
#-------------------------------------------------------------------------------

?>
