<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/


// добавление записи о событии, для дальнейшей обработки задачей
function SORM_add($Type,$Aaa,$Data = Array()){
	#-------------------------------------------------------------------------------
	/*
	 * Type - тип вносимых в БД данных. по сути - имя директории на ftp
	 * Data - индексированный массив данных, в любом виде - каждый разбирается индивидуально
	 *
	 * может ещё время надо, но смысла нет - функция вызывается сразу, т.е. время убежать не успевает
	 * */
	#-------------------------------------------------------------------------------

	$IsInsert = DB_Insert('TmpData',Array('AppID'=>'Tasks.SORM',/*'UserID'=>$Aaa['UserId'],*/'Col1'=>$Type,'Params'=>Array('service_aaa'=>$Aaa,'Data'=>$Data)));
	if(Is_Error($IsInsert))                                 
		return ERROR | @Trigger_Error(500); 
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	return TRUE;
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
}




