<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Params');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Config = Config();
#-------------------------------------------------------------------------------
$GC = $Config['Tasks']['Types']['GC'];
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# зачищаем таблицу задач
$Clean = DB_Query(SPrintF("DELETE FROM `Tasks` WHERE `ExecuteDate` < UNIX_TIMESTAMP() - %s AND `IsExecuted` = 'yes' AND `UserID` != 1", $GC['TableTasksStoryPeriod'] * 24 * 3600 ));
if(Is_Error($Clean))
	return ERROR | @Trigger_Error(500);
#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------
# зачищаем таблицу ServersUpTime
$Clean = DB_Query(SPrintF("DELETE FROM `ServersUpTime` WHERE `TestDate` < UNIX_TIMESTAMP() - %s", $GC['TableServersUpTimeStoryPeriod'] * 24 * 3600 ));
if(Is_Error($Clean))
	return ERROR | @Trigger_Error(500);
#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------
# зачищаем таблицу RequestLog
$Clean = DB_Query(SPrintF("DELETE FROM `ServersUpTime` WHERE `CreateDate` < UNIX_TIMESTAMP() - %s", $GC['TableRequestLogStoryPeriod'] * 24 * 3600 ));
if(Is_Error($Clean))
	return ERROR | @Trigger_Error(500);
#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------
# added by lissyara, 2011-12-27 in 14:09 MSK, for JBS-232
# проставляем тикеты как оповещённые, если больше недели прошло
$IsUpdate = DB_Update('EdesksMessages',Array('IsNotify'=>'yes'),Array('Where'=>SPrintF('`CreateDate` < %u',(Time() - 7*24*3600))));
if(Is_Error($IsUpdate))
	return ERROR | @Trigger_Error(500);
#--------------------------------------------------------------------------------
return TRUE;
#--------------------------------------------------------------------------------

?>
