<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Params');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Config = Config();
#-------------------------------------------------------------------------------
$Settings = $Config['Tasks']['Types']['GC']['CleanTablesSettings'];
#-------------------------------------------------------------------------------
if(!$Settings['IsActive'])
	return TRUE;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# зачищаем таблицу задач
$Where = Array(
		SPrintF('`ExecuteDate` < UNIX_TIMESTAMP() - %u',32*24*3600),
		'`UserID` != 1','`TypeID` != "Dispatch"'
		);
#-------------------------------------------------------------------------------
$IsDelete = DB_Delete('Tasks',Array('Where'=>$Where));
if(Is_Error($IsDelete))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
Sleep(1);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------

# костыль к рассыльщику SMS
$Where = Array(
		'`CreateDate` < UNIX_TIMESTAMP() - 24 * 3600',
		"`TypeID` = 'SMS'"
		);
#-------------------------------------------------------------------------------
$IsDelete = DB_Delete('Tasks',Array('Where'=>$Where));
if(Is_Error($IsDelete))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
Sleep(1);
#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------

# зачищаем таблицу ServersUpTime
$Where = SPrintF('`TestDate` < UNIX_TIMESTAMP() - %u',3650*24*3600);
#-------------------------------------------------------------------------------
$IsDelete = DB_Delete('ServersUpTime',Array('Where'=>$Where));
if(Is_Error($IsDelete))
	return ERROR | @Trigger_Error(500);
#--------------------------------------------------------------------------------
Sleep(1);
#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------

# зачищаем таблицу RequestLog
$Where = SPrintF('`CreateDate` < UNIX_TIMESTAMP() - %u',10*24*3600);
#-------------------------------------------------------------------------------
$IsDelete = DB_Delete('RequestLog',Array('Where'=>$Where));
if(Is_Error($IsDelete))
	return ERROR | @Trigger_Error(500);
#--------------------------------------------------------------------------------
Sleep(1);
#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------

# зачищаем таблицу UsersIPs
$Where = SPrintF('`CreateDate` < UNIX_TIMESTAMP() - %u',366*24*3600);
#-------------------------------------------------------------------------------
$IsDelete = DB_Delete('UsersIPs',Array('Where'=>$Where));
if(Is_Error($IsDelete))
	return ERROR | @Trigger_Error(500);
#--------------------------------------------------------------------------------
Sleep(1);
#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------

# added by lissyara, 2011-12-27 in 14:09 MSK, for JBS-232
# проставляем тикеты как оповещённые, если больше недели прошло
$IsUpdate = DB_Update('EdesksMessages',Array('IsNotify'=>'yes'),Array('Where'=>SPrintF('`CreateDate` < %u',(Time() - 7*24*3600))));
if(Is_Error($IsUpdate))
	return ERROR | @Trigger_Error(500);
#--------------------------------------------------------------------------------
Sleep(1);
#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------

# added by lissyara 2012-09-28 in 13:54 MSK, for JBS-377
$Where = '(SELECT `ID` FROM `Users` WHERE `Events`.`UserID`=`Users`.`ID`) IS NULL';
#--------------------------------------------------------------------------------
$IsDelete = DB_Delete('Events',Array('Where'=>$Where));
if(Is_Error($IsDelete))
	return ERROR | @Trigger_Error(500);
#--------------------------------------------------------------------------------
Sleep(1);
#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------

# Удаляем бонусы c датой окончания меньше текущей даты ... и года, например
$IsDelete = DB_Delete('Bonuses',Array('Where'=>'`ExpirationDate` < UNIX_TIMESTAMP() - 365*24*60*60'));
if(Is_Error($IsDelete))
	return ERROR | @Trigger_Error(500);
#--------------------------------------------------------------------------------
Sleep(1);
#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------

# Удаляем бонусы c датой окончания меньше текущей даты ... и года, например
$IsDelete = DB_Delete('Bonuses',Array('Where'=>'`DaysRemainded` = 0 AND `CreateDate` < UNIX_TIMESTAMP() - 365*24*60*60'));
if(Is_Error($IsDelete))
	return ERROR | @Trigger_Error(500);
#--------------------------------------------------------------------------------
Sleep(1);

#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------
// удаляем ссылки на счета сбербанка, старше 120 дней
$IsDelete = DB_Delete('TmpData',Array('Where'=>'`AppID` = "SberBank" AND `CreateDate` < UNIX_TIMESTAMP() - 120*24*60*60'));
if(Is_Error($IsDelete))
	return ERROR | @Trigger_Error(500);
#--------------------------------------------------------------------------------
Sleep(1);

#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------
// удаляем сопоставление счетов и сессий в ККМ, вроде пять лет хранить чеки положено...
$IsDelete = DB_Delete('TmpData',Array('Where'=>'`AppID` = "Taxation" AND `CreateDate` < UNIX_TIMESTAMP() - 5*365*24*60*60'));
if(Is_Error($IsDelete))
	return ERROR | @Trigger_Error(500);
#--------------------------------------------------------------------------------
Sleep(1);

#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------
// удаляем сопоставление тредов в телеге и тикетов... год наверное, достаточно
$IsDelete = DB_Delete('TmpData',Array('Where'=>'`AppID` = "Telegram" AND `CreateDate` < UNIX_TIMESTAMP() - 365*24*60*60'));
if(Is_Error($IsDelete))
	return ERROR | @Trigger_Error(500);
#--------------------------------------------------------------------------------
Sleep(1);

#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------
// удаляем сопоставление тредов в VK и тикетов... год наверное, достаточно
$IsDelete = DB_Delete('TmpData',Array('Where'=>'`AppID` = "VK" AND `CreateDate` < UNIX_TIMESTAMP() - 365*24*60*60'));
if(Is_Error($IsDelete))
	return ERROR | @Trigger_Error(500);
#--------------------------------------------------------------------------------
Sleep(1);

#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------
// удаляем задачи яндекс-метрики
$IsDelete = DB_Delete('TmpData',Array('Where'=>'`AppID` = "YandexMetrika" AND `CreateDate` < UNIX_TIMESTAMP() - 365*24*60*60'));
if(Is_Error($IsDelete))
	return ERROR | @Trigger_Error(500);
#--------------------------------------------------------------------------------
Sleep(1);

#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------
// чистим таблицы с историей заказов от мусора
$IsQuery = DB_Query('UPDATE `OrdersHistory` SET `Parked` = REPLACE(`Parked`,",,",",");');
if(Is_Error($IsQuery))
	return ERROR | @Trigger_Error(500);
#--------------------------------------------------------------------------------
$IsQuery = DB_Query('UPDATE `OrdersHistory` SET `Parked` = RIGHT(`Parked`,LENGTH(`Parked`)-1) WHERE `Parked` LIKE ",%";');
if(Is_Error($IsQuery))
	return ERROR | @Trigger_Error(500);
#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------
# JBS-1116: чистим таблицу событий
$Garbages = Array(
		'Пользователь вошел в систему %',
		'Вход в систему %',
		'Сообщение для %',
		'Пользователь вышел %',
		'Не удалость автоматически оплатить %',
		'Добавлено новое сообщение %',
		'Владелец для заказа %',
		'Создан новый запрос %',
		'Автоматическая отмена заказа %',
		'Отмененный заказ %',
		'SMS сообщение для %',
		'Не удалось отправить SMS сообщение %',
		'Замена основного сервера группы %',
		'Задание % вернуло ошибку выполнения',
		'Уведомление о условно оплаченном счете %',
		'Уведомление о условно оплаченном счёте %',
		'Создан запрос в службу поддержки %',
		'Задание % не может быть выполнено в автоматическом режиме',
		'Удалено сообщение %',
		'Найден %/% отсутствующий в биллинге',
		'% подтверждён',
		'Зарегистрирован новый пользователь %',
		'Сформирован новый договор %',
		'Сформирован договор %',
		'% автопродление для заказа %',
		'Контактный адрес (%) подтверждён через %',
		'Не удалость автоматически оплатить заказ %',
		'Автоматическое списание денег (%) у неактивного пользователя',
		'Автоматическое списание средств (%) у неактивного пользователя',
		'Соотрудником % удалён пользователь %',
		'Удалён пользователь (%) не заходивший в биллинг %',
		'Доменная зона "%" не обнаружена в базе данных WhoIs%',
		'%/%: цена % изменена %',
		'Ошибка опроса сервера %',
		'Не удалось сменить именные сервера заказу домена %',
		'Не удалось сменить тарифный план заказу хостинга %',
		'Уведомление о неоплаченном счёте %',
		'Автоматическая отмена счёта %',
		'Выписан счёт % по договору (%), платежная система %',
		'Отменённый счёт % автоматически удалён%',
		'Отменённый счёт % удалён',
		'Не удалось произвести автоматическую оплату заказа % причина %',
		'Удалено почтовое сообщение с нецензурной лексикой %',
		'Промокод (%s) успешно активирован',
		'Запущена миграция виртуальной машины %',
		'Миграция виртуальной машины %',
		'Счет % успешно оплачен',
		'Заказ домена % не найден у регистратора%',
		'Оплачен счёт %, на сумму %, платежная система %',
		'Отмененный % автоматически удален',
		'Заказ VPS %',
		'Заказ на прокси-сервер %, тариф % удален',
		'Сформирована заявка на заказ %',
		'Заказ домена % оплачен на период %',
		'Именные сервера для заказа домена (%) %',
		'Успешно изменён тарифный план %',
		'Ошибка автоматического формирования инструкции по переносу домена %',
		'Определён владелец для заказа домена %',
		'Пользователь (%) не найден на сервере (%)',
		'На сервере (%) найден пользователь (%) отсутствующий в биллинге',
		'Домен % является свободным, невозможно обновить информацию WhoIs',
		'Удалён пользователь (%) не заходивший в биллинг более года',
		'Зарегистрирован пользователь (%)',
		'Заказ домена % не был продлен до окончания срока регистрации. Заказ заблокирован.',
		'Автоматическое удаление домена (%)%',
		'Заказ ExtraIP (%) %',
		'Заказ DS (%) %',
		'Заказ ПО ISPsystem (%) %',
		'На сервере (%) для логина (%) успешно добавлен %',
		'У регистратора % найден лишний домен %',
		'Осуществлён возврат средств за заказ %',
		'% изменён почтовый адрес пользователя %',
		'% условно оплачен',
		'Найдена неучтённая лицензия %',
		'Сформирована заявка на аренду выделенного сервера %',
		'Отключены оповещения для %',
		);
#--------------------------------------------------------------------------------
foreach($Garbages as $Garbage){
	#--------------------------------------------------------------------------------
	$IsQuery = DB_Query(SPrintF("DELETE FROM `Events` WHERE `Text` LIKE '%s' AND `CreateDate` < UNIX_TIMESTAMP() - 90*24*60*60 /* старше 90 дней */;",$Garbage));
	if(Is_Error($IsQuery))
		return ERROR | @Trigger_Error(500);
	#--------------------------------------------------------------------------------
	Sleep(1);
	#--------------------------------------------------------------------------------
}
#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------
return TRUE;
#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------

?>
