<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Replace');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Replace['HostID'] = HOST_ID;
#-------------------------------------------------------------------------------
$Message = <<<EOT
Здравствуйте, %User.Name%!

Уведомляем Вас, что на нашем сайте открыто новое обсуждение с темой: %Theme%.

---
%Message%
---

Для участия в обсуждении нажмите:

http://%HostID%/EdeskMessages?Email=%User.Email%&Password=%User.UniqID%&EdeskID=%EdeskID%

Если Вы не хотите получать уведомления о новых обсуждениях, созданных на нашем сайте, зайдите в биллинговую систему используя Ваш регистрационный электронный адрес и пароль (Вы так же можете воспользоваться ссылкой, указанной выше), и в верхнем меню вызовите "Мои настройки"->"Уведомления" и отключите данный вид уведомлений.

%From.Sign%
EOT;
#-------------------------------------------------------------------------------
$Replace = Array_ToLine($Replace,'%');
#-------------------------------------------------------------------------------
foreach(Array_Keys($Replace) as $Key)
  $Message = Str_Replace($Key,$Replace[$Key],$Message);
#-------------------------------------------------------------------------------
return Array('Theme'=>'Новое обсуждение','Message'=>$Message);
#-------------------------------------------------------------------------------

?>
