<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Replace');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Replace['HostID'] = HOST_ID;
#-------------------------------------------------------------------------------
$Message = <<<EOT
Здравствуйте, %User.Name%!

Уведомляем Вас, что на нашем сайте добавлено новое сообщение для обсуждения с темой: %Theme%.

---
%Message%
---

Для продолжения участия в обсуждении нажмите:

http://%HostID%/EdeskMessages?Email=%User.Email%&Password=%User.UniqID%&EdeskID=%EdeskID%

%From.Sign%
EOT;
#-------------------------------------------------------------------------------
$Replace = Array_ToLine($Replace,'%');
#-------------------------------------------------------------------------------
foreach(Array_Keys($Replace) as $Key)
  $Message = Str_Replace($Key,$Replace[$Key],$Message);
#-------------------------------------------------------------------------------
return Array('Theme'=>'Новое сообщение для обсуждения','Message'=>$Message);
#-------------------------------------------------------------------------------

?>
