<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Replace');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Replace['HostID'] = HOST_ID;
#-------------------------------------------------------------------------------
$Message = <<<EOT
Здравствуйте, %User.Name%!

Разрешите произвести перед Вами отчет за оказанные услуги.

Вся информация по текущим оказанным услугам может быть получена Вами загрузив акт выполненных работ с ипользованием прямой ссылки:

http://%HostID%/WorksCompliteReportDownload?Email=%User.Email%&Password=%User.UniqID%&ContractID=%ContractID%&Month=%Month%

Оригиналы документов будут высланы Вам по почте в самое ближайшее время.

%From.Sign%
EOT;
#-------------------------------------------------------------------------------
$Replace = Array_ToLine($Replace,'%');
#-------------------------------------------------------------------------------
foreach(Array_Keys($Replace) as $Key)
  $Message = Str_Replace($Key,$Replace[$Key],$Message);
#-------------------------------------------------------------------------------
return Array('Theme'=>'','Message'=>$Message);
#-------------------------------------------------------------------------------

?>
