<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('ID','ServiceID');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Out = Array();
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// достаём поля услуги
$ServicesFields = DB_Select('ServicesFieldsOwners','*',Array('Where'=>SPrintF('`ServiceID` = %u',$ServiceID),'SortOn'=>'SortID'));
switch(ValueOf($ServicesFields)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return $Out;
case 'array':
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
// перебираем поля, достаём значения
foreach($ServicesFields as $ServicesField){
	#-------------------------------------------------------------------------------
	// достаём значениия дл яэтого поля
	$OrdersFields = DB_Select('OrdersFieldsOwners','*',Array('Where'=>Array(SPrintF('`ServiceFieldID` = %u',$ServicesField['ID']),SPrintF('`OrderID` = %u',$ID))));
	switch(ValueOf($OrdersFields)){
	case 'error':
		return ERROR | @Trigger_Error(500);
	case 'exception':
		continue 2;
	case 'array':
		break;
	default:
		return ERROR | @Trigger_Error(101);
	}
	#-------------------------------------------------------------------------------
	foreach($OrdersFields as $OrdersField){
		#-------------------------------------------------------------------------------
		$Out[$ServicesField['Name']] = $OrdersField['Value'];
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
//Debug(print_r($Out,true));
return $Out;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------

?>
