<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('OrderTypeCode','ID','DependOrderID');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Out = Array();
#-------------------------------------------------------------------------------
if($OrderTypeCode == 'Default'){
	#-------------------------------------------------------------------------------
	/*
	 * по уму, надо посмотретьч то за услуга, если она относится к чему-то с доменом
	 * то домен(ы) этот тут надо отдать. например для сертфиката домена, защиты рег. данных
	 * да и в принципе без разницы. по сути, надо вызвать этот же компонент рекурсивно.
	 *
	 * главное чтобы не было ссылающихся друг на друга услуг =)
	 *
	 * */
	#-------------------------------------------------------------------------------
	// достаём сервис услуги
	$Where = SPrintF('`ID` = (SELECT `ServiceID` FROM `OrdersOwners` WHERE `ID` = %u )',$DependOrderID);
	#-------------------------------------------------------------------------------
	$Service = DB_Select('Services',Array('ID','Code','Name','NameShort'),Array('UNIQ','Where'=>$Where));
	switch(ValueOf($Service)){
	case 'error':
		return ERROR | @Trigger_Error(500);
	case 'exception':
		return $Out;
	case 'array':
		break;
	default:
		return ERROR | @Trigger_Error(101);
	}
	#-------------------------------------------------------------------------------
	$Comp = Comp_Load('Services/Orders/GetOrderDomains',$Service['Code'],$DependOrderID);
	if(Is_Error($Comp))
		return ERROR | @Trigger_Error(500);
	#-------------------------------------------------------------------------------
	return $Comp;
	#-------------------------------------------------------------------------------
}elseif(In_Array($OrderTypeCode,Array('DNSmanager','Hosting','Domain'))){
	#-------------------------------------------------------------------------------
	// у хостинга и вторичного ДНС все домены есть в Parked
	if(In_Array($OrderTypeCode,Array('DNSmanager','Hosting')))
		$Columns = Array('Parked');
	#-------------------------------------------------------------------------------
	// у ВПС домен, который реверсная PTR запись, есть в поле Domain
	// надо ли её тока, она ж не домен называется...
	//if($OrderTypeCode == 'VPS')
	//	$Columns = Array('`Domain` AS `Parked`');
	#-------------------------------------------------------------------------------
	if($OrderTypeCode == 'Domain')
		$Columns = 'CONCAT(`DomainName`,".",(SELECT `Name` FROM `DomainSchemes` WHERE `DomainSchemes`.`ID` = `DomainOrdersOwners`.`SchemeID`)) AS `Parked`';
	#-------------------------------------------------------------------------------
	$Domains = DB_Select(SPrintF('%sOrdersOwners',$OrderTypeCode),$Columns,Array('UNIQ','Where'=>SPrintF('`OrderID` = %u',$ID)));
	switch(ValueOf($Domains)){
	case 'error':
		return ERROR | @Trigger_Error(500);
	case 'exception':
		return $Out;
	case 'array':
		break;
	default:
		return ERROR | @Trigger_Error(101);
	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	$Parked = Explode(',',$Domains['Parked']);
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	foreach($Parked as $Domain)
		if($Domain)
			$Out[] = SPrintF('<a href="https://%s/" target="_blank">%s</a>',$Domain,$Domain);
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	return $Out;
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return $Out;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------

?>
