<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('OrderTypeCode','ID');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
#Debug("[comp/Services/Orders/SchemeWrapper]: OrderTypeCode = $OrderTypeCode, ID = $ID");
#-------------------------------------------------------------------------------
$CacheID = Md5($__FILE__ . $OrderTypeCode . $ID);
#-------------------------------------------------------------------------------
$Result = CacheManager::get($CacheID);
if($Result)
	return $Result;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if($OrderTypeCode == 'Default'){
	#-------------------------------------------------------------------------------
	$Order = DB_Select('OrdersOwners',Array('ID','(SELECT `Item` FROM `Services` WHERE `OrdersOwners`.`ServiceID`=`Services`.`ID`) AS `SchemeName`'),Array('UNIQ','ID'=>$ID));
	#-------------------------------------------------------------------------------
}else{
	#-------------------------------------------------------------------------------
	$Columns = Array(
			'ID',
			SPrintF('(SELECT `Name` FROM `%sSchemes` WHERE `%sOrdersOwners`.`SchemeID` = `%sSchemes`.`ID`) as `SchemeName`',$OrderTypeCode,$OrderTypeCode,$OrderTypeCode)
			);
	#-------------------------------------------------------------------------------
	$Order = DB_Select(SPrintF('%sOrdersOwners',$OrderTypeCode),$Columns,Array('UNIQ','Where'=>SPrintF('`OrderID` = %u',$ID)));
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
switch(ValueOf($Order)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return ERROR | @Trigger_Error(400);
case 'array':
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// если тариф не меняется - просто выводим, без ссылки
if(!In_Array($OrderTypeCode,Array('DNSmanager','VPS','ISPsw','Hosting')))
	$OrderTypeCode = FALSE;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Formats/SchemeName',$Order['SchemeName'],$OrderTypeCode,$Order['ID']);
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
CacheManager::add($CacheID, $Comp, 24 * 3600);
#-------------------------------------------------------------------------------
return $Comp;
#-------------------------------------------------------------------------------

?>
