<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Tags','UserID');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
// юзер, заказы которого выбираем
$__USER = $GLOBALS['__USER'];
#-------------------------------------------------------------------------------
if(!$UserID)
	$UserID = $__USER['ID'];
#-------------------------------------------------------------------------------
// выхлоп - список заказов, временый список заказов
$Out = Array('Orders'=>Array(),'Options'=>Array());
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
foreach(Array_Keys($Tags) as $Key){
	#-------------------------------------------------------------------------------
	switch($Key){
	case 'Services':
		#-------------------------------------------------------------------------------
		foreach($Tags[$Key] as $Service){
			#-------------------------------------------------------------------------------
			$Orders = DB_Select('OrdersOwners','ID',Array('Where'=>Array(SPrintF('`UserID` = %u',$UserID),/*'`StatusID` = "Active"',*/SPrintF('`ServiceID` = %u',$Service))));
			#-------------------------------------------------------------------------------
			switch(ValueOf($Orders)){
			case 'error':
				return ERROR | @Trigger_Error(500);
			case 'exception':
				break;
			case 'array':
				#-------------------------------------------------------------------------------
				foreach($Orders as $Order)
					$Out['Orders'][] = $Order['ID'];
				#-------------------------------------------------------------------------------
				break;
				#-------------------------------------------------------------------------------
			default:
				return ERROR | @Trigger_Error(101);
			}
			#-------------------------------------------------------------------------------
		}
		#-------------------------------------------------------------------------------
		break;
		#-------------------------------------------------------------------------------
	case 'Servers':
		#-------------------------------------------------------------------------------
		foreach($Tags[$Key] as $Server){
			#-------------------------------------------------------------------------------
			$Orders = DB_Select('OrdersOwners','ID',Array('Where'=>Array(SPrintF('`UserID` = %u',$UserID),'`StatusID` = "Active"',SPrintF('`ServerID` = %u',$Server))));
			#-------------------------------------------------------------------------------
			switch(ValueOf($Orders)){
			case 'error':
				return ERROR | @Trigger_Error(500);
			case 'exception':
				break;
			case 'array':
				#-------------------------------------------------------------------------------
				foreach($Orders as $Order)
					if(!In_Array($Order['ID'],$Out['Orders']))
						$Out['Orders'][] = $Order['ID'];
				#-------------------------------------------------------------------------------
				break;
				#-------------------------------------------------------------------------------
			default:
				return ERROR | @Trigger_Error(101);
			}
			#-------------------------------------------------------------------------------
		}
		#-------------------------------------------------------------------------------
		break;
		#-------------------------------------------------------------------------------
	case 'ServersGroups':
		#-------------------------------------------------------------------------------
		foreach($Tags[$Key] as $ServersGroup){
			#-------------------------------------------------------------------------------
			$Orders = DB_Select('OrdersOwners','ID',Array('Where'=>Array(SPrintF('`UserID` = %u',$UserID),'`StatusID` = "Active"',SPrintF('`ServerID` IN (SELECT ID FROM Servers WHERE ServersGroupID = %u)',$ServersGroup))));
			#-------------------------------------------------------------------------------
			switch(ValueOf($Orders)){
			case 'error':
				return ERROR | @Trigger_Error(500);
			case 'exception':
				break;
			case 'array':
				#-------------------------------------------------------------------------------
				foreach($Orders as $Order)
					if(!In_Array($Order['ID'],$Out['Orders']))
						$Out['Orders'][] = $Order['ID'];
				#-------------------------------------------------------------------------------
				break;
				#-------------------------------------------------------------------------------
			default:
				return ERROR | @Trigger_Error(101);
			}
			#-------------------------------------------------------------------------------
		}
		#-------------------------------------------------------------------------------
		break;
		#-------------------------------------------------------------------------------
	default:
		break;
	}
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// перебираем заказы, строим выхлоп
foreach($Out['Orders'] as $iOrder){
	#-------------------------------------------------------------------------------
	// кэшируем, иначе будут тупить на каждый чих
	$CacheID = SPrintF('TagsExplain-%s-%s',$UserID,$iOrder);
	#-------------------------------------------------------------------------------
	// достаём из кэша
	$Result = CacheManager::get($CacheID);
	#-------------------------------------------------------------------------------
	// если досталось - записываем результат
	if($Result){
		#-------------------------------------------------------------------------------
		$Out['Options'][$iOrder] = $Result;
		#-------------------------------------------------------------------------------
		continue;
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	$Columns = Array('*','(SELECT `NameShort` FROM `Services` WHERE `ID` = `OrdersOwners`.`ServiceID`) AS `NameShort`','(SELECT `Code` FROM `Services` WHERE `ID` = `OrdersOwners`.`ServiceID`) AS `Code`');
	#-------------------------------------------------------------------------------
	$Order = DB_Select('OrdersOwners',$Columns,Array('UNIQ','ID'=>$iOrder));
	#-------------------------------------------------------------------------------
	switch(ValueOf($Order)){
	case 'error':
		return ERROR | @Trigger_Error(500);
	case 'exception':
		return ERROR | @Trigger_Error(400);
	case 'array':
		break;
	default:
		return ERROR | @Trigger_Error(101);
	}
	#-------------------------------------------------------------------------------
	// в зависимости от услуги, выбираем из разных таблиц, или сразу строим
	switch($Order['Code']){
        case 'Default':
		#-------------------------------------------------------------------------------
		// кастомные услуги
		$Out['Options'][$iOrder] = SPrintF('%s: #%u',$Order['NameShort'],$iOrder);
		#-------------------------------------------------------------------------------
		break;
		#-------------------------------------------------------------------------------
	case 'Hosting':
		#-------------------------------------------------------------------------------
		$TmpOrder = DB_Select(SPrintF('%sOrdersOwners',$Order['Code']),'*',Array('UNIQ','Where'=>SPrintF('`OrderID` = %u',$iOrder)));
		#-------------------------------------------------------------------------------
		switch(ValueOf($TmpOrder)){
		case 'error':
			return ERROR | @Trigger_Error(500);
		case 'exception':
			return ERROR | @Trigger_Error(400);
		case 'array':
			break;
		default:
			return ERROR | @Trigger_Error(101);
		}
		#-------------------------------------------------------------------------------
		$Out['Options'][$iOrder] = SPrintF('%s: %s',$Order['NameShort'],$TmpOrder['Login']);
		#-------------------------------------------------------------------------------
		break;
		#-------------------------------------------------------------------------------
	case 'VPS':
		#-------------------------------------------------------------------------------
		$TmpOrder = DB_Select(SPrintF('%sOrdersOwners',$Order['Code']),'*',Array('UNIQ','Where'=>SPrintF('`OrderID` = %u',$iOrder)));
		#-------------------------------------------------------------------------------
		switch(ValueOf($TmpOrder)){
		case 'error':
			return ERROR | @Trigger_Error(500);
		case 'exception':
			return ERROR | @Trigger_Error(400);
		case 'array':
			break;
		default:
			return ERROR | @Trigger_Error(101);
		}
		#-------------------------------------------------------------------------------
		$Out['Options'][$iOrder] = SPrintF('%s: %s [%s]',$Order['NameShort'],$TmpOrder['Login'],$TmpOrder['IP']);
		#-------------------------------------------------------------------------------
		break;
		#-------------------------------------------------------------------------------
	case 'DS':
		#-------------------------------------------------------------------------------
		$TmpOrder = DB_Select(SPrintF('%sOrdersOwners',$Order['Code']),Array('*','(SELECT `Name` FROM `DSSchemes` WHERE `ID` = `DSOrdersOwners`.`SchemeID`) AS `SchemeName`'),Array('UNIQ','Where'=>SPrintF('`OrderID` = %u',$iOrder)));
		#-------------------------------------------------------------------------------
		switch(ValueOf($TmpOrder)){
		case 'error':
			return ERROR | @Trigger_Error(500);
		case 'exception':
			return ERROR | @Trigger_Error(400);
		case 'array':
			break;
		default:
			return ERROR | @Trigger_Error(101);
		}
		#-------------------------------------------------------------------------------
		$Out['Options'][$iOrder] = SPrintF('%s: %s [%s]',$Order['NameShort'],$TmpOrder['IP'],$TmpOrder['SchemeName']);
		#-------------------------------------------------------------------------------
		break;
		#-------------------------------------------------------------------------------
	case 'ExtraIP':
		#-------------------------------------------------------------------------------
		$TmpOrder = DB_Select(SPrintF('%sOrdersOwners',$Order['Code']),'*',Array('UNIQ','Where'=>SPrintF('`OrderID` = %u',$iOrder)));
		#-------------------------------------------------------------------------------
		switch(ValueOf($TmpOrder)){
		case 'error':
			return ERROR | @Trigger_Error(500);
		case 'exception':
			return ERROR | @Trigger_Error(400);
		case 'array':
			break;
		default:
			return ERROR | @Trigger_Error(101);
		}
		#-------------------------------------------------------------------------------
		$Out['Options'][$iOrder] = SPrintF('%s: %s',$Order['NameShort'],$TmpOrder['Login']);
		#-------------------------------------------------------------------------------
		break;
		#-------------------------------------------------------------------------------
	case 'ISPsw':
		#-------------------------------------------------------------------------------
		$TmpOrder = DB_Select(SPrintF('%sOrdersOwners',$Order['Code']),'*',Array('UNIQ','Where'=>SPrintF('`OrderID` = %u',$iOrder)));
		#-------------------------------------------------------------------------------
		switch(ValueOf($TmpOrder)){
		case 'error':
			return ERROR | @Trigger_Error(500);
		case 'exception':
			return ERROR | @Trigger_Error(400);
		case 'array':
			break;
		default:
			return ERROR | @Trigger_Error(101);
		}
		#-------------------------------------------------------------------------------
		$Out['Options'][$iOrder] = SPrintF('%s: %s',$Order['NameShort'],$TmpOrder['IP']);
		#-------------------------------------------------------------------------------
		break;
		#-------------------------------------------------------------------------------
	case 'DNSmanager':
		#-------------------------------------------------------------------------------
		$TmpOrder = DB_Select(SPrintF('%sOrdersOwners',$Order['Code']),'*',Array('UNIQ','Where'=>SPrintF('`OrderID` = %u',$iOrder)));
		#-------------------------------------------------------------------------------
		switch(ValueOf($TmpOrder)){
		case 'error':
			return ERROR | @Trigger_Error(500);
		case 'exception':
			return ERROR | @Trigger_Error(400);
		case 'array':
			break;
		default:
			return ERROR | @Trigger_Error(101);
		}
		#-------------------------------------------------------------------------------
		$Out['Options'][$iOrder] = SPrintF('%s: %s',$Order['NameShort'],$TmpOrder['Login']);
		#-------------------------------------------------------------------------------
		break;
		#-------------------------------------------------------------------------------
	case 'Domain':
		#-------------------------------------------------------------------------------
		$TmpOrder = DB_Select(SPrintF('%sOrdersOwners',$Order['Code']),'*',Array('UNIQ','Where'=>SPrintF('`OrderID` = %u',$iOrder)));
		#-------------------------------------------------------------------------------
		switch(ValueOf($TmpOrder)){
		case 'error':
			return ERROR | @Trigger_Error(500);
		case 'exception':
			return ERROR | @Trigger_Error(400);
		case 'array':
			break;
		default:
			return ERROR | @Trigger_Error(101);
		}
		#-------------------------------------------------------------------------------
		$Out['Options'][$iOrder] = SPrintF('%s: %s.%s',$Order['NameShort'],$TmpOrder['DomainName'],$TmpOrder['Name']);
		#-------------------------------------------------------------------------------
		break;
		#-------------------------------------------------------------------------------
	default:
		return ERROR | @Trigger_Error(101);
	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	// сохраняем в кэш
	if(IsSet($Out['Options'][$iOrder]))
		CacheManager::add($CacheID,$Out['Options'][$iOrder],3600);
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return $Out;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------

?>
