<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args = Args();
#-------------------------------------------------------------------------------
$ISPswLicenseID = (integer) @$Args['ISPswLicenseID'];
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('modules/Authorisation.mod','classes/DOM.class.php')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
  #-----------------------------------------------------------------------------
  $ISPswLicense = DB_Select('ISPswLicensesOwners',Array('*'),Array('UNIQ','ID'=>$ISPswLicenseID));
  #-----------------------------------------------------------------------------
  switch(ValueOf($ISPswLicense)){
    case 'error':
      return ERROR | @Trigger_Error(500);
    case 'exception':
      return ERROR | @Trigger_Error(400);
    case 'array':
      # No more...
    break;
    default:
      return ERROR | @Trigger_Error(101);
  }
#-------------------------------------------------------------------------------
$DOM = new DOM();
#-------------------------------------------------------------------------------
$Links = &Links();
# Коллекция ссылок
$Links['DOM'] = &$DOM;
#-------------------------------------------------------------------------------
if(Is_Error($DOM->Load('Window')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Script = new Tag('SCRIPT',Array('type'=>'text/javascript','src'=>'SRC:{Js/Pages/Administrator/ISPswLicenseEdit.js}'));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$DOM->AddText('Title','Редактирование информации о лицензии');
#-------------------------------------------------------------------------------
$Table = $Options = Array();
#-------------------------------------------------------------------------------
$Table[] = 'Общая информация';
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Table[] = Array('Внутренний идентификатор лицензии',$ISPswLicense['ID']);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Table[] = Array('Идентификатор в ISPsystem (elid)',$ISPswLicense['elid']);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Table[] = Array('IP адрес лицензии',$ISPswLicense['IP']);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# CreateDate
$Comp = Comp_Load('Formats/Date/Standard',$ISPswLicense['CreateDate']);
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Table[] = Array('Дата создания лицензии',$Comp);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# UpdateDate
# время_изменения + 31_день - время_сейчас
$m_time = $ISPswLicense['StatusDate'] + 31 * 24 * 3600 - Time();
if($m_time > 0){
	$Comp = Comp_Load('Formats/Date/Remainder', $m_time);
}else{
	$Comp = Comp_Load('Formats/Date/Remainder', 0);
}
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Table[] = Array('До разрешения менять IP',$Comp);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# StatusDate
$Comp = Comp_Load('Formats/Date/Standard',$ISPswLicense['StatusDate']);
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Table[] = Array('Дата установки статуса',$Comp);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# ExpireDate
$Comp = Comp_Load('Formats/Date/Standard',$ISPswLicense['ExpireDate']);
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Table[] = Array('Лицензия истекает',$Comp);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(!$ISPswLicense['ISPname'])
	$ISPswLicense['ISPname'] = '-';
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Formats/String',$ISPswLicense['ISPname'],50);
if(Is_Error($Comp))
        return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Table[] = Array('Имя лицензии',$Comp);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Table[] = 'Данные лицензии';
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Options = Comp_Load('Formats/ISPswOrder/SoftWareList');
if(Is_Error($Options))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Form/Select',Array('name'=>'ISPtype'),$Options,$ISPswLicense['ISPtype']);
if(Is_Error($Comp))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Table[] = Array('Тип лицензии',$Comp);

#-------------------------------------------------------------------------------
$Comp = Comp_Load(
		'Form/Input',
		Array(
			'type'	=> 'text',
			'size'	=> 30,
			'name'	=> 'Flag',
			'value' => $ISPswLicense['Flag']
		)
	);
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-----------------------------------------------------------------------------
$Table[] = Array('Флаг',$Comp);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Form/Input',Array('type'=>'checkbox','name'=>'IsInternal','value'=>'yes'),$ISPswLicense['IsInternal']);
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
if($ISPswLicense['IsInternal'])
	$Comp->AddAttribs(Array('checked'=>'yes'));
#-----------------------------------------------------------------------------
$Table[] = Array(new Tag('SPAN',Array('style'=>'cursor:pointer;','onclick'=>'ChangeCheckBox(\'IsInternal\'); return false;'),'Внутренняя лицензия'),$Comp);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Form/Input',Array('type'=>'checkbox','name'=>'IsUsed','value'=>'yes'),$ISPswLicense['IsUsed']);
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
if($ISPswLicense['IsUsed'])
	$Comp->AddAttribs(Array('checked'=>'yes'));
#-----------------------------------------------------------------------------
$Table[] = Array(new Tag('SPAN',Array('style'=>'cursor:pointer;','onclick'=>'ChangeCheckBox(\'IsUsed\'); return false;'),'Используется'),$Comp);
#-----------------------------------------------------------------------------
#-----------------------------------------------------------------------------
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# ISPname 

#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# StatusID

# Flag

#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Comp = Comp_Load(
  'Form/Input',
  Array(
    'type'    => 'button',
    'onclick' => 'ISPswLicenseEdit();',
    'value'   => 'Сохранить'
  )
);
if(Is_Error($Comp))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Table[] = $Comp;
#-------------------------------------------------------------------------------
#Debug("[comp/www/Administrator/ISPswLicenseEdit]: Table = " . print_r($Table, true));
$Comp = Comp_Load('Tables/Standard',$Table);
if(Is_Error($Comp))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Form = new Tag('FORM',Array('name'=>'ISPswLicenseEditForm','onsubmit'=>'return false;'),$Comp);
#-------------------------------------------------------------------------------
if($ISPswLicenseID){
  #-----------------------------------------------------------------------------
  $Comp = Comp_Load(
    'Form/Input',
    Array(
      'name'  => 'ISPswLicenseID',
      'type'  => 'hidden',
      'value' => $ISPswLicenseID
    )
  );
  if(Is_Error($Comp))
    return ERROR | @Trigger_Error(500);
  #-----------------------------------------------------------------------------
  $Form->AddChild($Comp);
}
#-------------------------------------------------------------------------------
$DOM->AddChild('Into',$Form);
#-------------------------------------------------------------------------------
if(Is_Error($DOM->Build(FALSE)))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
return Array('Status'=>'Ok','DOM'=>$DOM->Object);
#-------------------------------------------------------------------------------

?>
