<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Args');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
if(Is_Error(System_Load('libs/HTTP.php')))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Args = IsSet($Args)?$Args:Args();
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Messages = Messages();
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(!IsSet($Args['code']))
	return TemplateReplace('OAuth.Error',Array('TEXT'=>$Messages['Errors']['OAuth']['NoCode']));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Config = Config();
#-------------------------------------------------------------------------------
$Settings = $Config['Interface']['User']['OAuth']['OK'];
#-------------------------------------------------------------------------------
if(!$Settings['IsActive'])
	return TemplateReplace('OAuth.Error',Array('TEXT'=>$Messages['Errors']['OAuth']['Disabled']));
#-------------------------------------------------------------------------------
if(!$Settings['ClientSecret'] || !$Settings['ClientID'])
	return TemplateReplace('OAuth.Error',Array('TEXT'=>$Messages['Errors']['OAuth']['NoSettings']));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// код для получения токена, меняем на токен
$HTTP = Array(
		'Address'	=> 'api.ok.ru',
		'Port'		=> 443,
		'Host'		=> 'api.ok.ru',
		'Protocol'	=> 'ssl',
		);
#-------------------------------------------------------------------------------
$Body = Array(
		'grant_type'	=> 'authorization_code',
		'code'		=> $Args['code'],
		'client_id'	=> $Settings['ClientID'],
		'client_secret'	=> $Settings['ClientSecret'],
		'redirect_uri'	=> SPrintF('%s://%s/OAuth/OK',URL_SCHEME,HOST_ID),
		);
#-------------------------------------------------------------------------------
$Result = HTTP_Send('/oauth/token.do',$HTTP,Array(),$Body,Array());
if(Is_Error($Result))
	return ERROR | @Trigger_Error('[API]: не удалось выполнить запрос к серверу api.ok.ru');
#-------------------------------------------------------------------------------
$Result = Json_Decode(Trim($Result['Body']),TRUE);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// по полученному токену, достаём данные клиента
$HTTP = Array(
		'Address'	=> 'api.ok.ru',
		'Port'		=> 443,
		'Host'		=> 'api.ok.ru',
		'Protocol'	=> 'ssl',
		);
#-------------------------------------------------------------------------------
$Query = Array('method'=>'users.getCurrentUser','fields'=>'email','access_token'=>$Result['access_token'],'application_key'=>$Settings['PublicKey']);
#-------------------------------------------------------------------------------
$Result = HTTP_Send('/fb.do',$HTTP,$Query,Array(),Array());
#-------------------------------------------------------------------------------
if(Is_Error($Result))
	return ERROR | @Trigger_Error('[API]: не удалось выполнить запрос к серверу api.ok.ru');
#-------------------------------------------------------------------------------
$Result = Json_Decode(Trim($Result['Body']),TRUE);
#-------------------------------------------------------------------------------
// это поделие требует чтобы на api-support@ok.ru накатали письмо с ID приложения и 
// аргуметацией - а зачем вам почтовый адрес пользоватетеля... дурдом, надо отдельную ошибку по 
// этому поводу выводить чтобы на этапе тестирвоания понимали что делать
if(!$Result['default_email'])
	return TemplateReplace('OAuth.Error',Array('TEXT'=>$Messages['Errors']['OAuth']['NoEmail']));
return "STOP";

/*
{
	"uid":"587997562569",
	"birthday":"1979-04-19",
	"birthdaySet":true,
	"age":43,
	"first_name":"Alex",
	"last_name":"Keda",
	"name":"Alex Keda",
	"locale":"ru",
	"gender":"male",
	"has_email":true,
	"location":{
		"city":"",
		"country":"RUSSIAN_FEDERATION",
		"countryCode":"RU",
		"countryName":"Россия"
	},
	"online":"web",
	"pic_1":"https://api.ok.ru/img/stub/user/male/50.png",
	"pic_2":"https://api.ok.ru/img/stub/user/male/128.png",
	"pic_3":"https://api.ok.ru/img/stub/user/male/190.png"
}
 * */

#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# TODO портрет юзера
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// данные для аккаунта
$Address= $Result['default_email'];
$UserID	= $Result['id'];
$Name	= $Result['display_name'];
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$IsUser = Comp_Load('OAuth/ManageAccount','OK',$Address,$UserID,$Name);
#-------------------------------------------------------------------------------
Debug(SPrintF('[comp/www/OAuth/OK]: IsUser = %s',print_r($IsUser,true)));
switch(ValueOf($IsUser)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
        return TemplateReplace('OAuth.Error',Array('TEXT'=>$IsUser->String));
case 'array':
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// делаем Logon юзера
$User = Comp_Load('www/API/Logon',Array('Email'=>$Address));
if(Is_Error($User))
        return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// закрываем окно
return TemplateReplace('OAuth.Error',Array('TEXT'=>$Messages['Errors']['OAuth']['Completed'],'CLOSE'=>1));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------

?>
