<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Args');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
if(Is_Error(System_Load('libs/HTTP.php')))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Args = IsSet($Args)?$Args:Args();
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(!IsSet($Args['code']))
	return "No code given...";
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Config = Config();
#-------------------------------------------------------------------------------
$Settings = $Config['Interface']['User']['OAuth']['Yandex'];
#-------------------------------------------------------------------------------
if(!$Settings['IsActive'])
	return "Yandex OAuth disabled via config...";
#-------------------------------------------------------------------------------
if(!$Settings['ClientSecret'] || !$Settings['ClientID'])
	return "No settings for ClientSecret or ClientID...";
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// яндекс скидывает нам код для получения токена
# https://yandex.ru/dev/id/doc/dg/oauth/reference/auto-code-client.html#auto-code-client__get-token
$HTTP = Array(
		'Address'	=> 'oauth.yandex.ru',
		'Port'		=> 443,
		'Host'		=> 'oauth.yandex.ru',
		'Protocol'	=> 'ssl',
		);
#-------------------------------------------------------------------------------
$Body = Array(
		'grant_type'	=> 'authorization_code',
		'code'		=> $Args['code'],
		'client_id'	=> $Settings['ClientID'],
		'client_secret'	=> $Settings['ClientSecret'],
		);
#-------------------------------------------------------------------------------
$Result = HTTP_Send('/token',$HTTP,Array(),$Body,Array());
if(Is_Error($Result))
	return ERROR | @Trigger_Error('[API]: не удалось выполнить запрос к серверу oauth.yandex.ru');
#-------------------------------------------------------------------------------
$Result = Json_Decode(Trim($Result['Body']),TRUE);
#-------------------------------------------------------------------------------
$Token = $Result['access_token'];
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// по полученному токену, достаём данные клиента
# https://yandex.ru/dev/id/doc/dg/api-id/reference/request.html
$HTTP = Array(
		'Address'	=> 'login.yandex.ru',
		'Port'		=> 443,
		'Host'		=> 'login.yandex.ru',
		'Protocol'	=> 'ssl',
		);
#-------------------------------------------------------------------------------
$Query = Array('format'=>'json','oauth_token'=>$Result['access_token']);
#-------------------------------------------------------------------------------
$Result = HTTP_Send('/info',$HTTP,$Query,Array(),Array());
#-------------------------------------------------------------------------------
if(Is_Error($Result))
	return ERROR | @Trigger_Error('[API]: не удалось выполнить запрос к серверу login.yandex.ru');
#-------------------------------------------------------------------------------
$Result = Json_Decode(Trim($Result['Body']),TRUE);

if(!$Result['default_email'])
	return "default_email not found...";

#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
#
# TODO вынести всё дальнейшее в отдельный компонент, будет использоватсья всеми типами oauth
#
#
// варианты
// 1. адреса что указан в яндексе - не существует. добавляем текущему клиенту (создаём нового?)
// 2. адрес существует, он у этого клиента или не этого, но не первичный делаем его первичным
// 3. адрес существует, он у другого клиента и первичный
//
//
/* у меня такое вернуло
  Array
(
    [id] => 4471424
    [login] => lissyara
    [client_id] => 3b1dda6121e64323ab5202a83b55f531
    [display_name] => Alex Keda
    [real_name] => Алексей Кеда
    [first_name] => Алексей
    [last_name] => Кеда
    [sex] => male
    [default_email] => lissyara@yandex.ru
    [emails] => Array
        (
            [0] => lissyara@yandex.ru
        )

    [default_avatar_id] => 20706/enc-5ae94a7e8f26821d72cc21682a4d20fa
    [is_avatar_empty] => (bool:false)
    [psuid] => 1.AAhgJA.5nYHf89pGgLDyeM5xlM_Hg.JzRUVGEH3dZnZnYTfo4nUw
)

 */

# портрет юзера
# https://yandex.ru/dev/id/doc/dg/api-id/reference/response.html#response__norights_5
# https://avatars.yandex.net/get-yapic/20706/enc-5ae94a7e8f26821d72cc21682a4d20fa/islands-retina-50

$Address = $Result['default_email'];







#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// надо всё это в транзакцию завернуть, чтобы адрес не попортило
if(Is_Error(DB_Transaction($TransactionID = UniqID('ContactEdit'))))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// возможны варианты: добавляет авторизацию, тогда $GLOBALS['__USER']['ID'] задана, или же входит/регистрируется
if(IsSet($GLOBALS['__USER']['ID'])){
	#-------------------------------------------------------------------------------
	// проверяем что адрес не является первичным у какого-то другого юзера
	$Where = Array(SPrintF('`Address` = "%s"',$Address),SPrintF('`UserID` != %u',$GLOBALS['__USER']['ID']),'`MethodID` = "Email"','`IsPrimary` = "yes"');
	#-------------------------------------------------------------------------------
	$Count = DB_Count('ContactsOwners',Array('Where'=>$Where));
	if(Is_Error($Count))
		return ERROR | @Trigger_Error(500);
	#-------------------------------------------------------------------------------
	if($Count)
		return SPrintF('Address "%s" used by login for another user...',$Address);
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	// проверяем что адрес уже не добавлен у этого же юзера
	$Where = Array(SPrintF('`Address` = "%s"',$Address),SPrintF('`UserID` = %u',$GLOBALS['__USER']['ID']),'`MethodID` = "Email"');
	#-------------------------------------------------------------------------------
	$AddressCount = DB_Count('ContactsOwners',Array('Where'=>$Where));
	if(Is_Error($AddressCount))
		return ERROR | @Trigger_Error(500);
	#-------------------------------------------------------------------------------
	// возможно, адрес скрыт. тогда это добавление ранее удалённого, надо его грохнуть, пусть добавляет
	$Where[] = '`IsHidden` = "yes"';
	#-------------------------------------------------------------------------------
	$AddressCountHidden = DB_Count('ContactsOwners',Array('Where'=>$Where));
	if(Is_Error($AddressCountHidden))
		return ERROR | @Trigger_Error(500);
	#-------------------------------------------------------------------------------
	if($AddressCountHidden){
		#-------------------------------------------------------------------------------
		$IsDelete = DB_Delete('Contacts',Array('Where'=>$Where));
		if(Is_Error($IsDelete))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
		// обнуляем счётчик, нету такого адерса больше же
		$AddressCount = 0;
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	// если адрес есть, достаём его данные
	if($AddressCount > 0){
		#-------------------------------------------------------------------------------
		$Where = Array(SPrintF('`Address` = "%s"',$Address),SPrintF('`UserID` = %u',$GLOBALS['__USER']['ID']),'`MethodID` = "Email"');
		#-------------------------------------------------------------------------------
		$Contact = DB_Select('Contacts',Array('*'),Array('UNIQ','Where'=>$Where));
		#-------------------------------------------------------------------------------
		switch(ValueOf($Contact)){
		case 'error':
			return ERROR | @Trigger_Error(500);
		case 'exception':
			return ERROR | @Trigger_Error(400);
		case 'array':
			#-------------------------------------------------------------------------------
			break;
			#-------------------------------------------------------------------------------
		default:
			return ERROR | @Trigger_Error(101);
		}
		#-------------------------------------------------------------------------------
		// делаем все адреса НЕ-первичными
		$IsUpdate = DB_Update('Contacts',Array('IsPrimary'=>FALSE),Array('Where'=>SPrintF('`UserID` = %u',$Contact['UserID'])));
		if(Is_Error($IsUpdate))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
	}else{
		#-------------------------------------------------------------------------------
		$Contact = Array(
					'CreateDate'	=> Time(),
					'UserID'	=> $GLOBALS['__USER']['ID'],
					'MethodID'	=> 'Email',
					'Address'	=> $Address,
				);
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	// добавляем испаравляем поля
	$Contact['ExternalID']	= SPrintF('YandexID:%s',$Result['id']);
	$Contact['Confirmed']	= Time();
	$Contact['IsPrimary']	= TRUE;
	$Contact['IsActive']	= TRUE;
	$Contact['UserNotice']	= 'Добавлено Yandex OAuth';
	#-------------------------------------------------------------------------------
	// если есть идентификатор - обновляем, если нету - инзёртим
	if(IsSet($Contact['ID'])){
		#-------------------------------------------------------------------------------
		$IsUpdate = DB_Update('Contacts',$Contact,Array('ID'=>$Contact['ID']));
		if(Is_Error($IsUpdate))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
	}else{
		#-------------------------------------------------------------------------------
		$IsInsert = DB_Insert('Contacts',$Contact);
		if(Is_Error($IsInsert))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	// правим Email, имя в таблице юзеров
	$IsUpdate = DB_Update('Users',Array('Email'=>$Address,'Name'=>DB_Escape($Result['display_name'])),Array('ID'=>$Contact['UserID']));
	if(Is_Error($IsUpdate))
		return ERROR | @Trigger_Error(500);
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	// фотку юзера можно подсосать...

}else{
	#-------------------------------------------------------------------------------
	// это вход или регистрация, проверяем
	$Where = Array(SPrintF('`Address` = "%s"',$Address),'`MethodID` = "Email"','`IsPrimary` = "yes"','`IsHidden` = "no"',SPrintF('`ExternalID` = "YandexID:%s"',$Result['id']));
	#-------------------------------------------------------------------------------
	$Contact = DB_Select('ContactsOwners','*',Array('UNIQ','Where'=>$Where));
	switch(ValueOf($Contact)){
	case 'error':
		return ERROR | @Trigger_Error(500);
	case 'exception':
		#-------------------------------------------------------------------------------
		// не найдено, регистрация
		$Password = Comp_Load('Passwords/Generator');
		if(Is_Error($Password))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
		$User = Comp_Load('www/API/UserRegister',Array('Name'=>$Result['display_name'],'Password'=>$Password,'Email'=>$Address,'Message'=>'Регистрация через OAuth Yandex','IsInternal'=>TRUE,'ExternalID'=>SPrintF('YandexID:%s',$Result['id'])));
		#-------------------------------------------------------------------------------
		switch(ValueOf($User)){
		case 'error':
			return ERROR | @Trigger_Error(500);
		case 'exception':
			return ERROR | @Trigger_Error(400);
		case 'array':
			break;
		default:
			return ERROR | @Trigger_Error(101);
		}
		#-------------------------------------------------------------------------------
	case 'array':
		#-------------------------------------------------------------------------------
		break;
		#-------------------------------------------------------------------------------
	default:
		return ERROR | @Trigger_Error(101);
	}
	#-------------------------------------------------------------------------------
	
	
	#-------------------------------------------------------------------------------
}




#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// коммитим изменения
if(Is_Error(DB_Commit($TransactionID)))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// делаем Logon юзера
$User = Comp_Load('www/API/Logon',Array('Email'=>$Address));
if(Is_Error($User))
        return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// закрываем окно
return '<HTML><BODY OnLoad="window.close();"/></HTML>';
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------

?>
