<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('DSOrder');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
switch($DSOrder['StatusID']){
case 'Waiting':
	#-------------------------------------------------------------------------------
	# No more...
	break;
	#-------------------------------------------------------------------------------
case 'Deleted':
	#-------------------------------------------------------------------------------
	$Count = DB_Count('Tasks',Array('Where'=>Array(SPrintF('`UserID` = %u', $DSOrder['UserID']),"`IsExecuted` = 'no'")));
	if(Is_Error($Count))
		return ERROR | @Trigger_Error(500);
	#-------------------------------------------------------------------------------
	if($Count)
		if(Time() - $DSOrder['StatusDate'] < 600)
			return new gException('SYNCHRONIZATION_WAITING','Синхронизация по удалению заказа еще не произведена. Пожалуйста, повторите запрос через 10 минут.');
	#-------------------------------------------------------------------------------
	break;
	#-------------------------------------------------------------------------------
default:
	return new gException('DELETE_DENIED','Удаление заказа не возможно');
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Parked = Array($DSOrder['IP']);
#-------------------------------------------------------------------------------
if($DSOrder['ExtraIP'])
	foreach(Explode("\n",$DSOrder['ExtraIP']) as $IP)
		if(!In_Array(Trim($IP),$Parked))
			$Parked[] = Trim($IP);
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Services/Orders/OrdersHistory',Array('OrderID'=>$DSOrder['OrderID'],'Parked'=>$Parked));
switch(ValueOf($Comp)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return $Comp;
case 'array':
	return TRUE;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------

?>
