<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('ServersGroup');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Count = DB_Count('HostingSchemes',Array('Where'=>SPrintF('`ServersGroupID` = %u',$ServersGroup['ID'])));
if(Is_Error($Count))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
if($Count)
  return new gException('DELETE_DENIED',SPrintF('Удаление группы серверов (%s) не возможно, %u тариф(ов) связаны с данной группой',$ServersGroup['Name'],$Count));
#-------------------------------------------------------------------------------
$Count = DB_Count('HostingServers',Array('Where'=>SPrintF('`ServersGroupID` = %u',$ServersGroup['ID'])));
if(Is_Error($Count))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
if($Count)
  return new gException('DELETE_DENIED',SPrintF('Удаление группы серверов (%s) не возможно, %u сервер(ов) связаны с данной группой',$ServersGroup['Name'],$Count));
#-------------------------------------------------------------------------------
return TRUE;
#-------------------------------------------------------------------------------

?>
