<?php

#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('HostingServer');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Count = DB_Count('HostingSchemes',Array('Where'=>SPrintF('`HardServerID` = %u',$HostingServer['ID'])));
if(Is_Error($Count))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
if($Count)
  return new gException('DELETE_DENIED',SPrintF('Удаление сервера (%s) не возможно, %u тариф(ов) жёстко связаны с данным сервером',$HostingServer['Address'],$Count));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Count = DB_Count('HostingOrders',Array('Where'=>SPrintF('`ServerID` = %u',$HostingServer['ID'])));
if(Is_Error($Count))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
if($Count)
  return new gException('DELETE_DENIED',SPrintF('Удаление сервера (%s) не возможно, %u заказ(ов) связаны с данным сервером',$HostingServer['Address'],$Count));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return TRUE;
#-------------------------------------------------------------------------------

?>
