<?php

/** @author Великодный В.В. (Joonte Ltd.) */

$__args_list = Array('LinkID');

Eval(COMP_INIT);

$Links = &Links();
# Коллекция ссылок
$Template = &$Links[$LinkID];
/******************************************************************************/
/******************************************************************************/
# Параметры выборки и вывода
$Query = &$Template['Query'];
#-------------------------------------------------------------------------------
# Исходный источник
$Source = &$Template['Source'];
#-------------------------------------------------------------------------------
# Идентификатор таблицы
$TableID = $Source['TableID'];
#-------------------------------------------------------------------------------
$ConditionWhere = $Source['Conditions']['Where'];
#-------------------------------------------------------------------------------
$Count = DB_Count($TableID,Array('Where'=>$ConditionWhere));
if(Is_Error($Count))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Source['Conditions']['Count'] = $Count;
#-------------------------------------------------------------------------------
$Where = $ConditionWhere;
#-------------------------------------------------------------------------------
$AddingWhere = $Source['Adding']['Where'];
#-------------------------------------------------------------------------------
$Count = DB_Count($TableID,Array('Where'=>$AddingWhere));
if(Is_Error($Count))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Source['Adding']['Count'] = $Count;
#-------------------------------------------------------------------------------
$Where = Array_Merge($Where,$AddingWhere);
#-------------------------------------------------------------------------------
$Where = Implode(' AND ',$Where);
#-------------------------------------------------------------------------------
// а вот на php 5.6 нормально работало с GroupBy'=>$Query['GroupBy']
// TODO разобраться в причинах.
$Count = DB_Count($TableID, Array('Where'=>$Where/*, 'GroupBy'=>$Query['GroupBy']*/));
if(Is_Error($Count))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Source['Count'] = $Count;
//Debug(SPrintF('[comp/Tables/Providers/SQL]: Source Count = %s',$Count));
//print_r($Count);
//die();
#-------------------------------------------------------------------------------
$Request = Array('Where'=>$Where,'SortOn'=>$Query['SortOn'],'IsDesc'=>$Query['IsDesc'], 'GroupBy'=>$Query['GroupBy']);
#-------------------------------------------------------------------------------
$InPage = $Template['Query']['InPage'];
#-------------------------------------------------------------------------------
$Index = &$Query['Index'];
#-------------------------------------------------------------------------------
$Index = Min(Max(0,$Index),(integer)(($Count > $InPage?$Count:0)/$InPage));
#-------------------------------------------------------------------------------
$Request['Limits'] = Array('Start'=>$Index*$InPage,'Length'=>$InPage);
#-------------------------------------------------------------------------------
$ColumnsIDs = $Source['ColumnsIDs'];
#-------------------------------------------------------------------------------
$Columns = $Template['Columns'];
#-------------------------------------------------------------------------------
foreach($Template['Sequence'] as $ColumnID){
  #-----------------------------------------------------------------------------
  $Column = $Columns[$ColumnID];
  #-----------------------------------------------------------------------------
  if(IsSet($Column['Alias']))
    $ColumnsIDs[] = SPrintF('%s as `%s`',$Column['Alias'],$ColumnID);
}
#-------------------------------------------------------------------------------
$Data = DB_Select($TableID,$ColumnsIDs,$Request);
#-------------------------------------------------------------------------------
switch(ValueOf($Data)){
  case 'error':
    return ERROR | @Trigger_Error(500);
  case 'exception':
    return FALSE;
  case 'array':
    #---------------------------------------------------------------------------
    $Source['Data'] = $Data;
    #---------------------------------------------------------------------------
    return TRUE;
  default:
    return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------

?>
