/** @author Бреславский А.В. (Joonte Ltd.) */
//------------------------------------------------------------------------------
function DomainsSchemesGroupEdit(){
  //----------------------------------------------------------------------------
  var $Form = document.forms['DomainsSchemesGroupEditForm'];
  //----------------------------------------------------------------------------
  $HTTP = new HTTP();
  //----------------------------------------------------------------------------
  if(!$HTTP.Resource){
    //--------------------------------------------------------------------------
    alert('Не удалось создать HTTP соединение');
    //--------------------------------------------------------------------------
    return false;
  }
  //----------------------------------------------------------------------------
  $HTTP.onLoaded = function(){
    //--------------------------------------------------------------------------
    HideProgress();
  }
  //----------------------------------------------------------------------------
  $HTTP.onAnswer = function($Answer){
    //--------------------------------------------------------------------------
    switch($Answer.Status){
      case 'Error':
        ShowAlert($Answer.Error.String,'Warning');
      break;
      case 'Exception':
        ShowAlert(ExceptionsStack($Answer.Exception),'Warning');
      break;
      case 'Ok':
        //----------------------------------------------------------------------
        if(!$Form.DomainsSchemesGroupID){
          //--------------------------------------------------------------------
          ShowWindow('/Administrator/DomainsSchemesGroupEdit',{DomainsSchemesGroupID:$Answer.DomainsSchemesGroupID});
        }else
          GetURL(document.location);
      break;
      default:
        alert('Не известный ответ');
    }
  }
  //----------------------------------------------------------------------------
  var $Args = FormGet($Form);
  //----------------------------------------------------------------------------
  if(!$HTTP.Send('/Administrator/API/DomainsSchemesGroupEdit',$Args)){
    //--------------------------------------------------------------------------
    alert('Не удалось отправить запрос на сервер');
    //--------------------------------------------------------------------------
    return false;
  }
  //----------------------------------------------------------------------------
  ShowProgress($Form.DomainsSchemesGroupID?'Редактирование группы тарифов на домены':'Добавление группы тарифов на домены');
}