/** @author Бреславский А.В. (Joonte Ltd.) */
//------------------------------------------------------------------------------
function SettingsUpdate(){
  //----------------------------------------------------------------------------
  var $Form = document.forms['RegistratorEditForm'];
  //----------------------------------------------------------------------------
  var $Type = Settings[$Form.TypeID.value];
  //----------------------------------------------------------------------------
  for(var i in $Type)
    $Form[i].value = $Type[i];
  //----------------------------------------------------------------------------
  $Form['PrefixAPI'].disabled = !$Form['PrefixAPI'].value;
}
//------------------------------------------------------------------------------
function RegistratorEdit(){
  //----------------------------------------------------------------------------
  var $Form = document.forms['RegistratorEditForm'];
  //----------------------------------------------------------------------------
  $HTTP = new HTTP();
  //----------------------------------------------------------------------------
  if(!$HTTP.Resource){
    //--------------------------------------------------------------------------
    alert('Не удалось создать HTTP соединение');
    //--------------------------------------------------------------------------
    return false;
  }
  //----------------------------------------------------------------------------
  $HTTP.onLoaded = function(){
    //--------------------------------------------------------------------------
    HideProgress();
  }
  //----------------------------------------------------------------------------
  $HTTP.onAnswer = function($Answer){
    //--------------------------------------------------------------------------
    switch($Answer.Status){
      case 'Error':
        ShowAlert($Answer.Error.String,'Warning');
      break;
      case 'Exception':
        ShowAlert(ExceptionsStack($Answer.Exception),'Warning');
      break;
      case 'Ok':
        GetURL(document.location);
      break;
      default:
        alert('Не известный ответ');
    }
  }
  //----------------------------------------------------------------------------
  var $Args = FormGet($Form);
  //----------------------------------------------------------------------------
  if(!$HTTP.Send('/Administrator/API/RegistratorEdit',$Args)){
    //--------------------------------------------------------------------------
    alert('Не удалось отправить запрос на сервер');
    //--------------------------------------------------------------------------
    return false;
  }
  //----------------------------------------------------------------------------
  ShowProgress($Form.RegistratorID?'Редактирование регистратора':'Добавление регистратора');
}