set @Text = '<NOBODY>
 <P align="justify">Настоящий Регламент определяет порядок оказания услуг Исполнителем, своим Заказчикам по размещению виртуального web-сервера на оборудовании исполнителя, а так же, порядок использования таких услуг со стороны Заказчика или пользователя, порядок взаимодействия между Исполнителем и Заказчиком или пользователем, а также иные вопросы, не оговоренные явно в Договоре.</P>
 <H2>1. Предоставление услуг</H2>
 <TABLE width="100%">
  <TR>
   <TD valign="top">1.1.</TD>
   <TD align="justify" width="95%">Учитывая, что Интернет распространен практически во всех государствах мира, имеющих различное законодательство, Исполнитель настоящим Договором предупреждает Заказчика, что случайные или намеренные действия в Интернет могут привести к нарушению национального законодательства других стран. Исполнитель не несет ответственности за такие возможные нарушения со стороны Заказчика.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">1.2.</TD>
   <TD align="justify" width="95%">Заказчик принимает на себя полную ответственность и риски, связанные с использованием сети Интернет посредством Услуг, в том числе ответственность за оценку точности, полноты и полезности любых мнений, идей, иной информации, а также свойств товаров и услуг, распространяемых в Интернет и предоставляемых Заказчику посредством Услуг.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">1.3.</TD>
   <TD align="justify" width="95%">В случае если Заказчик предоставляет третьим лицам доступ к имеющимся у него ресурсам и сервисам, ответственность за деятельность таких третьих лиц несет исключительно Заказчик.</TD>
  </TR>
 </TABLE>
 <H2>2. Права и ответственность сторон</H2>
 <TABLE width="100%">
  <TR>
   <TD valign="top">2.1.</TD>
   <TD align="justify" width="95%">
    <SPAN>Исполнитель, сохраняя за собой все права по Договору вправе незамедлительно приостановить оказание услуг в случаях:</SPAN>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">если по обоснованному мнению Исполнителя использование Заказчиком услуг может нанести ущерб Исполнителю и/или вызвать сбой технических и программных средств Исполнителя и третьих лиц;</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">наличия со стороны Заказчика действий, направленных на то, чтобы посылать, публиковать, передавать, воспроизводить, распространять, любым способом, а так же в любом виде использовать полученные посредством услуг программное обеспечение и/или другие материалы, полностью или частично защищенные авторскими и другими правами, без разрешения правообладателя;</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">публикации и/или передачи со стороны Заказчика, с использованием оборудования Исполнителя, любой информации, относящейся к пропаганде жестокости, насилия, совершению террористических актов, разжиганию расовой, национальной, религиозной вражды, пропаганде войны.</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">наличия со стороны Заказчика действий, направленных на то, чтобы посылать, публиковать, передавать, распространять любым способом любую информацию или программное обеспечение, которое содержит в себе какие-либо вредоносные компоненты;</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">наличия со стороны Заказчика действий, направленных на то, чтобы посылать содержащую рекламу информацию (спам) без согласия со стороны адресата при наличие письменных заявлений от получателей такой рассылки на имя Исполнителя с обоснованными претензиями на адрес Заказчика. При этом понятие "спам" определяется общеизвестными "правилами пользования сетью" размещенными в сети Интернет и являющимися обычаем делового оборота;</TD>
     </TR>
    </TABLE>
   </TD>
  </TR>
 </TABLE>
 <HR BREAK="" />
 <TABLE>
  <TR>
   <TD width="5%" />
   <TD align="justify" width="95%">
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">наличия со стороны Заказчика действий, направленных на то, чтобы посылать, публиковать, распространять либо использовать идентификационные персональные данные (имена, адреса, телефоны и т.п.) третьих лиц, кроме случаев, когда эти лица прямо уполномочили Заказчика на такое использование;</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">распространения и/или публикации любой информации, которая противоречит требованиям законодательства Российской Федерации, положениям лицензий Министерства связи РФ (Министерства информационных технологий и связи в РФ), нормам международного права, и ущемляет права третьих лиц, а так же перенаправление пользователей на ресурсы сети Интернет содержащих такую информацию;</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">опубликования или распространения Заказчиком любой информации или программного обеспечения, которое содержит в себе коды, по своему действию соответствующие действию компьютерных вирусов или других компонентов, приравненных к ним;</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">рекламирования товаров, услуг, иных материалов, распространение которых ограничено либо запрещено действующим законодательством Российской Федерации;</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">фальсифицирования своего IР-адреса, а также адресов, используемых в других сетевых протоколах, при передаче данных в сеть Интернет;</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">использования несуществующих обратных адресов при отправке электронных писем и других сообщений;</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">осуществления действий, направленных на нарушение нормального функционирования элементов сети Интернет (компьютеров, другого оборудования или программного обеспечения), не принадлежащих Заказчику;</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">осуществления действий, направленных на получение несанкционированного доступа к ресурсу Сети (компьютеру, другому оборудованию или информационному ресурсу), последующее использование такого доступа, а также уничтожение или модификация программного обеспечения или данных, не принадлежащих Заказчику, без согласования с владельцами этого программного обеспечения или данных либо администраторами данного информационного ресурса. Под несанкционированным доступом понимается любой доступ способом, отличным от предполагавшегося владельцем ресурса;</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">осуществления действий по передаче компьютерам или оборудованию третьих лиц бессмысленной или бесполезной информации, создающей излишнюю (паразитную) нагрузку на эти компьютеры или оборудование, а также промежуточные участки  сети, в объемах, превышающих минимально необходимые для проверки связности сетей и доступности отдельных ее элементов;</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">осуществления действий по сканированию узлов сетей с целью выявления внутренней структуры сетей, уязвимости безопасности, списков открытых портов и т.п., без явного согласия владельца проверяемого ресурса;</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">осуществления иных действий, не предусмотренных Договором и/или Стандартами, но содержащих состав уголовного либо административного правонарушения, либо нарушающих права и законные интересы третьих лиц;</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">если Исполнитель получает соответствующий запрос или указание со стороны какого-либо государственного, регулирующего или иного компетентного органа;</TD>
     </TR>
    </TABLE>
   </TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">2.2.</TD>
   <TD align="justify" width="95%">Время приостановления оказания услуг по причинам, указанным в п. 2.1, не считается перерывом в оказании услуг и не может рассматриваться как нарушение Исполнителем своих обязательств, предусмотренных Договором и Приложениями к нему.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">2.3.</TD>
   <TD align="justify" width="95%">Приостановление оказания услуг и/или отключение программных или аппаратных средств Заказчика осуществляется до выполнения Заказчиком требований Исполнителя по устранению нарушений и не отменяет выполнения Заказчиком всех своих обязательств по Договору.</TD>
  </TR>
 </TABLE>
 <HR BREAK="" />
 <TABLE width="100%">
  <TR>
   <TD valign="top">2.5.</TD>
   <TD align="justify" width="95%">Исполнитель не гарантирует принятие почты Заказчика от удаленных сетей, функционирование которых привело к занесению адреса такой сети в списки, по которым программа доставки почты Исполнителя не осуществляет прием почты.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">2.6.</TD>
   <TD align="justify" width="95%">Исполнитель не контролирует содержание информации, хранимой, публикуемой или распространяемой Заказчиком с использованием предоставленных услуг, и не несет никакой ответственности за точность, качество и содержание такой информации.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">2.7.</TD>
   <TD align="justify" width="95%">Исполнитель не несет ответственности за содержание информационных узлов, создаваемых и поддерживаемых Заказчиком или пользователями, и не осуществляет какой-либо предварительной цензуры. В случае явного нарушения законодательства предоставление Услуг может быть приостановлено без предварительного предупреждения. При этом Исполнитель имеет право при необходимости контролировать содержание информационных ресурсов Заказчика или его пользователей.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">2.8.</TD>
   <TD align="justify" width="95%">Исполнитель не несет ответственности за нарушение прав третьих лиц, возникших в результате действий Заказчика, совершенных с использованием Услуг, предоставляемых Исполнителем.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">2.9.</TD>
   <TD align="justify" width="95%">Исполнитель не несет ответственности за качество каналов связи общего пользования, посредством которых осуществляется доступ к Услугам.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">2.10.</TD>
   <TD align="justify" width="95%">Исполнитель не несет ответственности по претензиям Заказчика к качеству соединения с сетью Интернет, связанным с качеством функционирования сетей других провайдеров, политикой обмена трафиком между провайдерами, с функционированием оборудования и программного обеспечения Заказчика и другими обстоятельствами, находящимися вне зоны компетенции, влияния и контроля Исполнителя.</TD>
  </TR>
 </TABLE>
 <H2>3. Порядок обработки заявок СТП</H2>
 <TABLE width="100%">
  <TR>
   <TD valign="top">3.1.</TD>
   <TD align="justify" width="95%">СТП осуществляет управление, контроль над работой технического оборудования и системных программных средств, обеспечивает предоставление надлежащего сервиса Заказчику в пределах, обусловленных Договором, а также осуществляет обработку запросов Заказчика.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">3.2.</TD>
   <TD align="justify" width="95%">
    <SPAN>Каждая заявка имеет приоритет исполнения. Заказчик выставляет приоритет заявке по следующему правилу:</SPAN>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">Высокий - используется только в случаях крайней необходимости, если виртуальный web-сервер Заказчика и/или один из сервисов (MYSQL, FTP, POP/SMTP) недоступен.</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">Средний - проблемы технического характера, которые Заказчик не можете устранить самостоятельно.</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">Низкий - вопросы, просьбы, предложения Заказчика, а также все остальное, что не вошло в другие приоритеты.</TD>
     </TR>
    </TABLE>
   </TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">3.3.</TD>
   <TD align="justify" width="95%">
    <SPAN>Следующие действия выполняются СТП только при отправлении заявки посредством АСУ:</SPAN>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">удаление какой-либо информации Заказчика;</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">изменение любых паролей доступа к ресурсам Заказчика;</TD>
     </TR>
    </TABLE>
   </TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">3.4.</TD>
   <TD align="justify" width="95%">Заказчик также может обратиться в СТП по телефону, однако изменения в конфигурации серверов производятся только на основании письменных заявок по каналам связи.</TD>
  </TR>
 </TABLE>
 <H2>4. Обеспечение информационной безопасности и целостности данных</H2>
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.1.</TD>
   <TD align="justify" width="95%">Исполнитель обеспечивает базовую информационную безопасность серверов и ресурсов Заказчика в пределах, определяемых обычными условиями, если только в Договоре явно не оговорено иное.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.2.</TD>
   <TD align="justify" width="95%">Исполнитель не несет ответственности за возможную компрометацию паролей Заказчика, произошедшую по его вине, но по требованию Заказчика производит оперативную смену таких паролей.</TD>
  </TR>
 </TABLE>
 <HR BREAK="" />
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.3.</TD>
   <TD align="justify" width="95%">Исполнитель обеспечивает резервное копирование статической информации Заказчика, размещенной на серверах Исполнителя, по собственному графику (7 раз в неделю), если только такой график и порядок создания резервных копий не оговорены особо в условиях Договора.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.4.</TD>
   <TD align="justify" width="95%">В случаях, если потеря информации произошла по вине Исполнителя, он принимает все необходимые меры для максимально быстрого восстановления информации.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.5.</TD>
   <TD align="justify" width="95%">Если потеря данных была вызвана действиями Заказчика, восстановление данных производится по запросу в СТП в течение 48 часов.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.6.</TD>
   <TD align="justify" width="95%">Если в условиях Договора не оговорен особый режим резервного копирования (рассматриваемый как дополнительная услуга), восстановление производится из последнего архива.</TD>
  </TR>
 </TABLE>
 <H2>5. Функционирование программного обеспечения клиентов</H2>
 <TABLE width="100%">
  <TR>
   <TD valign="top">5.1.</TD>
   <TD align="justify" width="95%">Исполнитель обеспечивает работоспособность предоставляемых сервисов и их совместимость с другим программным обеспечением в пределах, определяемых документацией на соответствующие сервисы.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">5.2.</TD>
   <TD align="justify" width="95%">Исполнитель не гарантирует работоспособность и совместимость программного обеспечения, разработанного Заказчиком, или третьими лицами. Программные средства могут быть установлены и использованы Заказчиком без какой-либо гарантии со стороны Исполнителя.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">5.3.</TD>
   <TD align="justify" width="95%">Исполнитель не гарантирует работоспособность предоставленного им программного обеспечения в случае, если Заказчик вносил в это программное обеспечение свои изменения.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">5.4.</TD>
   <TD align="justify" width="95%">Исполнитель вправе приостанавливать, блокировать или запрещать использование Заказчиком программного обеспечения (ПО) в случае, если эксплуатация такого программного обеспечения приводит или может привести к аварийным ситуациям, нарушению системы безопасности, нарушению настоящего Регламента или условий Договора.</TD>
  </TR>
 </TABLE>
 <H2>6. Использование ресурсов системы</H2>
 <TABLE width="100%">
  <TR>
   <TD valign="top">6.1.</TD>
   <TD align="justify" width="95%">Заказчик использует ресурсы системы Исполнителя в соответствии с тарифным планом, если только дополнительными соглашениями не оговорено иное.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">6.2.</TD>
   <TD align="justify" width="95%">В целях коллективной безопасности Исполнитель оставляет за собой право приостановить предоставление услуги Заказчику в случае нанесения им вреда Исполнителю, либо какому-либо из его клиентов.</TD>
  </TR>
 </TABLE>
</NOBODY>';
-- SEPARATOR
INSERT INTO `Clauses`
  (`AuthorID`,`EditorID`,`IsXML`,`IsDOM`,`Partition`,`Title`,`Text`)
VALUES
(100,100,'yes','yes','Contracts/Enclosures/Types/HostingRules/Content','Регламент предоставления услуг хостинга',@Text);
-- SEPARATOR
set @Text = '<NOBODY>
 <P align="justify">Настоящий Регламент определяет порядок оказания услуг Исполнителем, своим Заказчикам по регистрации доменных имен, а так же, порядок использования таких услуг со стороны Заказчика или пользователя, порядок взаимодействия между Исполнителем и Заказчиком или пользователем, а также иные вопросы, не оговоренные явно в Договоре.</P>
 <H2>1. Термины и определения</H2>
 <TABLE width="100%">
  <TR>
   <TD valign="top">1.1.</TD>
   <TD align="justify" width="95%">Домен - область пространства иерархических имен сети Интернет, которая обозначается уникальным доменным именем, обслуживается набором серверов доменных имен (DNS) и централизованно администрируется Администратором домена. Для каждого зарегистрированного доменного имени определен единственный Администратор.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">1.2.</TD>
   <TD align="justify" width="95%">Реестр - центральная база данных домена, содержащая информацию о зарегистрированных доменных именах, Администраторах доменов, иную информацию, необходимую для регистрации доменов.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">1.3.</TD>
   <TD align="justify" width="95%">Регистратор - юридическое лицо, оказывающее услуги по регистрации доменных имен и обеспечивающее передачу в Реестр необходимой информации.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">1.4.</TD>
   <TD align="justify" width="95%">Заявитель (Заказчик) - физическое или юридическое лицо, обратившееся за услугой по регистрации доменного имени и заключившее с этой целью Договор с Исполнителем.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">1.5.</TD>
   <TD align="justify" width="95%">Регистрация доменного имени - занесение Регистратором в Реестр на основании заявки Заявителя информации о доменном имени и его Администраторе. Доменное имя считается зарегистрированным с момента занесения в Реестр информации о нем. Срок действия регистрации, в течение которого осуществляется хранение в Реестре информации о доменном имени, равен количеству лет, которое оплатил Заказчик. Регистрация домена может быть продлена.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">1.6.</TD>
   <TD align="justify" width="95%">Администратор домена - лицо, на имя которого зарегистрирован домен. Администратор домена определяет порядок использования домена; несет ответственность за выбор доменного имени, возможные нарушения прав третьих лиц, связанные с выбором и использованием доменного имени, а также несет риск убытков, связанных с такими нарушениями.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">1.7.</TD>
   <TD align="justify" width="95%">Администрирование домена - определение Администратором домена порядка использования домена и осуществление организационной и технической поддержки его функционирования.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">1.8.</TD>
   <TD align="justify" width="95%">Аннулирование регистрации (освобождение доменного имени) - исключение информации о доменном имени и его Администраторе из Реестра.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">1.9.</TD>
   <TD align="justify" width="95%">Делегирование домена - размещение и хранение информации о доменном имени и соответствующих ему серверах доменных имен (DNS) на корневых серверах DNS домена, что обеспечивает функционирование домена в сети Интернет. Делегирование домена возможно только в течение срока действия регистрации домена.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">1.10.</TD>
   <TD align="justify" width="95%">Заявка (Заказ) - обращение Исполнителя к Регистратору по установленной Регистратором форме, содержащее все необходимые сведения для регистрации (продления срока действия регистрации) доменного имени, либо изменяющие ранее сообщенные сведения.</TD>
  </TR>
 </TABLE>
 <H2>2. Общие положения</H2>
 <TABLE width="100%">
  <TR>
   <TD valign="top">2.1.</TD>
   <TD align="justify" width="95%">Исполнитель осуществляет деятельность по регистрации доменных имен на основании договоров с Регистраторами доменов.</TD>
  </TR>
 </TABLE>
 <HR BREAK="" />
 <TABLE width="100%">
  <TR>
   <TD valign="top">2.2.</TD>
   <TD align="justify" width="95%">Заказ услуги является согласием Заказчика оплатить услугу по ценам, действующим на день начала исполнения Заказа.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">2.3.</TD>
   <TD align="justify" width="95%">Услуга предоставляется Заказчику на основании Договора, при наличии Заказа на услугу и при условии выполнения всех необходимых требований настоящего Регламента.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">2.4.</TD>
   <TD align="justify" width="95%">Услуга по регистрации домена считается оказанной с момента внесения в Реестр информации о домене.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">2.5.</TD>
   <TD align="justify" width="95%">Услуга по продлению регистрации домена считается оказанной с момента внесения в Реестр сведений о продлении регистрации на кол-во лет, которое оплатил Заказчик.</TD>
  </TR>
 </TABLE>
 <H2>3. Условия регистрации и делегирования доменов</H2>
 <TABLE width="100%">
  <TR>
   <TD valign="top">3.1.</TD>
   <TD align="justify" width="95%">
    <SPAN>Условия регистрации домена. Регистрация домена не осуществляется в следующих случаях:</SPAN>
   </TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">3.1.1.</TD>
   <TD align="justify" width="95%">Доменное имя уже зарегистрировано.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">3.1.2</TD>
   <TD align="justify" width="95%">Доменное имя не удовлетворяет следующим требованиям:
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">не содержит минимального колличества символов в имени домена, определенного для выбранной доменной зоны или является зарезервированным и не доступным для публичного использования именем;</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">•</TD>
      <TD align="justify" width="98%">в качестве доменного имени используются слова, противоречащие общественным интересам, принципам гуманности и морали (в частности, слова непристойного содержания, призывы антигуманного характера, оскорбляющие человеческое достоинство либо религиозные чувства, и т.д.)</TD>
     </TR>
    </TABLE>
   </TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">3.2.</TD>
   <TD align="justify" width="95%">
    <SPAN>Условия делегирования домена</SPAN>
   </TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">3.2.1.</TD>
   <TD align="justify" width="95%">
     <SPAN>Делегирование домена может быть осуществлено только после получения положительных результатов проверки правильности функционирования указанных Заказчиком серверов доменных имен (primary и secondary DNS), содержащих конфигурационные файлы зарегистрированного домена.</SPAN>
     <P>По крайней мере два из заявленных Заказчиком DNS-серверов должны иметь разные IP адреса и иметь надежное подключение к сети Интернет. Под "надежным подключением" понимается такое, при котором суммарное время отсутствия связи с сервером не превышает двух часов в сутки. Сопровождение указанных серверов должно соответствовать требованиям, изложенным в международных стандартах RFC-1032, RFC-1033, RFC-1034 и RFC-1591.</P>
     <P>В случае неполучения положительных результатов проверки правильности функционирования серверов доменных имен тестирование DNS-серверов прекращается. Повторная процедура тестирования DNS-серверов инициируется Заказчиком с использованием Web-интерфейса Исполнителя.</P>
   </TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">3.2.2.</TD>
   <TD align="justify" width="95%">Информация, касающаяся серверов доменных имен, должна соответствовать текущему состоянию сети.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">3.2.3.</TD>
   <TD align="justify" width="95%">Исполнитель, в случае невыполнения условий, изложенных в пунктах 3.2.1 и 3.2.2 настоящего Регламента, вправе в течение всего срока действия регистрации прекратить делегирование домена. Делегирование может быть восстановлено только после устранения указанных нарушений.</TD>
  </TR>
 </TABLE>
 <H2>4. Обработка Заказа на регистрацию домена</H2>
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.1.</TD>
   <TD align="justify" width="95%">Порядок обработки Заказа</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.1.1.</TD>
   <TD align="justify" width="95%">Формирование Заказа на оказание новой услуги осуществляется Заказчиком с использованием Web-интерфейса Исполнителя.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.1.2.</TD>
   <TD align="justify" width="95%">Аннулирование Заказа на оказание новой услуги может быть произведено Заказчиком на Web-сервере Исполнителя в разделе "Услуги - Домены - Заказы на домены" до момента начала исполнения Заказа.</TD>
  </TR>
 </TABLE>
 <HR BREAK="" />
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.1.3.</TD>
   <TD align="justify" width="95%">Заказ считается готовым к исполнению и начинает исполняться с момента оплаты Заказчиком всех услуг в Заказе.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.1.4.</TD>
   <TD align="justify" width="95%">Заказы Заказчика на оказание новых услуг исполняются в порядке их поступления к Исполнителю.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.1.5.</TD>
   <TD align="justify" width="95%">Исполнитель проводит экспертизу Заказа на его соответствие требованиям, изложенным в настоящем Регламенте. В период проведения экспертизы до принятия решения по Заказу Исполнитель вправе запросить у Заказчика дополнительные сведения, необходимые для проведения экспертизы.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.1.6.</TD>
   <TD align="justify" width="95%">Исполнитель принимает решение о возможности регистрации заявленного домена, либо об отказе в регистрации по основаниям, предусмотренным настоящим Регламентом.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.1.7.</TD>
   <TD align="justify" width="95%">В случае возникновения сомнений в возможности регистрации какого-либо домена по основаниям, предусмотренным настоящим Регламентом, Исполнитель вправе приостановить регистрацию данного домена на срок не более 15 (пятнадцати) дней. По истечении этого срока Исполнитель обязан зарегистрировать домен, либо выдать мотивированный отказ в регистрации.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.1.8.</TD>
   <TD align="justify" width="95%">При наличии оснований для отказа в регистрации Исполнитель информирует Заказчика о невозможности регистрации заявленного им домена и об основаниях такого отказа.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.1.9.</TD>
   <TD align="justify" width="95%">Решение о регистрации, об отказе в регистрации, либо о приостановке исполнения Заказа, направляется Заказчику не позднее 2 (двух) рабочих дней с момента начала исполнения Заказа.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.2.</TD>
   <TD align="justify" width="95%">Особые условия</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.2.1.</TD>
   <TD align="justify" width="95%">Все сведения, предоставленные Заказчиком при регистрации в базе данных Исполнителя и заключении Договора, должны быть достоверными. В случае предоставления Заказчиком недостоверных сведений регистрация может быть аннулирована (домен освобожден).</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.2.2.</TD>
   <TD align="justify" width="95%">Исполнитель, в случае возникновения сомнений в достоверности предоставленных Заказчиком для регистрации домена данных, вправе в течение всего срока действия регистрации запросить дополнительные сведения и (или) потребовать подтверждения предоставленных. Запрос направляется по электронной почте на контактный адрес Заказчика, указанный в Договоре.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.2.3.</TD>
   <TD align="justify" width="95%">Исполнитель, в случае непредоставления Заказчиком дополнительных сведений и (или) неподтверждения ранее предоставленных данных в течение десяти календарных дней с момента первого запроса, вправе приостановить делегирование доменов Заказчика. Делегирование доменов может быть восстановлено в течение 3 (трех) рабочих дней с момента предоставления требуемой информации.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">4.2.4.</TD>
   <TD align="justify" width="95%"><SPAN>Регистрация домена аннулируется до истечения срока ее действия в следующих случаях:</SPAN>
    <TABLE width="100%">
     <TR>
      <TD valign="top">а)</TD>
      <TD align="justify" width="98%">по письменному заявлению Администратора домена;</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">б)</TD>
      <TD align="justify" width="98%">в соответствии с п. 4.2.3 настоящего Регламента;</TD>
     </TR>
    </TABLE>
    <TABLE width="100%">
     <TR>
      <TD valign="top">в)</TD>
      <TD align="justify" width="98%">
       <SPAN>по вступившему в законную силу решению суда:</SPAN>
       <TABLE width="100%">
        <TR>
         <TD valign="top">•</TD>
         <TD align="justify" width="98%">признающему администрирование домена его Администратором нарушением прав истца;</TD>
        </TR>
       </TABLE>
       <TABLE width="100%">
        <TR>
         <TD valign="top">•</TD>
         <TD align="justify" width="98%">и(или) запрещающему использование в доменном имени обозначения, правами на которое обладает истец.</TD>
        </TR>
       </TABLE>
      </TD>
     </TR>
    </TABLE>
    <P>При этом преимущественным правом на регистрацию аннулированного домена обладает лицо, чьи права суд признал нарушенными. Для реализации преимущественного права указанное лицо обязано направить письменный запрос в адрес Исполнителя в срок не позднее 60 (шестидесяти) календарных дней со дня вступления решения суда в законную силу.</P>
   </TD>
  </TR>
 </TABLE>
 <H2>5. Продление регистрации домена</H2>
 <TABLE width="100%">
  <TR>
   <TD valign="top">5.1.</TD>
   <TD align="justify" width="95%">Продление регистрации домена обеспечивает хранение в Реестре информации о домене на срок, равный количеству лет, заказанному заказчиком.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">5.2.</TD>
   <TD align="justify" width="95%">Делегирование домена приостанавливается Исполнителем, если регистрация домена не продлена Заказчиком до окончания срока ее действия. В случае продления регистрации до момента ее аннулирования, делегирование домена восстанавливается Исполнителем в течение 3 (трех) рабочих дней.</TD>
  </TR>
 </TABLE>
 <HR BREAK="" />
 <TABLE width="100%">
  <TR>
   <TD valign="top">5.3.</TD>
   <TD align="justify" width="95%">Регистрация домена аннулируется Исполнителем, если ее действие не будет продлено Заказчиком в течение 30 (тридцати) календарных дней с даты окончания срока регистрации домена.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">5.4.</TD>
   <TD align="justify" width="95%">Порядок продления регистрации
   </TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">5.4.1.</TD>
   <TD align="justify" width="95%">Исполнитель направляет на контактные адреса электронной почты, указанные в Договоре Заказчика, уведомление о необходимости продления регистрации домена за два месяца до окончания срока регистрации домена.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">5.4.2.</TD>
   <TD align="justify" width="95%">Продление регистрации домена производится Исполнителем при наличии оплаченного заказа на продление домена.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">5.4.3.</TD>
   <TD align="justify" width="95%">Подать заявку на продление регистрации домена Заказчик может на Web-сервере Исполнителя в разделе "Услуги - Домены - Заказы на домены" (кнопка "оплатить/продлить домен").</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">5.4.4.</TD>
   <TD align="justify" width="95%">Отсутствие отказа от продления регистрации домена подтверждает отказ Заказчика от оказание ему услуги по продлению.</TD>
  </TR>
 </TABLE>
 <H2>6. Изменение данных Администратора домена.</H2>
 <TABLE width="100%">
  <TR>
   <TD valign="top">6.1.</TD>
   <TD align="justify" width="95%">Параметры услуги по регистрации домена - данные технического характера, определяющие порядок функционирования домена. Данные Администратора домена - идентификационные и контактные данные Администратора домена, которые вносятся в Реестр при оказании услуги по регистрации домена.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">6.2.</TD>
   <TD align="justify" width="95%">Изменить данные Администратора домена или изменить параметры услуги по регистрации домена можно только после того, как процедура исполнения Заказа на оказание услуги по регистрации домена завершена.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">6.3.</TD>
   <TD align="justify" width="95%">Изменение данных Администратора домена в Реестре</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">6.3.1.</TD>
   <TD align="justify" width="95%">
    <SPAN>Изменение контактных данных Заказчика в Договоре</SPAN>
    <P>К контактным данным Заказчика относятся: номер телефона, номер факса, адреса электронной почты, почтовый адрес. Внесение изменений производится на Web-сервере Исполнителя в разделе "Мой офис - Мои профили".</P>
    <P>Изменение контактных данных Заказчика в Договоре будет произведено в течение 3 (трех) рабочих дней.</P>
   </TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">6.3.2.</TD>
   <TD align="justify" width="95%">
    <SPAN>Изменение идентификационных данных Заказчика в Договоре</SPAN>
    <P>К идентификационным данным Заказчика относятся: название организации, юридический адрес, ИНН, ФИО, паспортные данные, дата рождения. Изменение идентификационных данных производится по официальному письму Заказчика к Регистратору. Формы писем приведены на Web-сервере Регистратора.</P>
   </TD>
  </TR>
 </TABLE>
 <H2>7. Передача домена</H2>
 <TABLE width="100%">
  <TR>
   <TD valign="top">7.1.</TD>
   <TD align="justify" width="95%">Передача домена иному юридическому или физическому лицу, заключившему с соответствующим Регистратором Договор в письменной форме на оказание услуг, может быть осуществлена на основании официального письма Администратора домена к соответствующему Регистратору. Формы таких писем приведены на Web-сервере Регистраторов.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">7.2.</TD>
   <TD align="justify" width="95%">При получения Регистратором официального письма от Администратора домена о передаче домена иному лицу, заключившему с Регистратором Договор в письменной форме на оказание услуг, а также официального письма от лица, которому передается домен, подтверждающего намерение стать Администратором домена, Регистратор производит действия по передаче домена и уведомляет об этом прежнего и нового Администраторов домена.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">7.3.</TD>
   <TD align="justify" width="95%">Условия и сроки действий описанных в п. 7.2 могут быть различными для разных Регистраторов.</TD>
  </TR>
 </TABLE>
 <HR BREAK="" />
 <H2>8. Переход к иному Регистратору</H2>
 <TABLE width="100%">
  <TR>
   <TD valign="top">8.1.</TD>
   <TD align="justify" width="95%">Администратор домена вправе передать вновь выбранному Регистратору обязанность по внесению в Реестр информации о доменном имени и его Администраторе.</TD>
  </TR>
 </TABLE>
 <TABLE width="100%">
  <TR>
   <TD valign="top">8.2.</TD>
   <TD align="justify" width="95%">Условия смены Регистратора могут быть различными у разных Регистраторов, поэтому подробную информацию необходимо уточнять у соответствующего Регистратора.</TD>
  </TR>
 </TABLE>
</NOBODY>';
-- SEPARATOR
INSERT INTO `Clauses`
  (`AuthorID`,`EditorID`,`IsXML`,`IsDOM`,`Partition`,`Title`,`Text`)
VALUES
(100,100,'yes','yes','Contracts/Enclosures/Types/DomainRules/Content','Регламент на услуги регистрации и продления доменов',@Text);