
/* added by lissyara 2012-02-24 in 11:21 MSK */
INSERT INTO `Clauses` (`ID`, `PublicDate`, `ChangedDate`, `AuthorID`, `EditorID`, `Partition`, `Title`, `IsProtected`, `IsXML`, `IsDOM`, `Text`, `IsPublish`) VALUES (NULL, UNIX_TIMESTAMP(), UNIX_TIMESTAMP(), '100', '1', 'Contracts/Enclosures/Types/ISPswRules/Content', 'Регламент предоставления услуг ПО ISPsystem', 'no', 'yes', 'yes', '<NOBODY>
<NOBODY>
<H2>
Приведенный ниже текст является публичной офертой.
</H2>
<P align="justify">
Публичной офертой является предложение, содержащее все существенные условия договора, из которого усматривается воля лица, делающего предложение, заключить договор на указанных в предложении условиях с любым, кто отзовется на это предложение.
</P>
<P align="justify">
Для того чтобы заключить договор, лицо, откликнувшееся на такое предложение, должно осуществить акцепт оферты, т.е. выразить свое согласие на заключение договора на условиях, изложенных в оферте.
</P>
<P align="justify">
Такое согласие, в частности, может быть выражено путем совершения указанных в оферте действий, определенных самой офертой как ее акцепт. Применительно к программе для ЭВМ таким действием может быть начало ее использования.
</P>
<P align="justify">
Приведенный ниже текст является публичной офертой компании «%Executor.CompanyName%». Акцепт этой оферты может быть осуществлен путем совершения указанных в оферте действий. Совершение этих действий, т.е. акцепт оферты, влечет за собой заключение между Вами и компанией «%Executor.CompanyName%» лицензионного договора о предоставлении Вам права использования выбранной Вами программы для ЭВМ.
</P>
<P align="justify">
В данном случае сделка будет считаться совершенной в письменной форме, т.е. заключенный таким способом договор будет обладать той же «юридической силой», что и договор, заключенный путем составления на бумажном носителе документа, подписанного сторонами (обычный «бумажный» договор).
</P>
<H2>
Предложение о заключении лицензионного договора (публичная оферта)
</H2>
<UL>
<LI>
<P align="justify">
%Executor.CompanyForm% «%Executor.CompanyName%» (далее – компания «%Executor.CompanyName%») адресует настоящую публичную оферту любому лицу, желающему использовать программу для ЭВМ «ISPmanager 4» или иную программу для ЭВМ, разработчиком и обладателем исключительного права на которую является компания «ISPsystem» (далее – Программный продукт), и обладающему аппаратными и (или) программными средствами, необходимыми для использования данной программы.
</P>
</LI>
<LI>
<P align="justify">
Акцептом настоящей оферты является:
</P>
<P align="justify">
установка Программного продукта, т.е. запись копии Программного продукта в память ЭВМ в целях последующего использования его функциональных возможностей – в случае, если данный Программный продукт не был установлен ранее,
</P>
<P align="justify">
либо
</P>
<P align="justify">
запуск и последующее использование функциональных возможностей Программного продукта – в случае, если Программный продукт уже был установлен и использовался на основании ранее действующего лицензионного договора с компанией «ISPsystem».
</P>
</LI>
<LI>Акцепт настоящей оферты, осуществленный в порядке, указанном выше в пункте II, означает согласие акцептирующего лица со всеми приведенными ниже в разделе «Лицензионный договор» условиями, а также условиями технического сопровождения Программных продуктов, изложенных в Регламенте технического сопровождения, размещенном на Интернет-сайте компании «ISPsystem», и влечет за собой заключение лицензионного договора между данным лицом и компанией «%Executor.CompanyName%» на определенных настоящей офертой условиях.
</LI>
<LI>Во всех случаях, когда в тексте настоящей оферты дается отсылка на иные тексты, размещенные на Интернет-сайте компании «%Executor.CompanyName%», данные тексты следует рассматривать как неотъемлемую часть настоящей оферты, если иное прямо не указано в самой оферте.
</LI>
</UL>
<H2>
ЛИЦЕНЗИОННЫЙ ДОГОВОР о предоставлении права использования программы для ЭВМ
</H2>
<H2>
1. Основные понятия и определения
</H2>
<P align="justify">
1.1. Правообладатель (компания «ISPsystem») – ЗАО «ИСПсистем».
</P>
<P align="justify">
1.2. Лицензиар – компания «%Executor.CompanyName%».
</P>
<P align="justify">
1.3. Пользователь (лицензиат) – любое лицо, акцептировавшее настоящую оферту в порядке, указанном выше в пункте II, и тем самым заключившее Лицензионный договор с компанией «%Executor.CompanyName%».
</P>
<P align="justify">
1.4. Лицензионный договор (Лицензия) – настоящий сублицензионный договор о предоставлении права использования программы для ЭВМ, приобретенного компанией «%Executor.CompanyName%» на основании лицензионного договора с Правообладателем и предоставляемого Пользователю с письменного согласия Правообладателя.
</P>
<P align="justify">
1.5. Программный продукт – программа для ЭВМ «ISPmanager 4» или иная программа для ЭВМ, разработчиком и обладателем исключительного права на которую является компания «ISPsystem».
</P>
<P align="justify">
Перечень Программных продуктов, права использования которых могут быть предоставлены на условиях настоящего Лицензионного договора, приведен на Интернет-сайте компании «%Executor.CompanyName%».
</P>
<P align="justify">
Описание программных продуктов, в том числе информация о поддерживаемых ими операционных системах, приведены на Интернет-сайте компании «ISPsystem».
</P>
<P align="justify">
1.6. Сопутствующие материалы – представленные в письменной форме, а также в форме изображения или иной форме материалы, представляющие собой описание Программного продукта, инструкции по его установке, настройке и использованию и т.п.
</P>
<P align="justify">
1.7. Ключи активации – элемент системы технических средств защиты авторских прав, используемой компанией «ISPsystem» для защиты Программных продуктов от неправомерного использования.
</P>
<P align="justify">
1.8. Интернет-сайт компании «%Executor.CompanyName%» – совокупность веб-страниц, размещенных в информационно-телекоммуникационной сети Интернет и объединенных единым адресным пространством домена %Executor.SiteURL%
</P>
<P align="justify">
1.9. Интернет-сайт компании «ISPsystem» – совокупность веб-страниц, размещенных в информационно-телекоммуникационной сети Интернет и объединенных единым адресным пространством домена ispsystem.com
</P>
<H2>
2. Способы использования Программного продукта
</H2>
<P align="justify">
2.1. Пользователю предоставляется право использования Программного продукта следующими способами:
</P>
<P align="justify">
2.1.1. путем воспроизведения Программного продукта посредством записи одной копии Программного продукта в память ЭВМ; Пользователь также вправе изготовить в любой форме резервную копию Программного продукта для замены оригинальной копии, в случае если она будет утеряна, уничтожена или станет непригодной для использования;
</P>
<P align="justify">
2.1.2. путем доведения Программного продукта до всеобщего сведения таким образом, что любое или определенное Пользователем лицо могло получить к нему доступ по информационно-телекоммуникационной сети, в том числе сети Интернет; при этом доведение до всеобщего сведения может быть осуществлено исключительно такими способами, при которых третьим лицам предоставляется доступ только к порождаемым Программным продуктом аудиовизуальным отображениям и (или) предоставляется возможность интерактивного взаимодействия с функциональной частью Программного продукта;
</P>
<P align="justify">
2.1.3. путем распространения Программного продукта посредством продажи или иного отчуждения его экземпляров исключительно в тех случаях, когда распространение осуществляется путем продажи или иного отчуждения Пользователем сервера (ЭВМ) с установленным на нем Программным продуктом, при условии, что записанная в память сервера (ЭВМ) копия Программного продукта (соответствующий данной копии Ключ активации) была приобретена Пользователем правомерно;
</P>
<P align="justify">
2.1.4. путем публичного показа Программного продукта, т.е. публичного показа порождаемых им аудиовизуальных отображений, публичной демонстрации функциональных возможностей Программного продукта.
</P>
<P align="justify">
2.2. Право использования Программного продукта предоставляется Пользователю со следующими ограничениями:
</P>
<P align="justify">
2.2.1. Пользователю запрещается реализовывать предоставленное ему право на доведение Программного продукта до всеобщего сведения каким-либо способом, при котором третьим лицам предоставляется фактическая возможность воспроизведения Программного продукта полностью или частично, за исключением записи части Программного продукта в память ЭВМ, когда такая запись является временной и составляет неотъемлемую и существенную часть технологического процесса, имеющего единственной целью просмотр порождаемых Программным продуктом аудиовизуальных отображений и (или) интерактивное взаимодействие с функциональной частью Программного продукта; также запрещается доводить Программный продукт до всеобщего сведения таким способом, при котором использование функциональных возможностей Программного продукта третьими лицами становится возможным без подключения к информационно-телекоммуникационной сети;
</P>
<P align="justify">
2.2.2. Пользователю запрещается модифицировать Программный продукт, т.е. вносить в него любые изменения, за исключением:
</P>
<UL>
<LI>изменения настроек Программного продукта или иных подобных изменений, осуществляемых путем использования описанных в документации (Сопроводительных материалах) возможностей пользовательского интерфейса Программного продукта;
</LI>
<LI>адаптации, т.е. изменений, независимо от способа их осуществления, которые производятся исключительно в целях функционирования Программного продукта на конкретных технических средствах Пользователя или под управлением конкретных программ Пользователя; при этом в случае, если в результате адаптации Программного продукта будет изменен его объектный код, Пользователю может быть отказано в техническом сопровождении Программного продукта без возмещения возможных убытков;
</LI>
<LI>установки обновлений Программного продукта, выпущенных компанией «ISPsystem»;
</LI>
</UL>
<P align="justify">
2.2.3. за исключением предусмотренных законом случаев Пользователю запрещается декомпилировать Программный продукт, а также осуществлять любые иные действия, направленные на восстановление исходного кода (исходного текста) Программного продукта;
</P>
<P align="justify">
2.2.4. при любом использовании Программного продукта Пользователю запрещается осуществлять какие-либо действия, результатом которых является изменение или удаление порождаемых Программным продуктом визуальных отображений товарного знака, знака обслуживания, коммерческого обозначения или знака охраны авторского права; также запрещается осуществлять любые действия, в результате которых существенно затрудняется распознавание указанных в настоящем пункте визуальных отображений, в частности, их затемнение или существенное уменьшение их оригинальных размеров.
</P>
<H2>
3. Вознаграждение и срок использования Программного продукта
</H2>
<P align="justify">
3.1. Размер вознаграждения за предоставление права использования Программного продукта зависит от выбранного Пользователем Программного продукта, срока его использования (срока, на который Пользователю предоставляется право использования Программного продукта) и условий его технического сопровождения и определяется исходя из соотношений, указанных на Интернет-сайте компании «%Executor.CompanyName%».
</P>
<P align="justify">
3.2. ЗАКАЗ ЛИЦЕНЗИИ
</P>
<P align="justify">
3.2.1. Для целей настоящего Лицензионного договора понятие «заказ лицензии» означает совокупность указанных в настоящем пункте 3.2 действий Пользователя, результатом совершения которых является сообщение компании «%Executor.CompanyName%» информации о выбранном Пользователем Программном продукте, сроке его использования и условиях его технического сопровождения, IP адресе сервера (ЭВМ) на котором будет установлен Программный продукт, а также сведений, позволяющих идентифицировать Пользователя как клиента компании «%Executor.CompanyName%» и сторону по настоящему Лицензионному договору.
</P>
<P align="justify">
3.2.2. Пользователь по своему усмотрению осуществляет выбор необходимого ему Программного продукта, срока его использования и условий его технического сопровождения из числа предложенных стандартных вариантов, каждому из которых соответствует определенный размер вознаграждения. Такой выбор осуществляется Пользователем посредством интерактивного взаимодействия с функциональной частью Интернет-сайта компании «%Executor.CompanyName%», осуществляемого через графический пользовательский интерфейс.
</P>
<P align="justify">
3.2.3. После выбора Программного продукта, срока его использования и условий его технического сопровождения Пользователь должен указать IP-адрес сервера (ЭВМ), на котором будет установлен Программный продукт.
</P>
<P align="justify">
3.2.4. В случае если заказ лицензии осуществляется впервые, Пользователь также должен предоставить о себе информацию, необходимую для идентификации Пользователя как клиента компании «%Executor.CompanyName%» и стороны по настоящему Лицензионному договору, а также указать свои контактные данные.
</P>
<P align="justify">
3.2.5. Предоставление указанной выше в пунктах 3.2.3 и 3.2.4 информации осуществляется посредством заполнения соответствующих web-форм, размещенных на Интернет-сайте компании «%Executor.CompanyName%».
</P>
<P align="justify">
3.3. Совершение указанных выше в пункте 3.2 действий не влечет за собой заключение настоящего Лицензионного договора.
</P>
<P align="justify">
3.4. Заказ лицензии может быть осуществлен не самим Пользователем, а другим лицом, действующим от имени Пользователя, которому Пользователь предоставил информацию, необходимую для заказа лицензии. В частности, фактические действия по заказу лицензии могут быть совершены техническим специалистом компании-аутсорсера или иным лицом, которое на основании договора с Пользователем осуществляет техническое обслуживание сервера (ЭВМ), на котором устанавливается Программный продукт. В этом случае Лицензионный договор также считается заключенным между компанией «%Executor.CompanyName%» и Пользователем, как если бы заказ лицензии был осуществлен Пользователем самостоятельно.
</P>
<P align="justify">
3.5. Пользователю предоставляется возможность заказа следующих видов лицензий: «стандартная» лицензия, «партнерская» лицензия, «триал» лицензия.
</P>
<P align="justify">
3.6. При заказе «стандартной» или «партнерской» лицензии право использования Программного продукта предоставляется только после уплаты вознаграждения за предоставление данного права в размере, соответствующем выбранному Пользователем Программному продукту, сроку его использования и условиям его технического сопровождения и определяемом исходя из соотношений, указанных на Интернет-сайте компании «%Executor.CompanyName%».
</P>
<P align="justify">
3.7. При заказе «триал» лицензии право использования Программного продукта предоставляется безвозмездно на определенный срок, по истечении которого использование Программного продукта может быть продолжено только на платной основе. Такое право предоставляется Пользователю для ознакомления с функциональными возможностями Программного продукта, оценки его качества и пригодности для нужд Пользователя.
</P>
<P align="justify">
3.8. При заказе «стандартной» лицензии техническое сопровождение программного продукта полностью осуществляется компанией «ISPsystem», включая техническую поддержку (консультирование Пользователя по вопросам установки, настройки и использования Программного продукта) и установку Программного продукта на сервер, осуществляемые специалистами компании «ISPsystem».
</P>
<P align="justify">
3.9. При заказе «партнерской» или «триал» лицензии техническая поддержка и установка Программного продукта на сервер специалистами компании «ISPsystem» не осуществляются.
</P>
<P align="justify">
3.10. Техническое сопровождение Программных продуктов компанией «ISPsystem», в том числе техническая поддержка и установка программных Продуктов на серверы, осуществляемые специалистами компании «ISPsystem», осуществляется в соответствии с Регламентом технического сопровождения, текст которого размещен на Интернет-сайте компании «ISPsystem».
</P>
<P align="justify">
Особые условия заказа «триал» лицензий
</P>
<P align="justify">
3.11. Право осуществлять заказ «триал» лицензий предоставляется Пользователю со следующими ограничениями:
</P>
<P align="justify">
3.11.1. в случае заказа «триал» лицензии на Программный продукт, следующая «триал» лицензия на данный Программный продукт может быть заказана не ранее, чем через 6 (шесть) месяцев;
</P>
<P align="justify">
3.11.2. в течение 6 (шести) месяцев с момента заказа «триал» лицензии на соответствующий Программный продукт IP адрес сервера (ЭВМ), указанный при заказе данной «триал» лицензии, может быть использован только для целей заказа «коммерческой» лицензии на данный Программный продукт (Ключей активации, предоставляемых на платной основе и позволяющих продолжить использование Программного продукта по истечении разрешенного срока безвозмездного использования); при этом «коммерческая» лицензия может быть заказана только у того лица, у которого была заказана «триал» лицензия: в случае заказа «триал» лицензии у компании «%Executor.CompanyName%» заказ «коммерческой» лицензии у другого партнера компании «ISPsystem» или напрямую у компании «ISPsystem» будет недоступен.
</P>
<P align="justify">
3.12. В виду того, что на основании договора, заключенного между компаниями «%Executor.CompanyName%» и «ISPsystem», компания «ISPsystem» вправе отказать в предоставлении «триал» лицензии для определенного Пользователя и (или) IP адреса, компания «%Executor.CompanyName%» не гарантирует, что «триал» лицензия (право безвозмездного использования Программного продукта в течение определенного срока, а также Ключи активации, необходимые для реализации данного права) будет предоставлена Пользователю по его запросу.
</P>
<H2>
4. Территория использования Программного продукта
</H2>
<P align="justify">
4.1. Право использования Программного продукта предоставляется Пользователю без ограничения по территории использования Программного продукта (Программный продукт может быть использован на территории всего мира).
</P>
<H2>
5. Обновление Программного продукта
</H2>
<P align="justify">
5.1. Компания «ISPsystem» периодически выпускает обновления Программного продукта.
</P>
<P align="justify">
5.2. Пользователь вправе использовать обновления Программного продукта на условиях настоящей Лицензии без выплаты дополнительного вознаграждения.
</P>
<P align="justify">
5.3. Право использования обновлений Программных продуктов считается предоставленным Пользователю с момента обеспечения компанией «ISPsystem» технической возможности их загрузки.
</P>
<P align="justify">
5.4. После установки обновлений Пользователь вправе использовать Программный продукт на тех же условиях, что и до установки обновлений.
</P>
<P align="justify">
5.5. Стороны соглашаются и подтверждают свое понимание того, что установка обновлений для Программного продукта не является и для целей настоящего Лицензионного договора не должна считаться юридическим фактом, влекущим за собой заключение нового лицензионного договора о предоставлении права использования Программного продукта или продление срока действия настоящей Лицензии.
</P>
<H2>
6. Сопутствующие материалы
</H2>
<P align="justify">
6.1. Доступ к Сопутствующим материалам в общем случае осуществляется через пользовательский интерфейс Программного продукта, однако Сопутствующие материалы являются самостоятельными объектами интеллектуальной собственности, исключительные права на которые принадлежат компании «ISPsystem».
</P>
<P align="justify">
6.2. Пользователь вправе использовать Сопутствующие материалы для собственных нужд в течение всего срока действия настоящего Лицензионного договора, а также осуществлять их воспроизведение (копирование) для тех же целей, но не вправе осуществлять распространение Сопутствующих материалов, доведение их до всеобщего сведения, в частности путем их размещения в информационно-телекоммуникационной сети Интернет, или использовать Сопутствующие материалы иным способом без предварительного согласия компании «ISPsystem».
</P>
<H2>
7. Технические средства защиты авторских прав
</H2>
<P align="justify">
7.1. Для защиты Программных продуктов от неправомерного использования компанией «ISPsystem» реализована система технических средств защиты авторских прав (далее – «система защиты»), необходимым элементом которой являются Ключи активации, каждый из которых является уникальным. Ключ активации необходим для использования каждого экземпляра (копии) любого из Программных продуктов.
</P>
<P align="justify">
7.2. Ключ активации является уникальным для каждого IP адреса. В целях предотвращения неправомерного использования Программных продуктов срок действия каждого Ключа активации ограничен, в связи с чем для использования Программного продукта в течение всего срока действия настоящей Лицензии необходима периодическая замена Ключа активации на новый.
</P>
<P align="justify">
Замена Ключа активации осуществляется автоматически: Программный продукт, используя встроенную функцию, направляет запрос на сервер компании «ISPsystem» и загружает новый Ключ активации. Направление запроса на сервер и загрузка нового Ключа активации осуществляется с использованием информационно-телекоммуникационной сети Интернет.
</P>
<P align="justify">
7.3. При автоматическом обновлении Ключа активации не происходит сбора какой-либо информации, за исключением информации об установленной на сервере (ЭВМ) версии Программного продукта и Ключе активации, присутствующем на данном сервере (ЭВМ) на момент обновления.
</P>
<P align="justify">
7.4. В связи с указанными выше в пункте 7.2 особенностями системы защиты, необходимым условием использования любого из Программных продуктов является наличие у сервера (ЭВМ), на котором устанавливается Программный продукт, постоянно функционирующего соединения с информационно-телекоммуникационной сетью Интернет и публичного IP адреса. IP адрес данного сервера (ЭВМ) должен оставаться неизменным: в случае смены IP адреса без согласования с компанией «%Executor.CompanyName%» запуск Программного продукта будет невозможен.
</P>
<P align="justify">
7.5. Пользователь обязан обеспечить соблюдение указанных выше в пункте 7.4 условий в течение всего срока действия Лицензии. В случае если соблюдение данного требования является невозможным или затруднительным, следует воздержаться от заключения настоящего Лицензионного договора.
</P>
<P align="justify">
ИЗМЕНЕНИЕ IP АДРЕСА СЕРВЕРА
</P>
<P align="justify">
7.6. При наличии объективных обстоятельств, обуславливающих необходимость замены IP адреса, указанного при заказе лицензии, Пользователю может быть предоставлена возможность использования Программного продукта на сервере (ЭВМ) с другим IP адресом.
</P>
<P align="justify">
7.7. Регистрация нового IP адреса осуществляется компанией «%Executor.CompanyName%» по заявке Пользователя, но не чаще 1 (одного) раза в календарный месяц. Порядок направления заявок на смену IP адреса, а также порядок их обработки указаны на Интернет-сайте компании «%Executor.CompanyName%».
</P>
<P align="justify">
7.8. В виду того, что на основании договора, заключенного между компаниями «%Executor.CompanyName%» и «ISPsystem», компания «ISPsystem» вправе отказать в регистрации нового IP адреса и (или) заблокировать возможность смены определенного IP адреса в случае многократных замен, а также при наличии обоснованных подозрений, что замена IP адреса осуществляется в целях обхода системы защиты, компания «%Executor.CompanyName%» не гарантирует, что регистрация нового IP адреса сервера (ЭВМ) будет произведена по запросу Пользователя, и не несет ответственности за возможные убытки, возникшие у Пользователя в связи с невозможностью использования Программного продукта с IP адресом сервера (ЭВМ) отличным от того, что был указан при заказе лицензии.
</P>
<P align="justify">
БЛОКИРОВКА IP АДРЕСА СЕРВЕРА
</P>
<P align="justify">
7.9. В случае если была заказана «вечная лицензия» (Ключи активации, позволяющие использовать Программный продукт в течение неограниченного срока) и Программный продукт при этом не использовался (Ключ активации не обновлялся) в течение 3 (трех) и более месяцев, возможность обновления Ключа активации для Программного продукта, установленного на сервере (ЭВМ) с данным IP адресом, автоматически блокируется с предварительным уведомлением Пользователя о предстоящей блокировке.
</P>
<P align="justify">
7.10. В случае если возможность обновления Ключа активации для Программного продукта, установленного на сервере (ЭВМ) с определенным IP адресом, была заблокирована в порядке, описанном выше в пункте 7.9,
</P>
<P align="justify">
7.10.1. восстановление доступа к загрузке Ключей активации осуществляется компанией «%Executor.CompanyName%» по заявке Пользователя, за исключением случая, когда в период, прошедший с момента блокировки IP адреса (блокировки возможности обновления Ключа активации для Программного продукта, установленного на сервере (ЭВМ) с данным IP адресом) данный IP адрес был зарегистрирован за другим пользователем – в этом случае восстановление доступа к загрузке Ключей активации осуществляется только после регистрации нового IP адреса;
</P>
<P align="justify">
7.10.2. регистрация нового IP адреса (в указанном выше случае, а также в случае, если Пользователь желает зарегистрировать новый IP адрес по своей инициативе) осуществляется по заявке Пользователя в общем порядке, предусмотренном для регистрации новых IP адресов с учетом положения, закрепленного пунктом 7.8 настоящего Лицензионного договора.
</P>
<H2>
8. Ответственность Пользователя за нарушение условий Лицензии
</H2>
<P align="justify">
8.1. В случае нарушения Пользователем условий настоящей Лицензии, в частности в случае использования им Программного продукта за пределами предоставленного ему права или несоблюдения им установленных настоящей Лицензией запретов, настоящий Лицензионный договор может быть расторгнут в одностороннем порядке, в результате чего все права, полученные Пользователем по настоящей Лицензии, будут прекращены.
</P>
<P align="justify">
8.2. При расторжении настоящего Лицензионного договора по указанному выше в пункте 8.1 основанию, договор прекращается по истечении 30 (тридцати) дней с момента получения Пользователем требования компании «%Executor.CompanyName%» либо компании «ISPsystem» об устранении допущенных Пользователем нарушений, если в течение данного срока указанные нарушения не будут устранены.
</P>
<P align="justify">
8.3. В случае если настоящий Лицензионный договор был прекращен в одностороннем порядке по указанному выше в пункте 8.1 основанию, Пользователю может быть отказано в заключении с ним нового лицензионного договора.
</P>
<H2>
9. Порядок разрешения споров
</H2>
<P align="justify">
9.1. Споры и разногласия, возникшие между сторонами по настоящему Лицензионному договору, разрешаются путем переговоров между Сторонами. В случае невозможности разрешения разногласий путем переговоров, спор между Сторонами подлежит рассмотрению в судебном порядке в суде гор. Саратова, на основе действующего законодательства Российской Федерации.
</P>
<H2>
10. Действие Лицензии
</H2>
<P align="justify">
10.1. Право использования выбранного Пользователем Программного продукта на условиях настоящей Лицензии в течение срока, выбранного Пользователем из числа предложенных стандартных вариантов, предоставляется Пользователю после уплаты определенного в соответствии с настоящим Лицензионным договором вознаграждения, а в случае заказа «триал» лицензии – после заключения настоящего Лицензионного договора, и считается предоставленным с момента открытия Пользователю доступа к загрузке Ключей активации, необходимых для использования выбранного Пользователем Программного продукта в течение выбранного им стандартного срока.
</P>
<P align="justify">
10.2. Срок действия настоящего Лицензионного договора равен выбранному Пользователем при заказе лицензии сроку использования Программного продукта. По истечении данного срока настоящий Лицензионный договор (Лицензия) прекращается.
</P>
<P align="justify">
Установленное настоящим пунктом 10.2 правило применяется, в том числе, при заказе «триал» лицензии: по истечении установленного срока безвозмездного использования Программного продукта настоящий Лицензионный договор (Лицензия) прекращается, и последующее использование Программного продукта может осуществляться Пользователем только на основании возмездного лицензионного договора после уплаты соответствующего вознаграждения.
</P>
</NOBODY>
', 'yes');


