INSERT INTO `Clauses` (`ID`, `PublicDate`, `ChangedDate`, `AuthorID`, `EditorID`, `Partition`, `Title`, `IsProtected`, `IsXML`, `IsDOM`, `Text`, `IsPublish`) VALUES (NULL, UNIX_TIMESTAMP(), UNIX_TIMESTAMP(), '100', '1', 'Contracts/Enclosures/Types/VPSRules/Content', 'Регламент предоставления услуг VPS', 'no', 'yes', 'yes', '<NOBODY>
 <P align="justify">
 Настоящий Регламент определяет порядок оказания услуг Исполнителем, своим Заказчикам по размещению виртуального web-сервера на оборудовании исполнителя, а так же, порядок использования таких услуг со стороны Заказчика или пользователя, порядок взаимодействия между Исполнителем и Заказчиком или пользователем, а также иные вопросы, не оговоренные явно в Договоре.
</P>
 <H2>
 1. Предоставление услуг
</H2>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    1.1.
   </TD>
    <TD align="justify" width="95%">
    Учитывая, что Интернет распространен практически во всех государствах мира, имеющих различное законодательство, Исполнитель настоящим Договором предупреждает Заказчика, что случайные или намеренные действия в Интернет могут привести к нарушению национального законодательства других стран. Исполнитель не несет ответственности за такие возможные нарушения со стороны Заказчика.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    1.2.
   </TD>
    <TD align="justify" width="95%">
    Заказчик принимает на себя полную ответственность и риски, связанные с использованием сети Интернет посредством Услуг, в том числе ответственность за оценку точности, полноты и полезности любых мнений, идей, иной информации, а также свойств товаров и услуг, распространяемых в Интернет и предоставляемых Заказчику посредством Услуг.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    1.3.
   </TD>
    <TD align="justify" width="95%">
    В случае если Заказчик предоставляет третьим лицам доступ к имеющимся у него ресурсам и сервисам, ответственность за деятельность таких третьих лиц несет исключительно Заказчик.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <H2>
 2. Права и ответственность сторон
</H2>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    2.1.
   </TD>
    <TD align="justify" width="95%">
     <SPAN>Исполнитель, сохраняя за собой все права по Договору вправе незамедлительно приостановить оказание услуг в случаях:</SPAN>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        если по обоснованному мнению Исполнителя использование Заказчиком услуг может нанести ущерб Исполнителю и/или вызвать сбой технических и программных средств Исполнителя и третьих лиц;
       </TD>
       </TR>
      </TBODY>
     </TABLE>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        наличия со стороны Заказчика действий, направленных на то, чтобы посылать, публиковать, передавать, воспроизводить, распространять, любым способом, а так же в любом виде использовать полученные посредством услуг программное обеспечение и/или другие материалы, полностью или частично защищенные авторскими и другими правами, без разрешения правообладателя;
       </TD>
       </TR>
      </TBODY>
     </TABLE>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        публикации и/или передачи со стороны Заказчика, с использованием оборудования Исполнителя, любой информации, относящейся к пропаганде жестокости, насилия, совершению террористических актов, разжиганию расовой, национальной, религиозной вражды, пропаганде войны.
       </TD>
       </TR>
      </TBODY>
     </TABLE>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        наличия со стороны Заказчика действий, направленных на то, чтобы посылать, публиковать, передавать, распространять любым способом любую информацию или программное обеспечение, которое содержит в себе какие-либо вредоносные компоненты;
       </TD>
       </TR>
      </TBODY>
     </TABLE>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        наличия со стороны Заказчика действий, направленных на то, чтобы посылать содержащую рекламу информацию (спам) без согласия со стороны адресата при наличие письменных заявлений от получателей такой рассылки на имя Исполнителя с обоснованными претензиями на адрес Заказчика. При этом понятие &quot;спам&quot; определяется общеизвестными &quot;правилами пользования сетью&quot; размещенными в сети Интернет и являющимися обычаем делового оборота;
       </TD>
       </TR>
      </TBODY>
     </TABLE>
    </TD>
   </TR>
  </TBODY>
 </TABLE>
 <HR />
 <TABLE>
  <TBODY>
   <TR>
    <TD width="5%"></TD>
    <TD align="justify" width="95%">
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        наличия со стороны Заказчика действий, направленных на то, чтобы посылать, публиковать, распространять либо использовать идентификационные персональные данные (имена, адреса, телефоны и т.п.) третьих лиц, кроме случаев, когда эти лица прямо уполномочили Заказчика на такое использование;
       </TD>
       </TR>
      </TBODY>
     </TABLE>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        распространения и/или публикации любой информации, которая противоречит требованиям законодательства Российской Федерации, положениям лицензий Министерства связи РФ (Министерства информационных технологий и связи в РФ), нормам международного права, и ущемляет права третьих лиц, а так же перенаправление пользователей на ресурсы сети Интернет содержащих такую информацию;
       </TD>
       </TR>
      </TBODY>
     </TABLE>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        опубликования или распространения Заказчиком любой информации или программного обеспечения, которое содержит в себе коды, по своему действию соответствующие действию компьютерных вирусов или других компонентов, приравненных к ним;
       </TD>
       </TR>
      </TBODY>
     </TABLE>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        рекламирования товаров, услуг, иных материалов, распространение которых ограничено либо запрещено действующим законодательством Российской Федерации;
       </TD>
       </TR>
      </TBODY>
     </TABLE>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        фальсифицирования своего IР-адреса, а также адресов, используемых в других сетевых протоколах, при передаче данных в сеть Интернет;
       </TD>
       </TR>
      </TBODY>
     </TABLE>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        использования несуществующих обратных адресов при отправке электронных писем и других сообщений;
       </TD>
       </TR>
      </TBODY>
     </TABLE>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        осуществления действий, направленных на нарушение нормального функционирования элементов сети Интернет (компьютеров, другого оборудования или программного обеспечения), не принадлежащих Заказчику;
       </TD>
       </TR>
      </TBODY>
     </TABLE>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        осуществления действий, направленных на получение несанкционированного доступа к ресурсу Сети (компьютеру, другому оборудованию или информационному ресурсу), последующее использование такого доступа, а также уничтожение или модификация программного обеспечения или данных, не принадлежащих Заказчику, без согласования с владельцами этого программного обеспечения или данных либо администраторами данного информационного ресурса. Под несанкционированным доступом понимается любой доступ способом, отличным от предполагавшегося владельцем ресурса;
       </TD>
       </TR>
      </TBODY>
     </TABLE>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        осуществления действий по передаче компьютерам или оборудованию третьих лиц бессмысленной или бесполезной информации, создающей излишнюю (паразитную) нагрузку на эти компьютеры или оборудование, а также промежуточные участки сети, в объемах, превышающих минимально необходимые для проверки связности сетей и доступности отдельных ее элементов;
       </TD>
       </TR>
      </TBODY>
     </TABLE>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        осуществления действий по сканированию узлов сетей с целью выявления внутренней структуры сетей, уязвимости безопасности, списков открытых портов и т.п., без явного согласия владельца проверяемого ресурса;
       </TD>
       </TR>
      </TBODY>
     </TABLE>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        осуществления иных действий, не предусмотренных Договором и/или Стандартами, но содержащих состав уголовного либо административного правонарушения, либо нарушающих права и законные интересы третьих лиц;
       </TD>
       </TR>
      </TBODY>
     </TABLE>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        если Исполнитель получает соответствующий запрос или указание со стороны какого-либо государственного, регулирующего или иного компетентного органа;
       </TD>
       </TR>
      </TBODY>
     </TABLE>
    </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    2.2.
   </TD>
    <TD align="justify" width="95%">
    Время приостановления оказания услуг по причинам, указанным в п. 2.1, не считается перерывом в оказании услуг и не может рассматриваться как нарушение Исполнителем своих обязательств, предусмотренных Договором и Приложениями к нему.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    2.3.
   </TD>
    <TD align="justify" width="95%">
    Приостановление оказания услуг и/или отключение программных или аппаратных средств Заказчика осуществляется до выполнения Заказчиком требований Исполнителя по устранению нарушений и не отменяет выполнения Заказчиком всех своих обязательств по Договору.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <HR />
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    2.4.
   </TD>
    <TD align="justify" width="95%">
    Исполнитель не гарантирует принятие почты Заказчика от удаленных сетей, функционирование которых привело к занесению адреса такой сети в списки, по которым программа доставки почты Исполнителя не осуществляет прием почты.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    2.5.
   </TD>
    <TD align="justify" width="95%">
    Исполнитель не контролирует содержание информации, хранимой, публикуемой или распространяемой Заказчиком с использованием предоставленных услуг, и не несет никакой ответственности за точность, качество и содержание такой информации.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    2.6.
   </TD>
    <TD align="justify" width="95%">
    Исполнитель не несет ответственности за содержание информационных узлов, создаваемых и поддерживаемых Заказчиком или пользователями, и не осуществляет какой-либо предварительной цензуры. В случае явного нарушения законодательства предоставление Услуг может быть приостановлено без предварительного предупреждения. При этом Исполнитель имеет право при необходимости контролировать содержание информационных ресурсов Заказчика или его пользователей.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    2.7.
   </TD>
    <TD align="justify" width="95%">
    Исполнитель не несет ответственности за нарушение прав третьих лиц, возникших в результате действий Заказчика, совершенных с использованием Услуг, предоставляемых Исполнителем.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    2.8.
   </TD>
    <TD align="justify" width="95%">
    Исполнитель не несет ответственности за качество каналов связи общего пользования, посредством которых осуществляется доступ к Услугам.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    2.9.
   </TD>
    <TD align="justify" width="95%">
    Исполнитель не несет ответственности по претензиям Заказчика к качеству соединения с сетью Интернет, связанным с качеством функционирования сетей других провайдеров, политикой обмена трафиком между провайдерами, с функционированием оборудования и программного обеспечения Заказчика и другими обстоятельствами, находящимися вне зоны компетенции, влияния и контроля Исполнителя.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <H2>
 3. Порядок обработки заявок СТП
</H2>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    3.1.
   </TD>
    <TD align="justify" width="95%">
    СТП осуществляет управление, контроль над работой технического оборудования и системных программных средств, обеспечивает предоставление надлежащего сервиса Заказчику в пределах, обусловленных Договором, а также осуществляет обработку запросов Заказчика.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    3.2.
   </TD>
    <TD align="justify" width="95%">
     <SPAN>Каждая заявка имеет приоритет исполнения. Заказчик выставляет приоритет заявке по следующему правилу:</SPAN>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        Высокий - используется только в случаях крайней необходимости, если недоступен виртуальный web-сервер Заказчика.
       </TD>
       </TR>
      </TBODY>
     </TABLE>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        Средний - проблемы технического характера, которые Заказчик не можете устранить самостоятельно.
       </TD>
       </TR>
      </TBODY>
     </TABLE>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        Низкий - вопросы, просьбы, предложения Заказчика, а также все остальное, что не вошло в другие приоритеты.
       </TD>
       </TR>
      </TBODY>
     </TABLE>
    </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    3.3.
   </TD>
    <TD align="justify" width="95%">
     <SPAN>Следующие действия выполняются СТП только при отправлении заявки посредством АСУ:</SPAN>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        удаление какой-либо информации Заказчика;
       </TD>
       </TR>
      </TBODY>
     </TABLE>
     <TABLE style="width: 100%;">
      <TBODY>
       <TR>
        <TD valign="top">
        •
       </TD>
        <TD align="justify" width="98%">
        изменение любых паролей доступа к ресурсам Заказчика;
       </TD>
       </TR>
      </TBODY>
     </TABLE>
    </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    3.4.
   </TD>
    <TD align="justify" width="95%">
    Заказчик также может обратиться в СТП по телефону, однако изменения в конфигурации серверов производятся только на основании письменных заявок по каналам связи.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <H2>
 4. Обеспечение информационной безопасности и целостности данных
</H2>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    4.1.
   </TD>
    <TD align="justify" width="95%">
    Исполнитель обеспечивает базовую информационную безопасность серверов и ресурсов Заказчика в пределах, определяемых обычными условиями, если только в Договоре явно не оговорено иное.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    4.2.
   </TD>
    <TD align="justify" width="95%">
    Исполнитель не несет ответственности за возможную компрометацию паролей Заказчика, произошедшую по его вине, но по требованию Заказчика производит оперативную смену таких паролей.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <HR />
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    4.3.
   </TD>
    <TD align="justify" width="95%">
    Исполнитель обеспечивает резервное копирование статической информации Заказчика, размещенной на серверах Исполнителя, согласно тарифному плану Заказчика, если только такой график и порядок создания резервных копий не оговорены особо в условиях Договора.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    4.4.
   </TD>
    <TD align="justify" width="95%">
    В случаях, если потеря информации произошла по вине Исполнителя, он принимает все необходимые меры для максимально быстрого восстановления информации.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    4.5.
   </TD>
    <TD align="justify" width="95%">
    Если потеря данных была вызвана действиями Заказчика, восстановление данных производится по запросу в СТП в течение 48 часов.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    4.6.
   </TD>
    <TD align="justify" width="95%">
    Если в условиях Договора не оговорен особый режим резервного копирования (рассматриваемый как дополнительная услуга), восстановление производится из последнего архива.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <H2>
 5. Функционирование программного обеспечения клиентов
</H2>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    5.1.
   </TD>
    <TD align="justify" width="95%">
    Исполнитель обеспечивает работоспособность предоставляемых сервисов и их совместимость с другим программным обеспечением в пределах, определяемых документацией на соответствующие сервисы.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    5.2.
   </TD>
    <TD align="justify" width="95%">
    Исполнитель не гарантирует работоспособность и совместимость программного обеспечения, разработанного Заказчиком, или третьими лицами. Программные средства могут быть установлены и использованы Заказчиком без какой-либо гарантии со стороны Исполнителя.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    5.3.
   </TD>
    <TD align="justify" width="95%">
    Исполнитель не гарантирует работоспособность предоставленного им программного обеспечения в случае, если Заказчик вносил в это программное обеспечение свои изменения.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    5.4.
   </TD>
    <TD align="justify" width="95%">
    Исполнитель вправе приостанавливать, блокировать или запрещать использование Заказчиком программного обеспечения (ПО) в случае, если эксплуатация такого программного обеспечения приводит или может привести к аварийным ситуациям, нарушению системы безопасности, нарушению настоящего Регламента или условий Договора.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <H2>
 6. Использование ресурсов системы
</H2>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    6.1.
   </TD>
    <TD align="justify" width="95%">
    Заказчик использует ресурсы системы Исполнителя в соответствии с тарифным планом, если только дополнительными соглашениями не оговорено иное.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top">
    6.2.
   </TD>
    <TD align="justify" width="95%">
    В целях коллективной безопасности Исполнитель оставляет за собой право приостановить предоставление услуги Заказчику в случае нанесения им вреда Исполнителю, либо какому-либо из его клиентов.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
 <TABLE style="width: 100%;">
  <TBODY>
   <TR>
    <TD valign="top"><A name="6.3" />6.3.
   </TD>
    <TD align="justify" width="95%">
    Исполнитель может в любой момент времени, по своему усмотрению, переместить аккаунт Заказчика на другой сервер Исполнителя.
   </TD>
   </TR>
  </TBODY>
 </TABLE>
</NOBODY>
', 'yes');