<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('IsCreate','Folder','StartDate','FinishDate','Details');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
if(Is_Error(System_Load('libs/Artichow.php')))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$NoBody = new Tag('NOBODY');
#-------------------------------------------------------------------------------
$NoBody->AddChild(new Tag('P','Данный вид статистики содержит информацию о количестве и сумме оплаченных счетов за выбранный период времени'));
$NoBody->AddChild(new Tag('P','под суммой, в данном случае, подразумевается сумма всех оплаченных счетов.'));
#-------------------------------------------------------------------------------
$Result = Array('Title'=>'Оплаченные счета*');
#-------------------------------------------------------------------------------
$MonthsNames = Array('Декабрь','Январь','Февраль','Март','Апрель','Май','Июнь','Июль','Август','Сентябрь','Октябрь','Ноябрь','Декабрь');
#-------------------------------------------------------------------------------
if(!$IsCreate)
	return $Result;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// выхлоп с графиками
$Graphs = Array(
		#-------------------------------------------------------------------------------
		// по дням
		'ByDaysPay'	=> Array(
					'Columns'	=> Array(
									Array('string','Дата'),	// даты
									Array('number','Платежи'),	// платежи
								),
					'Title'		=> 'Суммы оплаченных счетов, по дням',
					'hAxisTitle'	=> 'Даты',
					'vAxisTitle'	=> 'Оплачено, руб.',
					'Data'		=> Array()
					),
		#-------------------------------------------------------------------------------
		'ByDaysCount'	=> Array(
					'Columns'	=> Array(
									Array('string','Дата'),	// даты
									Array('number','Платежей'),	// платежи
								),
					'Title'		=> 'Количество оплаченных счетов, по дням',
					'hAxisTitle'	=> 'Даты',
					'vAxisTitle'	=> 'Оплачено счетов, шт.',
					'Data'		=> Array()
					),
		#-------------------------------------------------------------------------------
		'ByDaysPayAvg'	=> Array(
					'Columns'	=> Array(
									Array('string','Дата'),	// даты
									Array('number','Средний чек'),	// платежи
								),
					'Title'		=> 'Средний чек, по дням',
					'hAxisTitle'	=> 'Даты',
					'vAxisTitle'	=> 'Средний чек, руб.',
					'Data'		=> Array()
					),
		#-------------------------------------------------------------------------------
		// по месяцам
		'ByMonthPay'	=> Array(
					'Columns'	=> Array(
									Array('string','Год/месяц'),	// месяцы
									Array('number','Платежи'),	// платежи
								),
					'Title'		=> 'Суммы оплаченных счетов, по месяцам',
					'hAxisTitle'	=> 'Год/месяц',
					'vAxisTitle'	=> 'Оплачено, руб.',
					'Data'		=> Array()
					),
		#-------------------------------------------------------------------------------
		'ByMonthCount'	=> Array(
					'Columns'	=> Array(
									Array('string','Год/месяц'),	// месяцы
									Array('number','Платежей'),	// платежи
								),
					'Title'		=> 'Количество оплаченных счетов, по месяцам',
					'hAxisTitle'	=> 'Год/месяц',
					'vAxisTitle'	=> 'Оплачено счетов, шт.',
					'Data'		=> Array()
					),
		#-------------------------------------------------------------------------------
		'ByMonthPayAvg'	=> Array(
					'Columns'	=> Array(
									Array('string','Год/месяц'),	// месяцы
									Array('number','Средний чек'),	// платежи
								),
					'Title'		=> 'Средний чек, по месяцам',
					'hAxisTitle'	=> 'Год/месяц',
					'vAxisTitle'	=> 'Средний чек, руб.',
					'Data'		=> Array()
					),
		#-------------------------------------------------------------------------------
);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Where = SPrintF("`StatusDate` >= %u AND `StatusDate` <= %u AND `IsPosted` = 'yes'",$StartDate,$FinishDate);
#-------------------------------------------------------------------------------
if(In_Array('ByDays',$Details)){
	#-------------------------------------------------------------------------------
	$Invoices = DB_Select('Invoices',Array('DATE_FORMAT(FROM_UNIXTIME(`StatusDate`),GET_FORMAT(DATE,"ISO")) AS `ISO_Date`', 'GET_DAY_FROM_TIMESTAMP(`StatusDate`) as `Date`','SUM(`Summ`) as `Summ`','COUNT(*) as `Count`'),Array('GroupBy'=>'Date','Where'=>$Where,'SortOn'=>'StatusDate'));
	#-------------------------------------------------------------------------------
	switch(ValueOf($Invoices)){
	case 'error':
		return ERROR | @Trigger_Error(500);
	case 'exception':
		# No more...
		break;
	case 'array':
		#-------------------------------------------------------------------------------
		$Table = Array(Array(new Tag('TD',Array('class'=>'Head'),'День'),new Tag('TD',Array('class'=>'Head'),'Сумма'),new Tag('TD',Array('class'=>'Head'),'Кол-во')));
		#-------------------------------------------------------------------------------
		$CurrentMonth = 0;
		#-------------------------------------------------------------------------------
		foreach($Invoices as $Invoice){
			#-------------------------------------------------------------------------------
			// график по сумме платежей
			$Graphs['ByDaysPay']['Data'][] = Array($Invoice['ISO_Date'],Ceil($Invoice['Summ']));
			#-------------------------------------------------------------------------------
			// график по числу платежей
			$Graphs['ByDaysCount']['Data'][] = Array($Invoice['ISO_Date'],Ceil($Invoice['Count']));
			#-------------------------------------------------------------------------------
			// график среденго чека
			$Graphs['ByDaysPayAvg']['Data'][] = Array($Invoice['ISO_Date'],Ceil($Invoice['Summ']/$Invoice['Count']));
			#-------------------------------------------------------------------------------
			$CurrentYear = Date('Y',$Invoice['Date']*86400);
			#-------------------------------------------------------------------------------
			if(Date('n',$Invoice['Date']*86400) != $CurrentMonth){
				#-------------------------------------------------------------------------------
				$Label[] = Date('j.m.Y',$Invoice['Date']*86400);
				#-------------------------------------------------------------------------------
				$CurrentMonth = Date('n',$Invoice['Date']*86400);
				#-------------------------------------------------------------------------------
				$Table[] = SPrintF('%s %u г.',$MonthsNames[Date('n',$Invoice['Date']*86400)],Date('Y',$Invoice['Date']*86400));
				#-------------------------------------------------------------------------------
			}
			#-------------------------------------------------------------------------------
			$Summ = Comp_Load('Formats/Currency',$Invoice['Summ']);
			if(Is_Error($Summ))
				return ERROR | @Trigger_Error(500);
			#-------------------------------------------------------------------------------
			$Table[] = Array(Date('d',$Invoice['Date']*86400),$Summ,(integer)$Invoice['Count']);
			#-------------------------------------------------------------------------------
		}
		#-------------------------------------------------------------------------------
		$NoBody->AddChild(new Tag('H2','Суммы оплаченных счетов по дням'));
		#-------------------------------------------------------------------------------
		$Comp = Comp_Load('Tables/Extended',$Table);
		#-------------------------------------------------------------------------------
		if(Is_Error($Comp))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
		$NoBody->AddChild(new Tag('DIV',Array('style'=>'float:left; display:none;'),$Comp));
		#-------------------------------------------------------------------------------
		break;
		#-------------------------------------------------------------------------------
	default:
		return ERROR | @Trigger_Error(101);
	}
	#-------------------------------------------------------------------------------
}

#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(In_Array('ByMonth',$Details)){
	#-------------------------------------------------------------------------------
	$Invoices = DB_Select('Invoices',Array('MONTH(FROM_UNIXTIME(`StatusDate`)) as `Month`','YEAR(FROM_UNIXTIME(`StatusDate`)) as Year','SUM(`Summ`) as `Summ`','COUNT(*) as `Count`'),Array('GroupBy'=>Array('Month','Year'),'Where'=>$Where,'SortOn'=>'StatusDate'));
	#-------------------------------------------------------------------------------
	switch(ValueOf($Invoices)){
	case 'error':
		return ERROR | @Trigger_Error(500);
	case 'exception':
		# No more...
		break;
	case 'array':
		#-------------------------------------------------------------------------------
		$Table = Array(Array(new Tag('TD',Array('class'=>'Head'),'Месяц'),new Tag('TD',Array('class'=>'Head'),'Сумма'),new Tag('TD',Array('class'=>'Head'),'Кол-во')));
		#-------------------------------------------------------------------------------
		$CurrentYear = 0;
		#-------------------------------------------------------------------------------
		foreach($Invoices as $Invoice){
			#-------------------------------------------------------------------------------
			// график по сумме платежей
			$Graphs['ByMonthPay']['Data'][] = Array(SPrintF('%s-%02d',$Invoice['Year'],$Invoice['Month']),Ceil($Invoice['Summ']));
			#-------------------------------------------------------------------------------
			// график по числу платежей
			$Graphs['ByMonthCount']['Data'][] = Array(SPrintF('%s-%02d',$Invoice['Year'],$Invoice['Month']),Ceil($Invoice['Count']));
			#-------------------------------------------------------------------------------
			// график среденго чека
			$Graphs['ByMonthPayAvg']['Data'][] = Array(SPrintF('%s-%02d',$Invoice['Year'],$Invoice['Month']),Ceil($Invoice['Summ']/$Invoice['Count']));
			#-------------------------------------------------------------------------------
			#-------------------------------------------------------------------------------
			if($Invoice['Year'] != $CurrentYear){
				#-------------------------------------------------------------------------------
				$CurrentYear = $Invoice['Year'];
				#-------------------------------------------------------------------------------
				$Table[] = SPrintF('%u г.',$CurrentYear);
				#-------------------------------------------------------------------------------
			}
			#-------------------------------------------------------------------------------
			$Summ = Comp_Load('Formats/Currency',$Invoice['Summ']);
			if(Is_Error($Summ))
				return ERROR | @Trigger_Error(500);
			#-----------------------------------------------------------------------
			$Table[] = Array($MonthsNames[$Invoice['Month']],$Summ,(integer)$Invoice['Count']);
			#-------------------------------------------------------------------------------
		}
		#-------------------------------------------------------------------------------
		$NoBody->AddChild(new Tag('H2','Суммы оплаченных счетов по месяцам'));
		#-------------------------------------------------------------------------------
		$Comp = Comp_Load('Tables/Extended',$Table);
		if(Is_Error($Comp))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
		$NoBody->AddChild(new Tag('DIV',Array('style'=>'float:left; display:none;'),$Comp));
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		break;
		#-------------------------------------------------------------------------------
	default:
		return ERROR | @Trigger_Error(101);
	}
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(Count($NoBody->Childs) < 2)
	return $Result;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// добавляем графики в страницу
$Line = Comp_Load('Charts/Line',$Graphs);
if(Is_Error($Line))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
// накидываем DIV'ы в тело страницы
foreach($Line['FnNames'] as $FnName)
	$NoBody->AddChild(new Tag('DIV',Array('style'=>'float:left;width:100%;height:400px;','id'=>SPrintF('div_%s',$FnName)),$FnName));
#-------------------------------------------------------------------------------
$Result['Script'] = $Line['Script'];
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Result['DOM'] = $NoBody;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return $Result;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
?>
