<?php


#-------------------------------------------------------------------------------
/** @author Лапшин С.М. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('IsCreate','Folder','StartDate','FinishDate','Details');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
if(Is_Error(System_Load('libs/Artichow.php')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$NoBody = new Tag('NOBODY');
#-------------------------------------------------------------------------------
$NoBody->AddChild(new Tag('P','Данный вид статистики содержит информацию о количестве и сумме оплаченных счетов за указанный период времени (под суммой в данном случае подразумевается сумма всех оплаченных счетов).'));
#-------------------------------------------------------------------------------
$Result = Array('Title'=>'Оплаченные счета');
#-------------------------------------------------------------------------------
$MonthsNames = Array('Декабрь','Январь','Февраль','Март','Апрель','Май','Июнь','Июль','Август','Сентябрь','Октябрь','Ноябрь','Декабрь');
#-------------------------------------------------------------------------------
if(!$IsCreate)
  return $Result;
#-------------------------------------------------------------------------------
$Where = SPrintF("`StatusDate` >= %u AND `StatusDate` <= %u AND `IsPosted` = 'yes'",$StartDate,$FinishDate);
#-------------------------------------------------------------------------------
if(In_Array('ByDays',$Details)){
  #-----------------------------------------------------------------------------
  $Invoices = DB_Select('Invoices',Array('GET_DAY_FROM_TIMESTAMP(`StatusDate`) as `Date`','SUM(`Summ`) as `Summ`','COUNT(*) as `Count`'),Array('GroupBy'=>'Date','Where'=>$Where,'SortOn'=>'StatusDate'));
  #-----------------------------------------------------------------------------
  switch(ValueOf($Invoices)){
    case 'error':
      return ERROR | @Trigger_Error(500);
    case 'exception':
      # No more...
    break;
    case 'array':
      #-------------------------------------------------------------------------
      $Table = Array(Array(new Tag('TD',Array('class'=>'Head'),'День'),new Tag('TD',Array('class'=>'Head'),'Сумма'),new Tag('TD',Array('class'=>'Head'),'Кол-во')));
      #-------------------------------------------------------------------------
      $CurrentMonth = 0;
      #-------------------------------------------------------------------------
      foreach($Invoices as $Invoice){
        #-----------------------------------------------------------------------
        $CurrentYear = Date('Y',$Invoice['Date']*86400);
        #-----------------------------------------------------------------------
        if(Date('n',$Invoice['Date']*86400) != $CurrentMonth){
          #---------------------------------------------------------------------
          $Label[] = Date('j.m.Y',$Invoice['Date']*86400);
          #---------------------------------------------------------------------
          $CurrentMonth = Date('n',$Invoice['Date']*86400);
          #---------------------------------------------------------------------
          $Table[] = SPrintF('%s %u г.',$MonthsNames[Date('n',$Invoice['Date']*86400)],Date('Y',$Invoice['Date']*86400));
        }
        #-----------------------------------------------------------------------
        $Summ = Comp_Load('Formats/Currency',$Invoice['Summ']);
        if(Is_Error($Summ))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $Table[] = Array(Date('d',$Invoice['Date']*86400),$Summ,(integer)$Invoice['Count']);
      }
      #-------------------------------------------------------------------------
      $NoBody->AddChild(new Tag('H2','Суммы оплаченных счетов по дням'));
      #-------------------------------------------------------------------------
      $Comp = Comp_Load('Tables/Extended',$Table);
      if(Is_Error($Comp))
        return ERROR | @Trigger_Error(500);
      #-------------------------------------------------------------------------
      $NoBody->AddChild($Comp);
    break;
    default:
      return ERROR | @Trigger_Error(101);
  }
}
#-------------------------------------------------------------------------------
if(In_Array('ByMonth',$Details)){
  #-----------------------------------------------------------------------------
  $Invoices = DB_Select('Invoices',Array('MONTH(FROM_UNIXTIME(`StatusDate`)) as `Month`','YEAR(FROM_UNIXTIME(`StatusDate`)) as Year','SUM(`Summ`) as `Summ`','COUNT(*) as `Count`'),Array('GroupBy'=>Array('Month','Year'),'Where'=>$Where,'SortOn'=>'StatusDate'));
  #-----------------------------------------------------------------------------
  switch(ValueOf($Invoices)){
    case 'error':
      return ERROR | @Trigger_Error(500);
    case 'exception':
      # No more...
    break;
    case 'array':
      #-------------------------------------------------------------------------
      $Table = Array(Array(new Tag('TD',Array('class'=>'Head'),'Месяц'),new Tag('TD',Array('class'=>'Head'),'Сумма'),new Tag('TD',Array('class'=>'Head'),'Кол-во')));
      #-------------------------------------------------------------------------
      $Labels = $Line = Array();
      #-------------------------------------------------------------------------
      $CurrentYear = 0;
      #-------------------------------------------------------------------------
      foreach($Invoices as $Invoice){
        #-----------------------------------------------------------------------
        $Labels[] = SPrintF("%s\n%u г.",$MonthsNames[$Invoice['Month']],$Invoice['Year']);
        #-----------------------------------------------------------------------
        $Line[] = $Invoice['Summ'];
        #-----------------------------------------------------------------------
        if($Invoice['Year'] != $CurrentYear){
          #---------------------------------------------------------------------
          $CurrentYear = $Invoice['Year'];
          #---------------------------------------------------------------------
          $Table[] = SPrintF('%u г.',$CurrentYear);
        }
        #-----------------------------------------------------------------------
        $Summ = Comp_Load('Formats/Currency',$Invoice['Summ']);
        if(Is_Error($Summ))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $Table[] = Array($MonthsNames[$Invoice['Month']],$Summ,(integer)$Invoice['Count']);
      }
      #-------------------------------------------------------------------------
      $NoBody->AddChild(new Tag('H2','Суммы оплаченных счетов по месяцам'));
      #-------------------------------------------------------------------------
      $Comp = Comp_Load('Tables/Extended',$Table);
      if(Is_Error($Comp))
        return ERROR | @Trigger_Error(500);
      #-------------------------------------------------------------------------
      $NoBody ->AddChild($Comp);
      #-------------------------------------------------------------------------
      if(Count($Line) > 1){
        #-----------------------------------------------------------------------
        $File = SPrintF('%s.jpg',Md5('Invoices1'));
        #-----------------------------------------------------------------------
        Artichow_Line('Суммы оплаченных счетов по месяцам',SPrintF('%s/%s',$Folder,$File),Array($Line),$Labels,Array(0x325432));
        #-----------------------------------------------------------------------
        $NoBody->AddChild(new Tag('BR'));
        #-----------------------------------------------------------------------
        $NoBody->AddChild(new Tag('IMG',Array('src'=>$File)));
      }
    break;
    default:
      return ERROR | @Trigger_Error(101);
  }
}
#-------------------------------------------------------------------------------
if(In_Array('ByQuarter',$Details)){
  #-----------------------------------------------------------------------------
  $Invoices = DB_Select('Invoices',Array('GET_QUARTER_FROM_TIMESTAMP(`StatusDate`) as `Quarter`','YEAR(FROM_UNIXTIME(`StatusDate`)) as `Year`','SUM(`Summ`) as `Summ`','COUNT(*) as `Count`'),Array('GroupBy'=>Array('Quarter','Year'),'Where'=>$Where,'SortOn'=>'StatusDate'));
  #-----------------------------------------------------------------------------
  switch(ValueOf($Invoices)){
    case 'error':
      return ERROR | @Trigger_Error(500);
    case 'exception':
      # No more...
    break;
    case 'array':
      #-------------------------------------------------------------------------
      $Table = Array(Array(new Tag('TD',Array('class'=>'Head'),'Квартал'),new Tag('TD',Array('class'=>'Head'),'Сумма'),new Tag('TD',Array('class'=>'Head'),'Кол-во')));
      #-------------------------------------------------------------------------
      $Labels = $Line = Array();
      #-------------------------------------------------------------------------
      $CurrentYear = 0;
      #-------------------------------------------------------------------------
      foreach($Invoices as $Invoice){
        #-----------------------------------------------------------------------
        $Labels[] = SPrintF("%u кв. %u г.",$Invoice['Quarter'],$Invoice['Year']);
        #-----------------------------------------------------------------------
        $Line[] = $Invoice['Summ'];
        #-----------------------------------------------------------------------
        if($Invoice['Year'] != $CurrentYear){
          #---------------------------------------------------------------------
          $CurrentYear = $Invoice['Year'];
          #---------------------------------------------------------------------
          $Table[] = SPrintF('%u г.',$CurrentYear);
        }
        #-----------------------------------------------------------------------
        $Summ = Comp_Load('Formats/Currency',$Invoice['Summ']);
        if(Is_Error($Summ))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $Table[] = Array(SPrintF('%u кв.',$Invoice['Quarter']),$Summ,(integer)$Invoice['Count']);
      }
      #-------------------------------------------------------------------------
      $NoBody->AddChild(new Tag('H2','Суммы оплаченных счетов по кварталам'));
      #-------------------------------------------------------------------------
      $Comp = Comp_Load('Tables/Extended',$Table);
      if(Is_Error($Comp))
        return ERROR | @Trigger_Error(500);
      #-------------------------------------------------------------------------
      $NoBody ->AddChild($Comp);
      #-------------------------------------------------------------------------
      if(Count($Line) > 1){
        #-----------------------------------------------------------------------
        $File = SPrintF('%s.jpg',Md5('Invoices2'));
        #-----------------------------------------------------------------------
        Artichow_Line('Суммы оплаченных счетов по кварталам',SPrintF('%s/%s',$Folder,$File),Array($Line),$Labels,Array(0x434565));
        #-----------------------------------------------------------------------
        $NoBody->AddChild(new Tag('BR'));
        #-----------------------------------------------------------------------
        $NoBody->AddChild(new Tag('IMG',Array('src'=>$File)));
      }
    break;
    default:
      return ERROR | @Trigger_Error(101);
  }
}
#-------------------------------------------------------------------------------
if(Count($NoBody->Childs) < 2)
  return $Result;
#-------------------------------------------------------------------------------
$Result['DOM'] = $NoBody;
#-------------------------------------------------------------------------------
return $Result;
#-------------------------------------------------------------------------------

?>
