<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('IsCreate','Folder','StartDate','FinishDate','Details');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Result = Array('Title'=>'Сумма выполненных работ');
#-------------------------------------------------------------------------------
$NoBody = new Tag('NOBODY');
#-------------------------------------------------------------------------------
if(!$IsCreate)
  return $Result;
#-------------------------------------------------------------------------------
$Columns = Array('ID','Customer','Balance',"(SELECT SUM(`Summ`) as `Summ` FROM `Invoices` WHERE `Invoices`.`ContractID` = `Contracts`.`ID` AND `Invoices`.`IsPosted` = 'yes') as `Credit`","(SELECT SUM(`Amount`*`Cost`*(1-`Discont`)) FROM `WorksComplite` WHERE `ContractID` = `Contracts`.`ID`) as `Debet`");
#-------------------------------------------------------------------------------
$Contracts = DB_Select('Contracts',$Columns,Array('SortOn'=>'TypeID'));
#-------------------------------------------------------------------------------
switch(ValueOf($Contracts)){
 case 'error':
   return ERROR | @Trigger_Error(500);
 case 'exception':
   return $Result;
 case 'array':
   #----------------------------------------------------------------------------
   $NoBody->AddChild(new Tag('P','Данный вид статистики содержит информацию о ходе выполнения услуг перед клиентами. Столбец "Сумма оплаченных счетов" отображает общую сумму всех оплаченных счетов клиентов по договору. "Сумма выполненых работ" отражает сумму на которую к данному моменту времени были оказаны услуги.'));
   #----------------------------------------------------------------------------
   $Table = Array(Array(new Tag('TD',Array('class'=>'Head'),'Договор клиента'),new Tag('TD',Array('class'=>'Head'),'Сумма оплаченных счетов'),new Tag('TD',Array('class'=>'Head'),'Сумма выполенных работ'),new Tag('TD',Array('class'=>'Head'),'Задолженность по работам'),new Tag('TD',Array('class'=>'Head'),'Баланс договора')));
   #----------------------------------------------------------------------------
   $Total = 0;
   #----------------------------------------------------------------------------
   foreach($Contracts as $Contract){
     #--------------------------------------------------------------------------
     $Row = Array(new Tag('TD',Array('class'=>'Comment'),$Contract['Customer']));
     #--------------------------------------------------------------------------
     $Comp = Comp_Load('Formats/Currency',$Contract['Credit']);
     if(Is_Error($Comp))
       return ERROR | @Trigger_Error(500);
     #--------------------------------------------------------------------------
     $Row[] = $Comp;
     #--------------------------------------------------------------------------
     $Comp = Comp_Load('Formats/Currency',$Contract['Debet']);
     if(Is_Error($Comp))
       return ERROR | @Trigger_Error(500);
     #--------------------------------------------------------------------------
     $Row[] = $Comp;
     #--------------------------------------------------------------------------
     $Balance = $Contract['Credit'] - $Contract['Debet'];
     #--------------------------------------------------------------------------
     $Total += $Balance;
     #--------------------------------------------------------------------------
     $Comp = Comp_Load('Formats/Currency',$Balance);
     if(Is_Error($Comp))
       return ERROR | @Trigger_Error(500);
     #--------------------------------------------------------------------------
     $Row[] = $Comp;
     #--------------------------------------------------------------------------
     $Comp = Comp_Load('Formats/Currency',$Contract['Balance']);
     if(Is_Error($Comp))
       return ERROR | @Trigger_Error(500);
     #--------------------------------------------------------------------------
     $Row[] = ($Balance != $Contract['Balance']?new Tag('TD',Array('class'=>'Standard','bgcolor'=>'#FF6666'),$Comp):$Comp);
     #--------------------------------------------------------------------------
     $Table[] = $Row;
   }
   #----------------------------------------------------------------------------
   $Comp = Comp_Load('Formats/Currency',$Total);
   if(Is_Error($Comp))
     return ERROR | @Trigger_Error(500);
   #----------------------------------------------------------------------------
   $Table[] = Array(new Tag('TD',Array('colspan'=>6,'class'=>'Standard','align'=>'right'),SPrintF('Общая задолженность по работам:  %s',$Comp)));
   #----------------------------------------------------------------------------
   $Comp = Comp_Load('Tables/Extended',$Table);
   if(Is_Error($Comp))
     return ERROR | @Trigger_Error(500);
   #---------------------------------------------------------------------------
   $NoBody->AddChild($Comp);
   #----------------------------------------------------------------------------
   $Result['DOM'] = $NoBody;
   #---------------------------------------------------------------------------
   return $Result;
 default:
   return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------

?>
