<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args = Args();
#-------------------------------------------------------------------------------
$ServerID	= (integer) @$Args['ServerID'];
//$Month	= (integer) @$Args['Month'];
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('modules/Authorisation.mod')))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Out = Array();
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(!$ServerID)
	return $Out;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Where = Array(
		SPrintF('`ID` = %u',$ServerID),		// идентфикатор сервера из заказа
		SPrintF('`ID` IN (SELECT `ServerID` FROM `OrdersOwners` WHERE `UserID` = %u)',$GLOBALS['__USER']['ID'])	// этот сервер есть в заказах юзера
		);
#-------------------------------------------------------------------------------
$Server = DB_Select('Servers',Array('ID','Address'),Array('UNIQ','Where'=>$Where));
switch(ValueOf($Server)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return $Out;
case 'array':
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// достаём уникальные сервисы, за последние сутки
$Where = Array(
		SPrintF('`ServerID` = %u',$ServerID),
		'`TestDate` > UNIX_TIMESTAMP() - 24*60*60'
		);
#-------------------------------------------------------------------------------
$Services = DB_Select('ServersUpTime',Array('DISTINCT(`Service`) AS `Service`'),Array('SortOn'=>Array('TestDate'),'IsDesc'=>TRUE,'Where'=>$Where));
switch(ValueOf($Services)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return $Out;
case 'array':
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// перебираем уникальные сервисы, достаём последнее показание
foreach($Services as $Service){
	#-------------------------------------------------------------------------------
	$Where = Array(
			SPrintF('`ServerID` = %u',$ServerID),
			SPrintF('`Service` = "%s"',$Service['Service']),
			);
	#-------------------------------------------------------------------------------
	$UpTimes = DB_Select('ServersUpTime',Array('*'),Array('SortOn'=>Array('TestDate'),'IsDesc'=>TRUE,'Where'=>$Where,'UNIQ','Limits'=>Array(0,1)));
	switch(ValueOf($UpTimes)){
	case 'error':
		return ERROR | @Trigger_Error(500);
	case 'exception':
		continue 2;
	case 'array':
		break;
	default:
		return ERROR | @Trigger_Error(101);
	}
	#-------------------------------------------------------------------------------
	$Status = 'Ok';
	#-------------------------------------------------------------------------------
	if($UpTimes['UpTime'] < 100)
		$Status = 'Warning';
	#-------------------------------------------------------------------------------
	if($UpTimes['UpTime'] < 99)
		$Status = 'Critical';
	#-------------------------------------------------------------------------------
	$Out[] = Array('Name'=>$Service['Service'],'Status'=>$Status,'UpdateDate'=>Date('Y-m-d H:i:s',$Service['TestDate']));
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return $Out;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------

?>
