<?php
#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('libs/Http.php')))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
Require_Once(SPrintF('%s/others/hosting/IDNA.php',SYSTEM_PATH));
#-------------------------------------------------------------------------------
function IspManager5_Logon($Settings,$Params){
	/******************************************************************************/
	$__args_types = Array('array','array');
	#-------------------------------------------------------------------------------
	$__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
	/******************************************************************************/
	return Array('Url'=>$Settings['Params']['Url'],'Args'=>Array('lang'=>$Settings['Params']['Language'],'theme'=>$Settings['Params']['Theme'],'checkcookie'=>'no','username'=>$Params['Login'],'password'=>$Params['Password'],'func'=>'auth'));
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
function IspManager5_Get_Domains($Settings){
	/****************************************************************************/
	$__args_types = Array('array');
	#-----------------------------------------------------------------------------
	$__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
	/****************************************************************************/
	$authinfo = SPrintF('%s:%s',$Settings['Login'],$Settings['Password']);
	#-----------------------------------------------------------------------------
	$Http = IspManager5_Build_HTTP($Settings);
	#-------------------------------------------------------------------------------
	# достаём список пользователей/реселлеров
	$Response = Http_Send('/ispmgr',$Http,Array(),Array('authinfo'=>$authinfo,'out'=>'xml','func'=>'user'));
	if(Is_Error($Response))
		return new gException('NOT_CONNECTED_TO_SERVER','Не удалось соедениться с сервером');
	#-------------------------------------------------------------------------------
	$Response = Trim($Response['Body']);
	#-----------------------------------------------------------------------------
	$XML = String_XML_Parse($Response);
	if(Is_Exception($XML))
		return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
	#-----------------------------------------------------------------------------
	$XML = $XML->ToArray('elem');
	#-----------------------------------------------------------------------------
	$Elems = $XML['doc'];
	#-----------------------------------------------------------------------------
	if(IsSet($Elems['error']))
		return new gException('GET_USERS_ERROR',$Elems['error']);
	#-----------------------------------------------------------------------------
	$Resellers = Array();
	#-----------------------------------------------------------------------------
	if(Is_Array($Elems)){
		#-------------------------------------------------------------------------------
		foreach($Elems as $Elem)
			if(IsSet($Elem['owner']) && !In_Array($Elem['owner'],$Resellers))
				$Resellers[] = $Elem['owner'];
		#-------------------------------------------------------------------------------
	}
	#Debug(SPrintF('[system/libs/IspManager5.php]: Resellers = %s',print_r($Resellers,true)));
	#-----------------------------------------------------------------------------
	#-----------------------------------------------------------------------------
	$Owners = Array();
	#-----------------------------------------------------------------------------
	if(Is_Array($Elems)){
		#-------------------------------------------------------------------------------
		foreach($Elems as $Elem)
			if(IsSet($Elem['owner']) && In_Array($Elem['owner'],$Resellers))
				$Owners[$Elem['name']] = $Elem['owner'];
		#-------------------------------------------------------------------------------
	}
	#Debug(SPrintF('[system/libs/IspManager5.php]: Owners = %s',print_r($Owners,true)));
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	# строим выхлопной массив
	$Users = Array();
	#-------------------------------------------------------------------------------
	# достаём список www доменов
	$Response = Http_Send('/ispmgr',$Http,Array(),Array('authinfo'=>$authinfo,'out'=>'xml','func'=>'webdomain'));
	if(Is_Error($Response))
		return new gException('NOT_CONNECTED_TO_SERVER','Не удалось соедениться с сервером');
	#-----------------------------------------------------------------------------
	$Response = Trim($Response['Body']);
	#-----------------------------------------------------------------------------
	$XML = String_XML_Parse($Response);
	if(Is_Exception($XML))
		return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
	#-----------------------------------------------------------------------------
	$XML = $XML->ToArray('elem');
	#-----------------------------------------------------------------------------
	$Domains = $XML['doc'];
	#-----------------------------------------------------------------------------
	if(!Is_Array($Domains))
		return new gException('WWW_DOMAINS_NOT_FOUND','WWW доменов не обнаружено');
	#-----------------------------------------------------------------------------
	if(IsSet($Domains['error']))
		return new gException('GET_WWW_DOMAINS_ERROR',$Domains['error']);
	#-----------------------------------------------------------------------------
	foreach($Domains as $Domain){
		#---------------------------------------------------------------------------
		if(!IsSet($Domain['owner']))
			continue;
		#---------------------------------------------------------------------------
		$Owner = $Domain['owner'];
		#---------------------------------------------------------------------------
		if(!IsSet($Users[$Owner]))
			$Users[$Owner] = Array();
		#---------------------------------------------------------------------------
		$Users[$Owner][] = $Domain['name'];
		#---------------------------------------------------------------------------
		# домены юзеров реселлеров
		if(IsSet($Owners[$Owner])){
			#---------------------------------------------------------------------------
			if(!IsSet($Users[$Owners[$Owner]]))
				$Users[$Owners[$Owner]] = Array();
			#---------------------------------------------------------------------------
			$Users[$Owners[$Owner]][] = $Domain['name'];
		}
		#---------------------------------------------------------------------------
	}
	#-----------------------------------------------------------------------------
	#-----------------------------------------------------------------------------
	# достаём DNS домены
	$Response = Http_Send('/ispmgr',$Http,Array(),Array('authinfo'=>$authinfo,'out'=>'xml','func'=>'domain'));
	if(Is_Error($Response))
		return new gException('NOT_CONNECTED_TO_SERVER','Не удалось соедениться с сервером');
	#-----------------------------------------------------------------------------
	$Response = Trim($Response['Body']);
	#-----------------------------------------------------------------------------
	$XML = String_XML_Parse($Response);
	if(Is_Exception($XML))
		return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
	#-----------------------------------------------------------------------------
	$XML = $XML->ToArray('elem');
	#-----------------------------------------------------------------------------
	$Domains = $XML['doc'];
	#-----------------------------------------------------------------------------
	if(!Is_Array($Domains))
		return new gException('DNS_DOMAINS_NOT_FOUND','DNS доменов не обнаружено');
	#-----------------------------------------------------------------------------
	if(IsSet($Domains['error']))
		return new gException('GET_DNS_DOMAINS_ERROR',$Domains['error']);
	#-----------------------------------------------------------------------------
	foreach($Domains as $Domain){
		#---------------------------------------------------------------------------
		if(!IsSet($Domain['owner']))
			continue;
		#---------------------------------------------------------------------------
		$Owner = $Domain['owner'];
		#---------------------------------------------------------------------------
		if(!IsSet($Users[$Owner]))
			$Users[$Owner] = Array();
		#---------------------------------------------------------------------------
		if(!In_Array($Domain['name'],$Users[$Owner]))
			$Users[$Owner][] = $Domain['name'];
		#---------------------------------------------------------------------------
		# домены юзеров реселлеров
		if(IsSet($Owners[$Owner])){
			#---------------------------------------------------------------------------
			if(!IsSet($Users[$Owners[$Owner]]))
				$Users[$Owners[$Owner]] = Array();
			#---------------------------------------------------------------------------
			if(!In_Array($Domain['name'],$Users[$Owners[$Owner]]))
				$Users[$Owners[$Owner]][] = $Domain['name'];
		}
		#---------------------------------------------------------------------------
	}
	#-----------------------------------------------------------------------------
	#-----------------------------------------------------------------------------
	# достаём Email домены
	$Response = Http_Send('/ispmgr',$Http,Array(),Array('authinfo'=>$authinfo,'out'=>'xml','func'=>'emaildomain'));
	if(Is_Error($Response))
		return new gException('NOT_CONNECTED_TO_SERVER','Не удалось соедениться с сервером');
	#-----------------------------------------------------------------------------
	$Response = Trim($Response['Body']);
	#-----------------------------------------------------------------------------
	$XML = String_XML_Parse($Response);
	if(Is_Exception($XML))
		return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
	#-----------------------------------------------------------------------------
	$XML = $XML->ToArray('elem');
	#-----------------------------------------------------------------------------
	$Domains = $XML['doc'];
	#-----------------------------------------------------------------------------
	if(!Is_Array($Domains))
		return new gException('EMAIL_DOMAINS_NOT_FOUND','Email доменов не обнаружено');
	#-----------------------------------------------------------------------------
	if(IsSet($Domains['error']))
		return new gException('GET_EMAIL_DOMAINS_ERROR',$Domains['error']);
	#-----------------------------------------------------------------------------
	foreach($Domains as $Domain){
		#---------------------------------------------------------------------------
		if(!IsSet($Domain['owner']))
			continue;
		#---------------------------------------------------------------------------
		$Owner = $Domain['owner'];
		#---------------------------------------------------------------------------
		if(!IsSet($Users[$Owner]))
			$Users[$Owner] = Array();
		#---------------------------------------------------------------------------
		if(!In_Array($Domain['name'],$Users[$Owner]))
			$Users[$Owner][] = $Domain['name'];
		#---------------------------------------------------------------------------
		# домены юзеров реселлеров
		if(IsSet($Owners[$Owner])){
			#---------------------------------------------------------------------------
			if(!IsSet($Users[$Owners[$Owner]]))
				$Users[$Owners[$Owner]] = Array();
			#---------------------------------------------------------------------------
			if(!In_Array($Domain['name'],$Users[$Owners[$Owner]]))
				$Users[$Owners[$Owner]][] = $Domain['name'];
		}
		#---------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	#Debug(SPrintF('[system/libs/IspManager5.php]: UsersList = %s',print_r($Users,true)));
	return $Users;
	#-----------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
function IspManager5_Get_Users($Settings){
	/******************************************************************************/
	$__args_types = Array('array');
	#-------------------------------------------------------------------------------
	$__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
	/******************************************************************************/
	$Version = IspManager5_Check_Version($Settings);
	#-------------------------------------------------------------------------------
	Debug(SPrintF('[IspManager5_Get_CPU_Usage]: ISPmanager = %s',$Version));
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	$authinfo = SPrintF('%s:%s',$Settings['Login'],$Settings['Password']);
	#-------------------------------------------------------------------------------
	$Http = IspManager5_Build_HTTP($Settings);
	#-------------------------------------------------------------------------------
	$Response = Http_Send('/ispmgr',$Http,Array(),Array('authinfo'=>$authinfo,'out'=>'xml','func'=>'user'));
	if(Is_Error($Response))
		return new gException('NOT_CONNECTED_TO_SERVER','Не удалось соедениться с сервером');
	#-------------------------------------------------------------------------------
	$Response = Trim($Response['Body']);
	#-------------------------------------------------------------------------------
	$XML = String_XML_Parse($Response);
	#-------------------------------------------------------------------------------
	if(Is_Exception($XML))
		return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
	#-------------------------------------------------------------------------------
	$XML = $XML->ToArray('elem');
	#-------------------------------------------------------------------------------
	$Users = $XML['doc'];
	#-------------------------------------------------------------------------------
	if(IsSet($Users['error']))
		return new gException('GET_USERS_ERROR',$Users['error']);
	#-------------------------------------------------------------------------------
	$Result = Array();
	#-------------------------------------------------------------------------------
	foreach($Users as $User){
		#-------------------------------------------------------------------------------
		if(!IsSet($User['name']))
			continue;
		#-------------------------------------------------------------------------------
		if(!IsSet($User['owner']))
			if($Version != 'Lite')
				continue;
		#-------------------------------------------------------------------------------
		if(!IsSet($User['owner']))
			$User['owner'] = $Settings['Login'];
		#-------------------------------------------------------------------------------
		if($User['owner'] == $Settings['Login'])
			$Result[] = $User['name'];
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	if($Version != 'Lite'){
		#-------------------------------------------------------------------------------
		$Response = Http_Send('/ispmgr',$Http,Array(),Array('authinfo'=>$authinfo,'out'=>'xml','func'=>'reseller'));
		if(Is_Error($Response))
			return new gException('NOT_CONNECTED_TO_SERVER','Не удалось соедениться с сервером');
		#-------------------------------------------------------------------------------
		$Response = Trim($Response['Body']);
		#-------------------------------------------------------------------------------
		$XML = String_XML_Parse($Response);
		#-------------------------------------------------------------------------------
		if(Is_Exception($XML))
			return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
		#-------------------------------------------------------------------------------
		$XML = $XML->ToArray('elem');
		#-------------------------------------------------------------------------------
		$Users = $XML['doc'];
		#-------------------------------------------------------------------------------
		if(IsSet($Users['error']))
			return new gException('GET_USERS_ERROR',$Users['error']);
		#-------------------------------------------------------------------------------
		if(Is_Array($Users)){
			#-------------------------------------------------------------------------------
			foreach($Users as $User){
				#-------------------------------------------------------------------------------
				if(!IsSet($User['name']))
					continue;
				#-------------------------------------------------------------------------------
				$Result[] = $User['name'];
				#-------------------------------------------------------------------------------
			}
			#-------------------------------------------------------------------------------
		}
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	$Response = Http_Send('/ispmgr',$Http,Array(),Array('authinfo'=>$authinfo,'out'=>'xml','func'=>'admin'));
	#-------------------------------------------------------------------------------
	if(Is_Error($Response))
		return new gException('NOT_CONNECTED_TO_SERVER','Не удалось соедениться с сервером');
	#-------------------------------------------------------------------------------
	$Response = Trim($Response['Body']);
	#-------------------------------------------------------------------------------
	$XML = String_XML_Parse($Response);
	#-------------------------------------------------------------------------------
	if(Is_Exception($XML))
		return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
	#-------------------------------------------------------------------------------
	$XML = $XML->ToArray('elem');
	#-------------------------------------------------------------------------------
	$Users = $XML['doc'];
	#-------------------------------------------------------------------------------
	if(IsSet($Users['error']))
		return new gException('GET_USERS_ERROR',$Users['error']);
	#-------------------------------------------------------------------------------
	if(Is_Array($Users)){
		#-------------------------------------------------------------------------------
		foreach($Users as $User){
			#-------------------------------------------------------------------------------
			if(!IsSet($User['name']))
				continue;
			#-------------------------------------------------------------------------------
			if($User['name'] != $Settings['Login'])
			#-------------------------------------------------------------------------------
			$Result[] = $User['name'];
			#-------------------------------------------------------------------------------
		}
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	return $Result;
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
}

#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
function IspManager5_Create($Settings,$Login,$Password,$Domain,$IP,$HostingScheme,$Email,$PersonID = 'Default',$Person = Array()){
	/******************************************************************************/
	$__args_types = Array('array','string','string','string','string','array','string','string','array');
	#-------------------------------------------------------------------------------
	$__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
	/******************************************************************************/
	$authinfo = SPrintF('%s:%s',$Settings['Login'],$Settings['Password']);
	#-------------------------------------------------------------------------------
	$Http = IspManager5_Build_HTTP($Settings);
	#-------------------------------------------------------------------------------
	$IsReselling = $HostingScheme['IsReselling'];
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	# JBS-543, проверяем наличие такого юзера
	$Request = Array(
			'authinfo'      => $authinfo,
			'func'          => $IsReselling?'reseller.edit':'user.edit',
			'out'           => 'xml',
			'elid'          => $Login
			);
	#-------------------------------------------------------------------------------
	$Response = Http_Send('/ispmgr',$Http,Array(),$Request);
	if(Is_Error($Response))
		return new gException('NOT_CONNECTED_TO_SERVER','Не удалось соедениться с сервером');
	#-------------------------------------------------------------------------------
	$Response = Trim($Response['Body']);
	#-------------------------------------------------------------------------------
	$XML = String_XML_Parse($Response);
	#-------------------------------------------------------------------------------
	if(Is_Exception($XML))
		return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
	#-------------------------------------------------------------------------------
	$XML = $XML->ToArray();
	#-------------------------------------------------------------------------------
	$Doc = $XML['doc'];
	#-------------------------------------------------------------------------------
	if(!IsSet($Doc['error']))
		return TRUE;
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	$IDNA = new Net_IDNA_php5();
	#-------------------------------------------------------------------------------
	$Domain = $IDNA->encode($Domain);
	#-------------------------------------------------------------------------------
	$Request = Array(
			'authinfo'			=> $authinfo,
			'out'				=> 'xml',	# Формат вывода
			#'func'				=> 'user.edit',	# Целевая функция
			'func'				=> 'user.add.finish',
			'sok'				=> 'ok',	# Значение параметра должно быть равно "ok"
			'name'				=> $Login,	# Имя пользователя (реселлера)
			#'fullname'			=> $Login,	# полное имя
			'passwd'			=> $Password,	# Пароль
			'confirm'			=> $Password,	# Подтверждение
			'ip'				=> $IP,		# IP-адрес
			'email'				=> $Email,
			#-------------------------------------------------------------------------------
			'limit_quota'			=> $HostingScheme['QuotaDisk'],
			'limit_cgi'			=> ($HostingScheme['IsCGIAccess']?'on':'off'),
			'limit_db'			=> $HostingScheme['QuotaDBs'],
			'limit_db_users'		=> $HostingScheme['QuotaUsersDBs'],
			'limit_domains'			=> $HostingScheme['QuotaDomains'],
			'limit_emaildomains'		=> $HostingScheme['QuotaEmailDomains'],
			'limit_emaildomains_enabled'	=> ($HostingScheme['QuotaEmailDomains']?'on':'off'),
			'limit_emails'			=> $HostingScheme['QuotaEmail'],
			'limit_ftp_users'		=> $HostingScheme['QuotaFTP'],
			'limit_php_mode'		=> ($HostingScheme['IsPHPModAccess']?'php_mode_mod':'off'),
			'limit_php_mode_cgi'		=> ($HostingScheme['IsPHPCGIAccess']?'on':'off'),
			'limit_php_mode_mod'		=> ($HostingScheme['IsPHPModAccess']?'on':'off'),
			'limit_shell'			=> ($HostingScheme['IsShellAccess']?'on':'off'),
			'limit_ssl'			=> ($HostingScheme['IsSSLAccess']?'on':'off'),
			'limit_webdomains'		=> $HostingScheme['QuotaWWWDomains'],
			'limit_webdomains_enabled'	=> ($HostingScheme['QuotaWWWDomains']?'on':'off'),
			'php_enable'			=> 'on',	# TODO: расхардкодить надо
			'preset'			=> '#custom',
			'mailrate'			=> $HostingScheme['mailrate'],	# TODO: отследить когда реализуют

			'ftp_user_name'			=> $Login,
			'emaildomain_name'		=> $Domain,
			'webdomain_name'		=> $Domain,
			'domain'			=> $Domain,
			#'bandwidthlimit'  => $HostingScheme['QuotaTraffic'], # Трафик
			#'ssi'                   => ($HostingScheme['IsSSIAccess']?'on':'off'), # SSI
			#'phpfcgi'               => ($HostingScheme['IsPHPFastCGIAccess']?'on':'off'), # PHP как FastCGI
			#'safemode'              => ($HostingScheme['IsPHPSafeMode']?'on':'off'), # Безопасный режим
			#'cpulimit'              => $HostingScheme['MaxExecutionTime'], # Ограничение на CPU
			#'memlimit'              => Ceil($HostingScheme['QuotaMEM']), # Ограничение на память
			#'proclimit'             => $HostingScheme['QuotaPROC'], # Кол-во процессов
			#'maxclientsvhost'       => $HostingScheme['QuotaMPMworkers'], # mpm-itk
			#'mysqlquerieslimit'     => $HostingScheme['mysqlquerieslimit'],      # Запросов к MySQL
			#'mysqlupdateslimit'     => $HostingScheme['mysqlupdateslimit'],      # Обновлений MySQL
			#'mysqlconnectlimit'     => $HostingScheme['mysqlconnectlimit'],      # Соединений к MySQL
			#'mysqluserconnectlimit' => $HostingScheme['mysqluserconnectlimit'],   # Одновременных соединений к MySQL

			);
	#-------------------------------------------------------------------------------
	if($HostingScheme['QuotaWWWDomains'])
		$Request['domain'] = $Domain; # Домен
	#-------------------------------------------------------------------------------
	if(!$IsReselling){
		#-------------------------------------------------------------------------------
		$Request['owner'] = $Settings['Login']; # Владелец
		#-------------------------------------------------------------------------------
	}else{
		#-------------------------------------------------------------------------------
		$Request['limit_users'] = $HostingScheme['QuotaUsers']; # Пользователи
		#-------------------------------------------------------------------------------
	}
  	#-------------------------------------------------------------------------------
	$Response = Http_Send('/ispmgr',$Http,Array(),$Request);
	if(Is_Error($Response))
		return ERROR | @Trigger_Error('[IspManager5_Create]: не удалось соедениться с сервером');
	#-------------------------------------------------------------------------------
	$Response = Trim($Response['Body']);
	#-------------------------------------------------------------------------------
	$XML = String_XML_Parse($Response);
	#-------------------------------------------------------------------------------
	if(Is_Exception($XML))
		return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
	#-------------------------------------------------------------------------------
	$XML = $XML->ToArray();
	#-------------------------------------------------------------------------------
	$Doc = $XML['doc'];
	#-------------------------------------------------------------------------------
	if(IsSet($Doc['error']))
		return new gException('ACCOUNT_CREATE_ERROR','Не удалось создать заказ хостинга');
	#-------------------------------------------------------------------------------
	if(!$Settings['Params']['NoRestartCreate'])
		IspManager5_Service_Restart($Settings,'httpd');
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	return TRUE;
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
}

#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
function IspManager5_Active($Settings,$Login,$IsReseller = FALSE){
	/******************************************************************************/
	$__args_types = Array('array','string','boolean');
	#-------------------------------------------------------------------------------
	$__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
	/******************************************************************************/
	$authinfo = SPrintF('%s:%s',$Settings['Login'],$Settings['Password']);
	#-------------------------------------------------------------------------------
	$Http = IspManager5_Build_HTTP($Settings);
	#-------------------------------------------------------------------------------
	$Response = Http_Send('/ispmgr',$Http,Array(),Array('authinfo'=>$authinfo,'out'=>'xml','func'=>'user.resume','elid'=>$Login));
	if(Is_Error($Response))
		return ERROR | @Trigger_Error('[IspManager5_Activate]: не удалось соедениться с сервером');
	#-------------------------------------------------------------------------------
	$Response = Trim($Response['Body']);
	#-------------------------------------------------------------------------------
	$XML = String_XML_Parse($Response);
	#-------------------------------------------------------------------------------
	if(Is_Exception($XML))
		return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
	#-------------------------------------------------------------------------------
	$XML = $XML->ToArray();
	#-------------------------------------------------------------------------------
	$Doc = $XML['doc'];
	#-------------------------------------------------------------------------------
	if(IsSet($Doc['error']))
		return new gException('ACCOUNT_ACTIVATE_ERROR','Не удалось активировать заказ хостинга');
	#-------------------------------------------------------------------------------
	if(!$Settings['Params']['NoRestartActive'])
		IspManager5_Service_Restart($Settings,'httpd');
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	return TRUE;
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
}

#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
function IspManager5_Suspend($Settings,$Login,$IsReseller = FALSE){
	/******************************************************************************/
	$__args_types = Array('array','string','boolean');
	#-------------------------------------------------------------------------------
	$__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
	/******************************************************************************/
	$authinfo = SPrintF('%s:%s',$Settings['Login'],$Settings['Password']);
	#-------------------------------------------------------------------------------
	$Http = IspManager5_Build_HTTP($Settings);
	#-------------------------------------------------------------------------------
	$Response = Http_Send('/ispmgr',$Http,Array(),Array('authinfo'=>$authinfo,'out'=>'xml','func'=>'user.suspend','elid'=>$Login));
	if(Is_Error($Response))
		return ERROR | @Trigger_Error('[IspManager5_Suspend]: не удалось соедениться с сервером');
	#-------------------------------------------------------------------------------
	$Response = Trim($Response['Body']);
	#-------------------------------------------------------------------------------
	$XML = String_XML_Parse($Response);
	if(Is_Exception($XML))
		return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
	#-------------------------------------------------------------------------------
	$XML = $XML->ToArray();
	#-------------------------------------------------------------------------------
	$Doc = $XML['doc'];
	#-------------------------------------------------------------------------------
	if(IsSet($Doc['error']))
		return new gException('ACCOUNT_SUSPEND_ERROR','Не удалось заблокировать заказ хостинга');
	#-------------------------------------------------------------------------------
	if(!$Settings['Params']['NoRestartSuspend'])
		IspManager5_Service_Restart($Settings,'httpd');
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	return TRUE;
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
}

#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
function IspManager5_Delete($Settings,$Login,$IsReseller = FALSE){
	/******************************************************************************/
	$__args_types = Array('array','string','boolean');
	#-------------------------------------------------------------------------------
	$__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
	/******************************************************************************/
	$authinfo = SPrintF('%s:%s',$Settings['Login'],$Settings['Password']);
	#-------------------------------------------------------------------------------
	$Http = IspManager5_Build_HTTP($Settings);
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	# JBS-543, проверяем наличие такого юзера
	$Request = Array(
			'authinfo'      => $authinfo,
			'func'          => $IsReseller?'reseller.edit':'user.edit',
			'out'           => 'xml',
			'elid'          => $Login
			);
	#-------------------------------------------------------------------------------
	$Response = Http_Send('/ispmgr',$Http,Array(),$Request);
	if(Is_Error($Response))
		return new gException('NOT_CONNECTED_TO_SERVER','Не удалось соедениться с сервером');
	#-------------------------------------------------------------------------------
	$Response = Trim($Response['Body']);
	#-------------------------------------------------------------------------------
	$XML = String_XML_Parse($Response);
	#-------------------------------------------------------------------------------
	if(Is_Exception($XML))
		return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
	#-------------------------------------------------------------------------------
	$XML = $XML->ToArray();
	#-------------------------------------------------------------------------------
	$Doc = $XML['doc'];
	#-------------------------------------------------------------------------------
	if(IsSet($Doc['error']))
		return TRUE;
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	# проверка что это реселлер, если так - надо дропать его юзеров
	if($IsReseller){
		#-------------------------------------------------------------------------------
		# достаём список всех юзеров
		$Request = Array(
				'authinfo'      => $authinfo,
				'func'          => 'user',
				'out'           => 'xml',
				'su'            => $Login
				);
		#-----------------------------------------------------------------------------
		$Response = Http_Send('/ispmgr',$Http,Array(),$Request);
		if(Is_Error($Response))
			return new gException('NOT_CONNECTED_TO_SERVER','Не удалось соедениться с сервером');
		#-----------------------------------------------------------------------------
		$Response = Trim($Response['Body']);
		#-------------------------------------------------------------------------------
		$XML = String_XML_Parse($Response);
		if(Is_Exception($XML))
			return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
		#-----------------------------------------------------------------------------
		$XML = $XML->ToArray('elem');
		#-------------------------------------------------------------------------------
		$Users = $XML['doc'];
		#-------------------------------------------------------------------------------
		if(Is_Array($Users)){
			#-----------------------------------------------------------------------------
			# дропаем юзеров
			foreach($Users as $User){
				#-----------------------------------------------------------------------------
				$Request = Array(
						'authinfo'      => $authinfo,
						'func'		=> 'user.delete',
						'out'		=> 'xml',
						'su'		=> $Login,
						'elid'		=> $User['name']
						);
				#-----------------------------------------------------------------------------
				$Response = Http_Send('/ispmgr',$Http,Array(),$Request);
				if(Is_Error($Response))
					return ERROR | @Trigger_Error('[IspManager5_Delete]: не удалось соедениться с сервером');
				# я так думаю, неважно чё он там ответил, если ответил...
				#-----------------------------------------------------------------------------
			}
			#-----------------------------------------------------------------------------
		}
		#-----------------------------------------------------------------------------
 	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	$Response = Http_Send('/ispmgr',$Http,Array(),Array('authinfo'=>$authinfo,'out'=>'xml','func'=>'user.delete','elid'=>$Login));
	if(Is_Error($Response))
		return ERROR | @Trigger_Error('[IspManager5_Delete]: не удалось соедениться с сервером');
	#-------------------------------------------------------------------------------
	$Response = Trim($Response['Body']);
	#-------------------------------------------------------------------------------
	$XML = String_XML_Parse($Response);
	if(Is_Exception($XML))
		return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
	#-------------------------------------------------------------------------------
	$XML = $XML->ToArray();
	#-------------------------------------------------------------------------------
	$Doc = $XML['doc'];
	#-------------------------------------------------------------------------------
	if(IsSet($Doc['error']))
		return new gException('ACCOUNT_DELETE_ERROR','Не удалось удалить заказ хостинга');
	#-------------------------------------------------------------------------------
	if(!$Settings['Params']['NoRestartDelete'])
		IspManager5_Service_Restart($Settings,'httpd');
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	return TRUE;
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
function IspManager5_Scheme_Change($Settings,$Login,$HostingScheme){
	/******************************************************************************/
	$__args_types = Array('array','string','array');
	#-------------------------------------------------------------------------------
	$__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
	/******************************************************************************/
	$authinfo = SPrintF('%s:%s',$Settings['Login'],$Settings['Password']);
	#-------------------------------------------------------------------------------
	$Http = IspManager5_Build_HTTP($Settings);
	#-------------------------------------------------------------------------------
	$IsReselling = $HostingScheme['IsReselling'];
	#-------------------------------------------------------------------------------
	$Request = Array(
			'authinfo'			=> $authinfo,
			'out'				=> 'xml', # Формат вывода
			'func'				=> 'user.edit', # Целевая функция
			'elid'				=> $Login, # Уникальный идентификатор
			'sok'				=> 'ok', # Значение параметра должно быть равно "yes"
			'name'				=> $Login, # Имя пользователя (реселлера)
			'ip'				=> $Settings['Params']['IP'], # IP-адрес
			#-------------------------------------------------------------------------------
			'limit_quota'			=> $HostingScheme['QuotaDisk'],
			'limit_cgi'			=> ($HostingScheme['IsCGIAccess']?'on':'off'),
			'limit_db'			=> $HostingScheme['QuotaDBs'],
			'limit_db_users'		=> $HostingScheme['QuotaUsersDBs'],
			'limit_domains'			=> $HostingScheme['QuotaDomains'],
			'limit_emaildomains'		=> $HostingScheme['QuotaEmailDomains'],
			'limit_emaildomains_enabled'	=> ($HostingScheme['QuotaEmailDomains']?'on':'off'),
			'limit_emails'			=> $HostingScheme['QuotaEmail'],
			'limit_ftp_users'		=> $HostingScheme['QuotaFTP'],
			'limit_php_mode'		=> ($HostingScheme['IsPHPModAccess']?'php_mode_mod':'off'),
			'limit_php_mode_cgi'		=> ($HostingScheme['IsPHPCGIAccess']?'on':'off'),
			'limit_php_mode_mod'		=> ($HostingScheme['IsPHPModAccess']?'on':'off'),
			'limit_shell'			=> ($HostingScheme['IsShellAccess']?'on':'off'),
			'limit_ssl'			=> ($HostingScheme['IsSSLAccess']?'on':'off'),
			'limit_webdomains'		=> $HostingScheme['QuotaWWWDomains'],
			'limit_webdomains_enabled'	=> ($HostingScheme['QuotaWWWDomains']?'on':'off'),
			'php_enable'			=> 'on',	# TODO: расхардкодить надо
			'preset'			=> '#custom',
			'mailrate'			=> $HostingScheme['mailrate'],	# TODO: отследить когда реализуют
			);
	#-------------------------------------------------------------------------------
	if(!$IsReselling){
		#-------------------------------------------------------------------------------
		$Request['owner'] = $Settings['Login']; # Владелец
		#-------------------------------------------------------------------------------
	}else{
		#-------------------------------------------------------------------------------
		$Request['userlimit'] = $HostingScheme['QuotaUsers']; # Пользователи
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	$Response = Http_Send('/ispmgr',$Http,Array(),$Request);
	#-------------------------------------------------------------------------------
	if(Is_Error($Response))
		return ERROR | @Trigger_Error('[IspManager5_Scheme_Change]: не удалось соедениться с сервером');
	#-------------------------------------------------------------------------------
	$Response = Trim($Response['Body']);
	#-------------------------------------------------------------------------------
	$XML = String_XML_Parse($Response);
	#-------------------------------------------------------------------------------
	if(Is_Exception($XML))
		return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
	#-------------------------------------------------------------------------------
	$XML = $XML->ToArray();
	#-------------------------------------------------------------------------------
	$Doc = $XML['doc'];
	#-------------------------------------------------------------------------------
	if(IsSet($Doc['error']))
		return new gException('SCHEME_CHANGE_ERROR','Не удалось изменить тарифный план для заказа хостинга');
	#-------------------------------------------------------------------------------
	if(!$Settings['Params']['NoRestartSchemeChange'])
		IspManager5_Service_Restart($Settings,'httpd');
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	return TRUE;
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
function IspManager5_Password_Change($Settings,$Login,$Password,$IsReseller = FALSE){
	/******************************************************************************/
	$__args_types = Array('array','string','string','boolean');
	#-------------------------------------------------------------------------------
	$__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
	/******************************************************************************/
	$authinfo = SPrintF('%s:%s',$Settings['Login'],$Settings['Password']);
	#-------------------------------------------------------------------------------
	$Http = IspManager5_Build_HTTP($Settings);
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	$Request = Array('authinfo'=>$authinfo,'out'=>'xml','func'=>'usrparam','su'=>$Login,'sok'=>'ok','atype'=>'atany','passwd'=>$Password,'confirm'=>$Password);
	#-------------------------------------------------------------------------------
	$Response = Http_Send('/ispmgr',$Http,Array(),$Request);
	if(Is_Error($Response))
		return ERROR | @Trigger_Error('[IspManager5_Password_Change]: не удалось соедениться с сервером');
	#-------------------------------------------------------------------------------
	$Response = Trim($Response['Body']);
	#-------------------------------------------------------------------------------
	$XML = String_XML_Parse($Response);
	if(Is_Exception($XML))
		return ERROR | @Trigger_Error('[IspManager5_Password_Change]: неверный ответ от сервера');
	#-------------------------------------------------------------------------------
	$XML = $XML->ToArray();
	#-------------------------------------------------------------------------------
	$Doc = $XML['doc'];
	#-------------------------------------------------------------------------------
	if(IsSet($Doc['error']))
		return new gException('PASSWORD_CHANGE_ERROR','Не удалось изменить пароль для заказа хостинга, возможно, он слишком простой');
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	return TRUE;
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
}

#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
function IspManager5_Get_Email_Boxes($Settings){
	/******************************************************************************/
	$__args_types = Array('array');
	#-------------------------------------------------------------------------------
	$__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
	/******************************************************************************/
	$authinfo = SPrintF('%s:%s',$Settings['Login'],$Settings['Password']);
	#-------------------------------------------------------------------------------
	$Http = IspManager5_Build_HTTP($Settings);
	#-------------------------------------------------------------------------------
	$Response = Http_Send('/ispmgr',$Http,Array(),Array('authinfo'=>$authinfo,'out'=>'xml','func'=>'emaildomain'));
	if(Is_Error($Response))
		return new gException('NOT_CONNECTED_TO_SERVER','Не удалось соедениться с сервером');
	#-------------------------------------------------------------------------------
	$Response = Trim($Response['Body']);
	#-------------------------------------------------------------------------------
	$XML = String_XML_Parse($Response);
	if(Is_Exception($XML))
		return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
	#-------------------------------------------------------------------------------
	$XML = $XML->ToArray('elem');
	#-------------------------------------------------------------------------------
	$Result = $XML['doc'];
	#-------------------------------------------------------------------------------
	if(!Is_Array($Result))
		return new gException('BOXES_NOT_FOUND','Почтовых доменов не обнаружено');
	#-------------------------------------------------------------------------------
	if(IsSet($Result['error']))
		return ERROR | @Trigger_Error('[IspManager5_Get_Email_Boxes]: не удалось получить список почтовых ящиков');
	#-------------------------------------------------------------------------------
	$Domains = Array();
	#-------------------------------------------------------------------------------
	foreach($Result as $Domain){
		#-------------------------------------------------------------------------------
		if(!Is_Array($Domain))
			continue;
		#-------------------------------------------------------------------------------
		if(!IsSet($Domain['owner']))
			continue;
		#-------------------------------------------------------------------------------
		$Owner = $Domain['owner'];
		#-------------------------------------------------------------------------------
		if(!IsSet($Users[$Owner]))
			$Users[$Owner] = Array();
		#-------------------------------------------------------------------------------
		$Domains[$Domain['name']] = Array('Owner'=>$Owner,'Boxes'=>Array());
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	$Response = Http_Send('/ispmgr',$Http,Array(),Array('authinfo'=>$authinfo,'out'=>'xml','func'=>'email'));
	if(Is_Error($Response))
		return new gException('NOT_CONNECTED_TO_SERVER','Не удалось соедениться с сервером');
	#-------------------------------------------------------------------------------
	$Response = $Response['Body'];
	#-------------------------------------------------------------------------------
	$XML = String_XML_Parse($Response);
	if(Is_Exception($XML))
		return new gException('WRONG_SERVER_ANSWER','Неверный ответ от сервера');
	#-------------------------------------------------------------------------------
	$XML = $XML->ToArray('elem',Array('used','limit'));
	#-------------------------------------------------------------------------------
	$Result = $XML['doc'];
	#-------------------------------------------------------------------------------
	if(!Is_Array($Result))
		return new gException('BOXES_NOT_FOUND','Почтовых ящиков не обнаружено');
	#-------------------------------------------------------------------------------
	if(IsSet($Result['error']))
		return ERROR | @Trigger_Error('[IspManager5_Get_Email_Boxes]: не удалось получить список почтовых ящиков');
	#-------------------------------------------------------------------------------
	foreach($Result as $Box){
		#-------------------------------------------------------------------------------
		if(!Is_Array($Box))
			continue;
		#-------------------------------------------------------------------------------
		if(!IsSet($Box['name']))
			continue;
		#-------------------------------------------------------------------------------
		$Name = Explode('@',$Box['name']);
		#-------------------------------------------------------------------------------
		if(!IsSet($Domains[$Domain = Next($Name)]))
			continue;
		#-------------------------------------------------------------------------------
		$Domains[$Domain]['Boxes'][$Box['name']] = Array($Box['size_used'],$Box['size_total']);
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	$Users = Array();
	#-------------------------------------------------------------------------------
	foreach($Domains as $DomainID=>$Domain){
		#-------------------------------------------------------------------------------
		$Owner = $Domain['Owner'];
		#-------------------------------------------------------------------------------
		if(!IsSet($Users[$Owner]))
			$Users[$Owner] = Array();
		#-------------------------------------------------------------------------------
		foreach($Domain['Boxes'] as $Email=>$Box)
			$Users[$Owner][$Email] = $Box;
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	return $Users;
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
}

#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# added by lissyara 2011-08-08 in 11:25 MSK
function IspManager5_AddIP($Settings,$Login,$ID,$Domain,$IP,$AddressType){
        /****************************************************************************/
        $__args_types = Array('array','string','string','string','string','string');
        $__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
        /****************************************************************************/
        $authinfo = SPrintF('%s:%s',$Settings['Login'],$Settings['Password']);
        #-----------------------------------------------------------------------------
        $Http = IspManager5_Build_HTTP($Settings);
        #-----------------------------------------------------------------------------
        $Request = Array(
                'authinfo'      => $authinfo,
                'out'           => 'xml',
                'func'          => 'iplist.edit',
                'elid'          => '',
                'sok'           => 'ok',
                'stat'          => 'assigned',
                'rname'         => $Domain,
                'owner'         => $Login,
                'type'          => StrToLower($AddressType)
        );
        $Response = Http_Send('/ispmgr',$Http,Array(),$Request);
        if(Is_Error($Response))
                return new gException('NOT_CONNECTED_TO_SERVER','Не удалось соедениться с сервером');
        #-----------------------------------------------------------------------------
        $Response = Trim($Response['Body']);
        #-----------------------------------------------------------------------------
        $XML = String_XML_Parse($Response);
        if(Is_Exception($XML))
                return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
        $XML = $XML->ToArray();
        #-----------------------------------------------------------------------------
        $Doc = $XML['doc'];
        #-----------------------------------------------------------------------------
        if(IsSet($Doc['error']))
                return new gException('IP_ADD_CREATE_ERROR','Не удалось добавить IP адрес');
        #-----------------------------------------------------------------------------
        #-----------------------------------------------------------------------------
        #Debug("[system/libs/IspManager5]: to hosting order added IP = " . $Doc['ip']);
        #-----------------------------------------------------------------------------
	$IsUpdate = DB_Update('ExtraIPOrders',Array('Login'=>$Doc['ip']),Array('ID'=>$ID));
        if(Is_Error($IsUpdate))
                return ERROR | @Trigger_Error('[IspManager5_AddIP]: не удалось прописать IP адрес для заказа хостинга ' . $Login);
        #-----------------------------------------------------------------------------
        return TRUE;
}

# added by lissyara 2011-08-10 in 10:13 MSK
#-------------------------------------------------------------------------------
function IspManager5_DeleteIP($Settings,$ExtraIP){
	/****************************************************************************/
        $__args_types = Array('array','string');
        $__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
        #Debug("ExtraIP order ID = " . $ID);
	/****************************************************************************/
	$authinfo = SPrintF('%s:%s',$Settings['Login'],$Settings['Password']);
	#-----------------------------------------------------------------------------
	$Http = IspManager5_Build_HTTP($Settings);
	#-------------------------------------------------------------------------------
        # Логика.
        # 1. определяем число доменов на этом адресе.
        # 2. если доменов больше нуля - переносим их на шаред адрес
        # 3. удаляем IP
        #
        # func=iplist.edit&elid=91.227.16.38
        # func=iplist&clickstat=yes
        $Request = Array(
                'authinfo'      => $authinfo,
                'func'          => 'iplist.edit',
                'out'           => 'xml',
                'elid'          => $ExtraIP
        );
        $Response = Http_Send('/ispmgr',$Http,Array(),$Request);
        if(Is_Error($Response))
                return ERROR | @Trigger_Error('[IspManager5_DeleteIP]: не удалось соедениться с сервером');
        $Response = Trim($Response['Body']);
        $XML = String_XML_Parse($Response);
        if(Is_Exception($XML))
                return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
        $XML = $XML->ToArray();
        $Doc = $XML['doc'];
        if(IsSet($Doc['error']))
                return new gException('CHECK_IP_STATUS_ERROR','Не удалось проверить статус IP');
        #-----------------------------------------------------------------------------
        #-----------------------------------------------------------------------------
        if(IsSet($Doc['domain'])){
                # IP in use, have some domains
                # func=webdomain
                $Request = Array(
                        'authinfo'      => $authinfo,
                        'func'          => 'webdomain',
                        'out'           => 'xml',
                        'su'            => $Settings['UserLogin']
                );
                $Response = Http_Send('/ispmgr',$Http,Array(),$Request);
                if(Is_Error($Response))
                        return new gException('NOT_CONNECTED_TO_SERVER','Не удалось соедениться с сервером');
		#-----------------------------------------------------------------------------
                $Response = Trim($Response['Body']);
		#-----------------------------------------------------------------------------
                $XML = String_XML_Parse($Response);
                if(Is_Exception($XML))
                        return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
		#-----------------------------------------------------------------------------
                $XML = $XML->ToArray('elem');
		#-----------------------------------------------------------------------------
                $Domains = $XML['doc'];
		#-----------------------------------------------------------------------------
                if(!Is_Array($Domains))
                        return new gException('DOMAINS_NOT_FOUND','Доменов не обнаружено');
		#-----------------------------------------------------------------------------
                if(IsSet($Domains['error']))
                        return new gException('GET_DOMAINS_ERROR',$Domains['error']);
		#-----------------------------------------------------------------------------
                foreach($Domains as $Domain){
			#-----------------------------------------------------------------------------
                        if($Domain['ip'] == $ExtraIP){
				#-----------------------------------------------------------------------------
                                #Debug("[system/libs/IspManager5.php]: on IP " . $ExtraIP . " found domain " . $Domain['name']);
                                # get domain settings
                                # func=webdomain.edit&elid=ffffff.ru
                                $Request = Array(
                                        'authinfo'      => $authinfo,
                                        'func'          => 'webdomain.edit',
                                        'elid'          => $Domain['name'],
                                        'out'           => 'xml',
                                        'su'            => $Settings['UserLogin']
                                );
				#-----------------------------------------------------------------------------
                                $Response = Http_Send('/ispmgr',$Http,Array(),$Request);
                                if(Is_Error($Response))
                                        return ERROR | @Trigger_Error('[IspManager5_DeleteIP]: не удалось соедениться с сервером');
				#-----------------------------------------------------------------------------
                                $Response = Trim($Response['Body']);
				#-----------------------------------------------------------------------------
                                $XML = String_XML_Parse($Response);
				#-----------------------------------------------------------------------------
                                if(Is_Exception($XML))
                                        return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
				#-----------------------------------------------------------------------------
                                $XML = $XML->ToArray();
				#-----------------------------------------------------------------------------
                                $Doc = $XML['doc'];
				#-----------------------------------------------------------------------------
                                if(IsSet($Doc['error']))
                                        return new gException('USER_DATA_TAKE_ERROR','Ошибка получения данных пользователя из системы управления');
				#-----------------------------------------------------------------------------
                                # change settings
                                $Request = Array(
                                        'authinfo'      => $authinfo,
                                        'out'           => 'xml',
                                        'func'          => 'webdomain.edit',
                                        'elid'          => $Domain['name'],
                                        'sok'           => 'ok'
                                );
				#-----------------------------------------------------------------------------
                                foreach(Array_Keys($Doc) as $ParamID)
                                        $Request[$ParamID] = $Doc[$ParamID];
				#-----------------------------------------------------------------------------
                                # change IP to shared
                                $Request['ip']  = $Settings['IP'];
				#-----------------------------------------------------------------------------
                                $Response = Http_Send('/ispmgr',$Http,Array(),$Request);
                                if(Is_Error($Response))
                                        return ERROR | @Trigger_Error('[IspManager5_DeleteIP]: не удалось соедениться с сервером');
				#-----------------------------------------------------------------------------
                                $Response = $Response['Body'];
				#-----------------------------------------------------------------------------
                                $XML = String_XML_Parse($Response);
				#-----------------------------------------------------------------------------
                                if(Is_Exception($XML))
                                        return ERROR | @Trigger_Error('[IspManager5_DeleteIP]: неверный ответ от сервера');
				#-----------------------------------------------------------------------------
                                $XML = $XML->ToArray();
				#-----------------------------------------------------------------------------
                                $Doc = $XML['doc'];
				#-----------------------------------------------------------------------------
                                if(IsSet($Doc['error']))
                                        return new gException('IspManager5_DeleteIP','Не удалось изменить IP для домена' . $Domain['name']);
				#-----------------------------------------------------------------------------
                        }
			#-----------------------------------------------------------------------------
                }
		#-----------------------------------------------------------------------------
        }
        #-----------------------------------------------------------------------------
        #-----------------------------------------------------------------------------
	# added by lissyara, 2014-09-19 in 09:02 MSK, for JBS-720
	# 1. достаём все почтовые домены
	# 2. перебираем их, проверяем IP адреса
	# 3. при совпадении с удаляемым - проставляем почтовому домену шареш адрес
	$Request = Array(
			'authinfo'	=> $authinfo,
			'func'		=> 'emaildomain',
			'out'		=> 'xml',
			'su'		=> $Settings['UserLogin']
			);
	#-----------------------------------------------------------------------------
	$Response = Http_Send('/ispmgr',$Http,Array(),$Request);
	if(Is_Error($Response))
		return new gException('NOT_CONNECTED_TO_SERVER','Не удалось соедениться с сервером');
	#-----------------------------------------------------------------------------
	$Response = Trim($Response['Body']);
	#-----------------------------------------------------------------------------
	$XML = String_XML_Parse($Response);
	if(Is_Exception($XML))
		return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
	#-----------------------------------------------------------------------------
	$XML = $XML->ToArray('elem');
	#-----------------------------------------------------------------------------
	$Domains = $XML['doc'];
	#-----------------------------------------------------------------------------
	if(!Is_Array($Domains)){
		#-----------------------------------------------------------------------------
		Debug('[system/libs/IspManager5.php]: Почтовых доменов не обнаружено');
		#-----------------------------------------------------------------------------
	}else{
		#-----------------------------------------------------------------------------
		if(IsSet($Domains['error']))
			return new gException('GET_DOMAINS_ERROR',$Domains['error']);
		#-----------------------------------------------------------------------------
		foreach($Domains as $Domain){
			#-----------------------------------------------------------------------------
			$Request = Array(
					'authinfo'	=> $authinfo,
					'func'		=> 'emaildomain.edit',
					'elid'		=> $Domain['name'],
					'out'		=> 'xml',
					'su'		=> $Settings['UserLogin']
					);
			#-----------------------------------------------------------------------------
			$Response = Http_Send('/ispmgr',$Http,Array(),$Request);
			if(Is_Error($Response))
				return new gException('NOT_CONNECTED_TO_SERVER','Не удалось соедениться с сервером');
			#-----------------------------------------------------------------------------
			$Response = Trim($Response['Body']);
			#-----------------------------------------------------------------------------
			$XML = String_XML_Parse($Response);
			if(Is_Exception($XML))
				return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
			#-----------------------------------------------------------------------------
			$XML = $XML->ToArray();
			#-----------------------------------------------------------------------------
			$Doc = $XML['doc'];
			#-----------------------------------------------------------------------------
			if(IsSet($Doc['error']))
				return new gException('IspManager5_DeleteIP',SPrintF('Не удалось изменить IP для email домена %s',$Domain['name']));
			#-----------------------------------------------------------------------------
			if(IsSet($Doc['ip']) && $Doc['ip'] == $ExtraIP){
				#-----------------------------------------------------------------------------
                                # change settings
				$Request = Array(
						'authinfo'      => $authinfo,
						'out'           => 'xml',
						'func'          => 'emaildomain.edit',
						'sok'           => 'ok'
						);
				#-----------------------------------------------------------------------------
				foreach(Array_Keys($Doc) as $ParamID)
					$Request[$ParamID] = $Doc[$ParamID];
				#-----------------------------------------------------------------------------
				# change IP to shared
				$Request['ip']  = $Settings['IP'];
				#-----------------------------------------------------------------------------
				$Response = Http_Send('/ispmgr',$Http,Array(),$Request);
				if(Is_Error($Response))
					return ERROR | @Trigger_Error('[IspManager5_DeleteIP]: не удалось соедениться с сервером');
				#-----------------------------------------------------------------------------
				$Response = $Response['Body'];
				#-----------------------------------------------------------------------------
				$XML = String_XML_Parse($Response);
				#-----------------------------------------------------------------------------
				if(Is_Exception($XML))
					return ERROR | @Trigger_Error('[IspManager5_DeleteIP]: неверный ответ от сервера');
				#-----------------------------------------------------------------------------
				$XML = $XML->ToArray();
				#-----------------------------------------------------------------------------
				$Doc = $XML['doc'];
				#-----------------------------------------------------------------------------
				if(IsSet($Doc['error']))
					return new gException('IspManager5_DeleteIP',SPrintF('Не удалось изменить IP для email домена %s',$Domain['name']));
				#-----------------------------------------------------------------------------
			}
			#-----------------------------------------------------------------------------
		}
		#-----------------------------------------------------------------------------
	}
	#-----------------------------------------------------------------------------
	#-----------------------------------------------------------------------------
        # func=iplist.delete&elid=91.227.16.36
        $Request = Array(
                'authinfo'      => $authinfo,
                'func'          => 'iplist.delete',
                'out'           => 'xml',
                'elid'          => $ExtraIP,
                'sok'           => 'ok'
        );
        #Debug(var_export($Settings, true));
	#-----------------------------------------------------------------------------
	$Response = Http_Send('/ispmgr',$Http,Array(),$Request);
	if(Is_Error($Response))
		return ERROR | @Trigger_Error('[IspManager5_DeleteIP]: не удалось соедениться с сервером');
	#-----------------------------------------------------------------------------
        $Response = Trim($Response['Body']);
        $XML = String_XML_Parse($Response);
        if(Is_Exception($XML))
                return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
        #-----------------------------------------------------------------------------
        $XML = $XML->ToArray();
        #-----------------------------------------------------------------------------
        $Doc = $XML['doc'];
        #-----------------------------------------------------------------------------
        if(IsSet($Doc['error']))
                return new gException('DeleteIP_ERROR','Не удалось удалить IP у заказа хостинга');
        #-----------------------------------------------------------------------------
        #-----------------------------------------------------------------------------
	#-----------------------------------------------------------------------------
	return TRUE;
}
#-------------------------------------------------------------------------------
# added by lissyara 2013-03-07 in 13:47 MSK
#-------------------------------------------------------------------------------
function IspManager5_Get_CPU_Usage($Settings,$TFilter){
	/******************************************************************************/
        $__args_types = Array('array','string');
        $__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
	/******************************************************************************/
	$Version = IspManager5_Check_Version($Settings);
	#-------------------------------------------------------------------------------
	Debug(SPrintF('[IspManager5_Get_CPU_Usage]: ISPmanager = %s',$Version));
	#-------------------------------------------------------------------------------
	if($Version == 'Lite')
		return Array();
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	$authinfo = SPrintF('%s:%s',$Settings['Login'],$Settings['Password']);
	#-------------------------------------------------------------------------------
	$Http = IspManager5_Build_HTTP($Settings);
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	# достаём список пользователей/реселлеров
	$Response = Http_Send('/ispmgr',$Http,Array(),Array('authinfo'=>$authinfo,'out'=>'xml','func'=>'user'));
	if(Is_Error($Response))
		return new gException('NOT_CONNECTED_TO_SERVER','Не удалось соедениться с сервером');
	#-------------------------------------------------------------------------------
	$Response = Trim($Response['Body']);
	#-----------------------------------------------------------------------------
	$XML = String_XML_Parse($Response);
	if(Is_Exception($XML))
		return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
	#-----------------------------------------------------------------------------
	$XML = $XML->ToArray('elem');
	#-----------------------------------------------------------------------------
	$Elems = $XML['doc'];
	#-----------------------------------------------------------------------------
	if(IsSet($Elems['error']))
		return new gException('GET_USERS_ERROR',$Elems['error']);
	#-----------------------------------------------------------------------------
	$Resellers = Array();
	#-----------------------------------------------------------------------------
	if(Is_Array($Elems)){
		#-------------------------------------------------------------------------------
		foreach($Elems as $Elem)
			if(!In_Array($Elem['owner'],$Resellers))
				$Resellers[] = $Elem['owner'];
		#-------------------------------------------------------------------------------
	}
	#Debug(SPrintF('[system/libs/IspManager5.php]: Resellers = %s',print_r($Resellers,true)));
	#-----------------------------------------------------------------------------
	#-----------------------------------------------------------------------------
	$Owners = Array();
	#-----------------------------------------------------------------------------
	if(Is_Array($Elems)){
		#-------------------------------------------------------------------------------
		foreach($Elems as $Elem)
			if(In_Array($Elem['owner'],$Resellers))
				$Owners[$Elem['name']] = $Elem['owner'];
		#-------------------------------------------------------------------------------
	}
	#Debug(SPrintF('[system/libs/IspManager5.php]: Owners = %s',print_r($Owners,true)));
	#-------------------------------------------------------------------------------
	# /ispmgr?func=totalresourceusage&tfilter=2013-03-01%20-%202013-03-07&out=xml
	$Request = Array(
			'authinfo'	=> $authinfo,
			'func'		=> 'totalresourceusage',
			'out'		=> 'xml',
			'tfilter'	=> $TFilter
			);
	#-------------------------------------------------------------------------------
        $Response = Http_Send('/ispmgr',$Http,Array(),$Request);
        if(Is_Error($Response))
                return ERROR | @Trigger_Error('[IspManager5_Get_CPU_Usage]: не удалось соедениться с сервером');
	#-------------------------------------------------------------------------------
        $Response = Trim($Response['Body']);
	#-------------------------------------------------------------------------------
        $XML = String_XML_Parse($Response);
        if(Is_Exception($XML))
                return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
	#-------------------------------------------------------------------------------
	$XML = $XML->ToArray('elem');
	#-----------------------------------------------------------------------------
	$Elems = $XML['doc'];
	#-------------------------------------------------------------------------------
	if(IsSet($Elems['error']))
		return new gException('GET_TOTALRESOURCEUSAGE_ERROR',$Elems['error']);
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	# создаём выходной массив
	$Out = Array();
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	if(!Is_Array($Elems))
		return $Out;
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	# массив с полями
	$Fields = Array('memory','utime','stime','etime','io');
	#-------------------------------------------------------------------------------
	foreach($Resellers as $Reseller){
		#-------------------------------------------------------------------------------
		$Out[$Reseller] = Array();
		#-------------------------------------------------------------------------------
		foreach($Fields as $Key)
			$Out[$Reseller][$Key] = 0;
		#-------------------------------------------------------------------------------
	}
	#Debug(SPrintF('[system/libs/IspManager5.php]: Elem = %s',print_r($Out,true)));
	#-------------------------------------------------------------------------------
	# перебираем все данные по нагрузке
	foreach($Elems as $Elem){
		#-------------------------------------------------------------------------------
		if(Array_Key_Exists($Elem['account'], $Out)){
			#-------------------------------------------------------------------------------
			foreach($Fields as $Key)
				$Out[$Elem['account']][$Key] = $Out[$Elem['account']][$Key] + $Elem[$Key];
			#-------------------------------------------------------------------------------
		}else{
			#-------------------------------------------------------------------------------
			foreach($Fields as $Key)
				$Out[$Elem['account']][$Key] = $Elem[$Key];
			#-------------------------------------------------------------------------------
		}
		#-------------------------------------------------------------------------------
		if(IsSet($Owners[$Elem['account']]))
			foreach($Fields as $Key)
				$Out[$Owners[$Elem['account']]][$Key] = $Out[$Owners[$Elem['account']]][$Key] + $Elem[$Key];
		#------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	return $Out;
	#-------------------------------------------------------------------------------
}

# added by lissyara 2014-01-16 in 10:46 MSK, for JBS-764
#-----------------------------------------------------------------------------
#-------------------------------------------------------------------------------
function IspManager5_Get_Disk_Usage($Settings){
	/****************************************************************************/
	$__args_types = Array('array');
	#-----------------------------------------------------------------------------
	$__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
	/****************************************************************************/
	$authinfo = SPrintF('%s:%s',$Settings['Login'],$Settings['Password']);
	#-----------------------------------------------------------------------------
	$Http = IspManager5_Build_HTTP($Settings);
	#-----------------------------------------------------------------------------
	$Out = Array();
	#-----------------------------------------------------------------------------
	# перебираем функции
#	foreach(Array('user','reseller') as $Func){
	foreach(Array('user') as $Func){
		#-----------------------------------------------------------------------------
		$Response = Http_Send('/ispmgr',$Http,Array(),Array('authinfo'=>$authinfo,'out'=>'xml','func'=>$Func));
		if(Is_Error($Response))
			return new gException('NOT_CONNECTED_TO_SERVER','Не удалось соедениться с сервером');
		#-----------------------------------------------------------------------------
		$Response = Trim($Response['Body']);
		#-----------------------------------------------------------------------------
		$XML = String_XML_Parse($Response);
		if(Is_Exception($XML))
			return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
		#-----------------------------------------------------------------------------
		$XML = $XML->ToArray('elem');
		#-----------------------------------------------------------------------------
		$Users = $XML['doc'];
		#-----------------------------------------------------------------------------
		if(IsSet($Users['error']))
			return new gException('GET_USERS_ERROR',$Users['error']);
		#-----------------------------------------------------------------------------
		$Result = Array();
		#-----------------------------------------------------------------------------
		if(IsSet($Users) && Is_Array($Users)){
			#-----------------------------------------------------------------------------
			foreach($Users as $User){
				#---------------------------------------------------------------------------
				if(!IsSet($User['name']))
					continue;
				#-----------------------------------------------------------------------------
				if(!IsSet($User['quota_total']))
					$User['quota_total'] = -1;
				#-------------------------------------------------------------------------------
				if(!IsSet($User['quota_used']))
					$User['quota_used'] = -1;
				#-----------------------------------------------------------------------------
				$Out[$User['name']] = Array('Limit'=>$User['quota_total'],'Used'=>$User['quota_used'],'Disabled'=>(($User['active'] == 'on')?TRUE:FALSE));
				#-----------------------------------------------------------------------------
			}
			#-----------------------------------------------------------------------------
		}
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	return $Out;
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
}

#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------




#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# Функции используемые для внутреннего употребления =)
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
function IspManager5_Check_Version($Settings){
	/******************************************************************************/
	$__args_types = Array('array','string');
	$__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
	/******************************************************************************/
	$Http = IspManager5_Build_HTTP($Settings);
	#-------------------------------------------------------------------------------
	$authinfo = SPrintF('%s:%s',$Settings['Login'],$Settings['Password']);
	#-------------------------------------------------------------------------------
	# достаём информацию о лицензии
	$Response = Http_Send('/ispmgr',$Http,Array(),Array('authinfo'=>$authinfo,'out'=>'xml','func'=>'license.info'));
	if(Is_Error($Response))
		return new gException('NOT_CONNECTED_TO_SERVER','Не удалось соедениться с сервером');
	#-------------------------------------------------------------------------------
	$Response = Trim($Response['Body']);
	#-------------------------------------------------------------------------------
	$XML = String_XML_Parse($Response);
	if(Is_Exception($XML))
		return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
	#-------------------------------------------------------------------------------
	$XML = $XML->ToArray();
	#-------------------------------------------------------------------------------
	$Info = $XML['doc'];
	#-------------------------------------------------------------------------------
	if(IsSet($Info['error']))
		return new gException('GET_LICENSE_INFO_ERROR',$Info['error']);
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	return ((Preg_Match('/Lite/',$Info['mgr']))?'Lite':'Businnes');
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
}

#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
function IspManager5_Service_Restart($Settings,$Service){
	/******************************************************************************/
	$__args_types = Array('array','string');
	$__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
	/******************************************************************************/
	$Http = IspManager5_Build_HTTP($Settings);
	#-------------------------------------------------------------------------------
	$authinfo = SPrintF('%s:%s',$Settings['Login'],$Settings['Password']);
	#-------------------------------------------------------------------------------
	# достаём список сервисов
	$Response = Http_Send('/ispmgr',$Http,Array(),Array('authinfo'=>$authinfo,'out'=>'xml','func'=>'services'));
	if(Is_Error($Response))
		return new gException('NOT_CONNECTED_TO_SERVER','Не удалось соедениться с сервером');
	#-------------------------------------------------------------------------------
	$Response = Trim($Response['Body']);
	#-------------------------------------------------------------------------------
	$XML = String_XML_Parse($Response);
	if(Is_Exception($XML))
		return new gException('WRONG_SERVER_ANSWER',$Response,$XML);
	#-------------------------------------------------------------------------------
	$XML = $XML->ToArray('elem');
	#-------------------------------------------------------------------------------
	$Services = $XML['doc'];
	#-------------------------------------------------------------------------------
	if(IsSet($Services['error']))
		return new gException('GET_SERVCES_ERROR',$Services['error']);
	#-------------------------------------------------------------------------------
	#Debug(SPrintF('[IspManager5_Service_Restart]: Services = %s',print_r($Services,true)));
	#-------------------------------------------------------------------------------
	# проверяем наличие такого сервиса
	foreach(Array_Keys($Services) as $ParamID)
		if(IsSet($Services[$ParamID]['name']))
			if($Services[$ParamID]['name'] == $Service)
				$Exist = TRUE;
	#-------------------------------------------------------------------------------
	# рестартуем сервис, при наличии
	if(IsSet($Exist)){
		#-------------------------------------------------------------------------------
		$Request = Array('authinfo'=>$authinfo,'out'=>'xml','func'=>'services.restart','elid'=>$Service);
		#-------------------------------------------------------------------------------
		$Response = Http_Send('/ispmgr',$Http,Array(),$Request);
		if(Is_Error($Response))
			return ERROR | @Trigger_Error('[IspManager5_Create]: не удалось соедениться с сервером');
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	return TRUE;
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
}

#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
function IspManager5_Build_HTTP($Settings){
	/******************************************************************************/
	$__args_types = Array('array');
	$__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
	/******************************************************************************/
	$authinfo = SPrintF('%s:%s',$Settings['Login'],$Settings['Password']);
	#-------------------------------------------------------------------------------
	$Http = Array(
			'Address'	=> $Settings['Params']['IP'],
			'Port'		=> $Settings['Port'],
			'Host'		=> $Settings['Address'],
			'Protocol'	=> $Settings['Protocol'],
			'Hidden'	=> $authinfo,
			'IsLoggin'	=> FALSE
			);
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	return $Http;
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
}


?>
