<?php

#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('LinkID');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Links = &Links();
# Коллекция ссылок
$Template = &$Links[$LinkID];
/******************************************************************************/
/******************************************************************************/
if($Template['Source']['Count'] < 1)
  return FALSE;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Comp = Comp_Load(
  'Form/Input',
  Array(
    'onclick' => "AjaxCall('/API/InvoicesReject',FormGet(form),'Отмена счетов',\"GetURL(document.location);\");",
    'type'    => 'button',
    'value'   => 'Отменить'
  )
);
if(Is_Error($Comp))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Comp1 = Comp_Load(
  'Form/Input',
  Array(
    'onclick' => "AjaxCall('/API/InvoiceSetConditionally',FormGet(form),'Проведение условной оплаты',\"GetURL(document.location);\");",
    'type'    => 'button',
    'value'   => 'Провести условно',
    'prompt'  => 'Счёт зачисляется "условно". В течение месяца вы должны его оплатить. Услугами вы сможете пользоваться сейчас.'
  )
);
if(Is_Error($Comp1))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Span = new Tag('SPAN',$Comp,$Comp1);
#-------------------------------------------------------------------------------
$Table = Array(Array('Выбранные счета',$Span));
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Tables/Standard',$Table);
if(Is_Error($Comp))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return $Comp;
#-------------------------------------------------------------------------------

?>
