<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Params','Settings');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
/*
 * пришлось выносить в отдельный компонент.
 * варинатов как бы немного, смещать функцию в самый верх файла comp/www/Merchant/Tinkoff
 * при этом проверяя ей на существование, или отдельный компонент
 * внизу файла php функцию упорно не видит...
 *
 * */
//Debug(SPrintF('[comp/Invoices/TinkoffToken]: Params = %s',print_r($Params,true)));
#-------------------------------------------------------------------------------
// считаем токен
$Token = '';
#-------------------------------------------------------------------------------
// 2. Добавить в массив пару {Password, Значение пароля}. Пароль можно найти в личном кабинете Мерчанта
$Params['Password']     = $Settings['Password'];
#-------------------------------------------------------------------------------
KSort($Params);
#-------------------------------------------------------------------------------
foreach(Array_Keys($Params) as $Key)
	if(!Is_Array($Params[$Key]) && $Key != 'Token')
		$Token .= $Params[$Key];
#-------------------------------------------------------------------------------
Debug(SPrintF('[comp/Invoices/TinkoffToken]: Token = "%s"',$Token));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return Hash('sha256',$Token);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------



