<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args = Args();
#-------------------------------------------------------------------------------
$EdeskID = (integer) @$Args['EdeskID'];
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('modules/Authorisation.mod','classes/DOM.class')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Edesk = DB_Select('Edesks',Array('ID','Theme'),Array('UNIQ','ID'=>$EdeskID));
#-------------------------------------------------------------------------------
switch(ValueOf($Edesk)){
  case 'error':
    return ERROR | @Trigger_Error(500);
  case 'exception':
    return ERROR | @Trigger_Error(400);
  case 'array':
    #---------------------------------------------------------------------------
    $DOM = new DOM();
    #---------------------------------------------------------------------------
    $Links = &Links();
    # Коллекция ссылок
    $Links['DOM'] = &$DOM;
    #---------------------------------------------------------------------------
    if(Is_Error($DOM->Load('Window')))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $DOM->AddText('Title',$Edesk['Theme']);
    #---------------------------------------------------------------------------
    $Script = new Tag('SCRIPT',Array('type'=>'text/javascript','src'=>'SRC:{Js/Pages/EdeskMessageEdit.js}'));
    #---------------------------------------------------------------------------
    $DOM->AddChild('Head',$Script);
    #---------------------------------------------------------------------------
    $Table = Array();
    #---------------------------------------------------------------------------
    $Smiles = System_XML('config/Smiles.xml');
    if(Is_Error($Smiles))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Options = Array('NO'=>'Не выбран');
    #---------------------------------------------------------------------------
    foreach($Smiles as $Smile)
      $Options[$Smile['Pattern']] = $Smile['Name'];
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Form/Select',Array('name'=>'Smile','onchange'=>"if(value != 'NO'){ form.Message.value += value; }"),$Options);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Tr = new Tag('TR',new Tag('TD',Array('class'=>'Comment'),'Смайлики'),new Tag('TD',$Comp));
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Upload','EdeskMessageFile');
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Tr->AddChild(new Tag('NOBODY',new Tag('TD',Array('class'=>'Comment'),'Прикрепить файл'),new Tag('TD',$Comp)));
    #---------------------------------------------------------------------------
    $Table[] = new Tag('TABLE',$Tr);
    #---------------------------------------------------------------------------
    $Comp = Comp_Load(
      'Form/TextArea',
      Array(
        'name'  => 'Message',
        'style' => 'width:100%;',
        'rows'  => 10
      )
    );
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Table[] = $Comp;
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Edesks/Panel',Array('hidden'));
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Tr = new Tag('TR',$Comp);
    #---------------------------------------------------------------------------
    $Comp = Comp_Load(
      'Form/Input',
      Array(
        'type'    => 'button',
        'onclick' => 'EdeskMessageEdit();',
        'value'   => 'Добавить'
      )
    );
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Tr->AddChild(new Tag('TD',Array('align'=>'right'),$Comp));
    #---------------------------------------------------------------------------
    $Table[] = new Tag('TABLE',Array('width'=>'100%'),$Tr);
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Tables/Standard',$Table);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Form = new Tag('FORM',Array('name'=>'EdeskMessageEditForm','onsubmit'=>'return false;'),$Comp);
    #---------------------------------------------------------------------------
    $Comp = Comp_Load(
      'Form/Input',
      Array(
        'type'    => 'hidden',
        'name'    => 'EdeskID',
        'value'   => $Edesk['ID']
      )
    );
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Form->AddChild($Comp);
    #---------------------------------------------------------------------------
    $DOM->AddChild('Into',$Form);
    #---------------------------------------------------------------------------
    if(Is_Error($DOM->Build(FALSE)))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    return Array('Status'=>'Ok','DOM'=>$DOM->Object);
  default:
    return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------

?>
