<?php

#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args = Args();
#-------------------------------------------------------------------------------
$UserID = (integer) @$Args['UserID'];
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('modules/Authorisation.mod','classes/DOM.class.php')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Columns = Array(
			'ID','RegisterDate','Name','GroupID','Email','EmailConfirmed',
			'ICQ','Mobile','MobileConfirmed','Sign','OwnerID','IsManaged','LayPayMaxDays',
			'LayPayMaxSumm','LayPayThreshold','EnterDate','EnterIP',
			'Rating','IsActive','IsNotifies','IsHidden','IsProtected','AdminNotice',
			'(SELECT COUNT(*) FROM `OrdersOwners` WHERE `OrdersOwners`.`UserID`=`Users`.`ID`) AS `NumOrders`',
			'(SELECT COUNT(*) FROM `OrdersOwners` WHERE `OrdersOwners`.`UserID`=`Users`.`ID` AND `OrdersOwners`.`StatusID`="Active") AS `NumActiveOrders`',
			'(SELECT SUM(`Summ`) FROM `InvoicesOwners` WHERE `InvoicesOwners`.`UserID`=`Users`.`ID`) AS `TotalPayments`',
			'(SELECT SUM(`Summ`) FROM `InvoicesOwners` WHERE `InvoicesOwners`.`UserID`=`Users`.`ID` AND `InvoicesOwners`.`StatusID`="Payed") AS `SummPayments`',
		);
#-------------------------------------------------------------------------------
$User = DB_Select('Users',$Columns,Array('UNIQ','ID'=>$UserID));
#-------------------------------------------------------------------------------
switch(ValueOf($User)){
  case 'error':
    return ERROR | @Trigger_Error(500);
  case 'exception':
    return ERROR | @Trigger_Error(400);
  case 'array':
    #---------------------------------------------------------------------------
    $__USER = $GLOBALS['__USER'];
    #---------------------------------------------------------------------------
    $IsPermission = Permission_Check('UserRead',(integer)$__USER['ID'],(integer)$User['ID']);
    #---------------------------------------------------------------------------
    switch(ValueOf($IsPermission)){
      case 'error':
        return ERROR | @Trigger_Error(500);
      case 'exception':
        return ERROR | @Trigger_Error(400);
      case 'false':
        return new gException('USER_MANAGMENT_DISABLED','Просмотр информации запрещен');
      case 'true':
        #-----------------------------------------------------------------------
        $DOM = new DOM();
        #-----------------------------------------------------------------------
        $Links = &Links();
        # Коллекция ссылок
        $Links['DOM'] = &$DOM;
        #-----------------------------------------------------------------------
        if(Is_Error($DOM->Load('Window')))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $DOM->AddText('Title','Пользователь');
        #-----------------------------------------------------------------------
        $Table = Array('Общая информация');
        #-----------------------------------------------------------------------
        $Comp = Comp_Load('Formats/Date/Extended',$User['RegisterDate']);
        if(Is_Error($Comp))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $Table[] = Array('Дата регистрации',$Comp);
        #-----------------------------------------------------------------------
        $Table[] = Array('Имя',$User['Name']);
        #-----------------------------------------------------------------------
        $Sign = WordWrap($User['Sign'],100,"\n");
        #-----------------------------------------------------------------------
        $Table[] = Array('Подпись',new Tag('PRE',Array('class'=>'Standard'),$Sign?$Sign:'-'));
        #-----------------------------------------------------------------------
        $Table[] = 'Контактная информация';
        #-----------------------------------------------------------------------
	#-----------------------------------------------------------------------
        $Table[] = Array('Электронный адрес',$User['Email']);
	#-----------------------------------------------------------------------
	if($User['EmailConfirmed'] > 0){
		$Comp = Comp_Load('Formats/Date/Extended',$User['EmailConfirmed']);
		if(Is_Error($Comp))
			return ERROR | @Trigger_Error(500);
		$Table[] = Array('Email подтверждён',$Comp);
	}
        #-----------------------------------------------------------------------
	#-----------------------------------------------------------------------
        $Table[] = Array('ICQ-номер',$User['ICQ']);
        #-----------------------------------------------------------------------
        $Table[] = Array('Номер мобильного телефона',$User['Mobile']);
	#-------------------------------------------------------------------------------
	if($User['MobileConfirmed'] > 0){
		$Comp = Comp_Load('Formats/Date/Extended',$User['MobileConfirmed']);
		if(Is_Error($Comp))
			return ERROR | @Trigger_Error(500);
		$Table[] = Array('Телефон подтверждён',$Comp);
	}
        #-----------------------------------------------------------------------
        $OwnerID = $User['OwnerID'];
        #-----------------------------------------------------------------------
        if($OwnerID){
          #---------------------------------------------------------------------
          $Table[] = 'Партнерская программа';
          #---------------------------------------------------------------------
          $Owner = DB_Select('Users',Array('Name','Email'),Array('UNIQ','ID'=>$OwnerID));
          #---------------------------------------------------------------------
          switch(ValueOf($Owner)){
            case 'error':
              return ERROR | @Trigger_Error(500);
            case 'exception':
              return ERROR | @Trigger_Error(400);
            case 'array':
              #-----------------------------------------------------------------
              $Table[] = Array('Партнер',SPrintF('%s (%s)',$Owner['Name'],$Owner['Email']));
              #-----------------------------------------------------------------
              $Comp = Comp_Load('Formats/Logic',$User['IsManaged']);
              if(Is_Error($Comp))
                return ERROR | @Trigger_Error(500);
              #-----------------------------------------------------------------
              $Table[] = Array('Возможность управления',$Comp);
            break;
            default:
              return ERROR | @Trigger_Error(101);
          }
        }
        #-----------------------------------------------------------------------
        $Table[] = 'Условия отложенного платежа';
        #-----------------------------------------------------------------------
        $Table[] = Array('Максимальное кол-во дней',$User['LayPayMaxDays']);
        #-----------------------------------------------------------------------
        $Comp = Comp_Load('Formats/Currency',$User['LayPayMaxSumm']);
        if(Is_Error($Comp))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $Table[] = Array('Максимальная сумма',$Comp);
        #-----------------------------------------------------------------------
        $Comp = Comp_Load('Formats/Currency',$User['LayPayThreshold']);
        if(Is_Error($Comp))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $Table[] = Array('Пороговая сумма',$Comp);
	#-----------------------------------------------------------------------
	#-----------------------------------------------------------------------
	# JBS-348
	$Table[] = 'Активность пользователя';
	#-----------------------------------------------------------------------
	$Table[] = Array('Активных услуг',$User['NumActiveOrders']);
	#-----------------------------------------------------------------------
	$Comp = Comp_Load('Formats/Currency',$User['SummPayments']);
	if(Is_Error($Comp))
		return ERROR | @Trigger_Error(500);
	#-----------------------------------------------------------------------
	$Table[] = Array('Оплачено счетов на сумму',$Comp);
	#-----------------------------------------------------------------------
	if($User['NumOrders'] != $User['NumActiveOrders'])
		$Table[] = Array('Всего заказано услуг',$User['NumOrders']);
	#-----------------------------------------------------------------------
	$Comp = Comp_Load('Formats/Currency',$User['TotalPayments']);
	if(Is_Error($Comp))
		return ERROR | @Trigger_Error(500);
	#-----------------------------------------------------------------------
	if($User['TotalPayments'] != $User['SummPayments'])
		$Table[] = Array('Выписано счетов на сумму',$Comp);
	#-----------------------------------------------------------------------
	#-----------------------------------------------------------------------
	$Comp = Comp_Load('Formats/Currency',$User['SummPayments']);
	if(Is_Error($Comp))
		return ERROR | @Trigger_Error(500);
	#-----------------------------------------------------------------------
        #-----------------------------------------------------------------------
        $Table[] = 'Информация о работе в системе';
        #-----------------------------------------------------------------------
        $Comp = Comp_Load('Formats/Date/Extended',$User['EnterDate']);
        if(Is_Error($Comp))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $Table[] = Array('Дата последнего входа',$Comp);
        #-----------------------------------------------------------------------
        $Table[] = Array('IP-адрес последнего входа',$User['EnterIP']);
        #-----------------------------------------------------------------------
	#-----------------------------------------------------------------------
        $Table[] = 'Служебная информация';
        #-----------------------------------------------------------------------
        $Table[] = Array('Рейтинг',$User['Rating']);
        #-----------------------------------------------------------------------
        $Comp = Comp_Load('Formats/Logic',$User['IsActive']);
        if(Is_Error($Comp))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $Table[] = Array('Активный пользователь',$Comp);
        #-----------------------------------------------------------------------
        $Comp = Comp_Load('Formats/Logic',$User['IsNotifies']);
        if(Is_Error($Comp))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $Table[] = Array('Рассылать уведомления',$Comp);
        #-----------------------------------------------------------------------
        $Comp = Comp_Load('Formats/Logic',$User['IsHidden']);
        if(Is_Error($Comp))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $Table[] = Array('Скрытый пользователь',$Comp);
        #-----------------------------------------------------------------------
        $Comp = Comp_Load('Formats/Logic',$User['IsProtected']);
        if(Is_Error($Comp))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $Table[] = Array('Защищенный пользователь',$Comp);
        #-----------------------------------------------------------------------
	#-----------------------------------------------------------------------
	$Comp = Comp_Load(
			'Form/Input',
			Array(
				'type'    => 'button',
				'onclick' => SPrintF("ShowWindow('/Administrator/UserEdit',{UserID:'%u'});",$User['ID']),
				'value'   => 'Редактировать'
				)
			);
	#-----------------------------------------------------------------------
	if(Is_Error($Comp))
		return ERROR | @Trigger_Error(500);
	#-----------------------------------------------------------------------
	$Div = new Tag('DIV',Array('align'=>'right'),$Comp);
	#-----------------------------------------------------------------------
	$Table[] = $Div;
	#-----------------------------------------------------------------------
	#-----------------------------------------------------------------------
	$Comp = Comp_Load('Tables/Standard',$Table);
	if(Is_Error($Comp))
		return ERROR | @Trigger_Error(500);
	#-----------------------------------------------------------------------
	#-----------------------------------------------------------------------
        $DOM->AddChild('Into',$Comp);
        #-----------------------------------------------------------------------
        if(Is_Error($DOM->Build(FALSE)))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        return Array('Status'=>'Ok','DOM'=>$DOM->Object);
      default:
        return ERROR | @Trigger_Error(101);
    }
  default:
    return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------

?>
