<?php

#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args = Args();
#-------------------------------------------------------------------------------
$Eval =  (string) @$Args['Eval'];
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('classes/DOM.class.php')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
if(IsSet($GLOBALS['__USER'])){
  #-----------------------------------------------------------------------------
  $__USER = $GLOBALS['__USER'];
  #-----------------------------------------------------------------------------
  if(!SetCookie('OwnerID',$__USER['ID']))
    return ERROR | @Trigger_Error(500);
  #-----------------------------------------------------------------------------
  $_COOKIE['OwnerID'] = $__USER['ID'];
  #-----------------------------------------------------------------------------
  if(!SetCookie('IsManaged','yes'))
    return ERROR | @Trigger_Error(500);
  #-----------------------------------------------------------------------------
  $_COOKIE['IsManaged'] = 'yes';
}
#-------------------------------------------------------------------------------
$Links = &Links();
# Коллекция ссылок
#-------------------------------------------------------------------------------
$DOM = new DOM();
#-------------------------------------------------------------------------------
$Links['DOM'] = &$DOM;
#-------------------------------------------------------------------------------
if(Is_Error($DOM->Load(XML_HTTP_REQUEST?'Window':'Main')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$DOM->AddText('Title','Регистрация в биллинговой системе');
#-------------------------------------------------------------------------------
$Script = new Tag('SCRIPT',Array('type'=>'text/javascript','src'=>'SRC:{Js/Pages/UserRegister.js}'));
#-------------------------------------------------------------------------------
$DOM->AddChild('Head',$Script);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$DOM->AddChild('Head',new Tag('SCRIPT',Array('type'=>'text/javascript','src'=>'SRC:{Js/PasswordCheck.js}')));
#-------------------------------------------------------------------------------
$DOM->AddAttribs('Body',Array('onload'=>'PasswordMode();'));
#-------------------------------------------------------------------------------
$Form = new Tag('FORM',Array('name'=>'UserRegisterForm','onsubmit'=>'return false;'));
#-------------------------------------------------------------------------------
if($Eval){
  #-----------------------------------------------------------------------------
  $Comp = Comp_Load(
    'Form/Input',
    Array(
      'name'  => 'Eval',
      'type'  => 'hidden',
      'value' => $Eval
    )
  );
  if(Is_Error($Comp))
    return ERROR | @Trigger_Error(500);
  #-----------------------------------------------------------------------------
  $Form->AddChild($Comp);
}
#-------------------------------------------------------------------------------
$Table = Array();
#-------------------------------------------------------------------------------
if(IsSet($_COOKIE['OwnerID'])){
  #-----------------------------------------------------------------------------
  $OwnerID = $_COOKIE['OwnerID'];
  #-----------------------------------------------------------------------------
  if(IsSet($_COOKIE['IsManaged'])){
    #---------------------------------------------------------------------------
    $Owner = DB_Select('Users',Array('Email','Name'),Array('UNIQ','ID'=>$OwnerID));
    #---------------------------------------------------------------------------
    switch(ValueOf($Owner)){
      case 'error':
        return ERROR | @Trigger_Error(500);
      case 'exception':
        # No more...
      break;
      case 'array':
        $Table[] = Array('Партнер',SPrintF('%s (%s)',$Owner['Name'],$Owner['Email']));
      break;
      default:
        return ERROR | @Trigger_Error(101);
    }
  }
}
#-------------------------------------------------------------------------------
$Messages = Messages();
#-------------------------------------------------------------------------------
$Table[] = 'Параметры входа в систему';
#-------------------------------------------------------------------------------
$Comp = Comp_Load(
  'Form/Input',
  Array(
    'name'   => 'Email',
    'size'   => 25,
    'class'  => 'Duty',
    'prompt' => $Messages['Prompts']['Email'],
    'type'   => 'text'
  )
);
if(Is_Error($Comp))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Table[] = new Tag('TD',Array('width'=>430,'colspan'=>2,'class'=>'Standard','style'=>'background-color:#FDF6D3;'),'Пожалуйста, проверьте правильность электронного адреса, т.к. он будет являться основным каналом нашей связи с Вами, а так же будет использоваться Вами для входа в свой личный кабинет.');
#-------------------------------------------------------------------------------
$Table[] = Array(new Tag('NOBODY',new Tag('SPAN','Электронный адрес (логин)'),new Tag('BR'),new Tag('SPAN',Array('class'=>'Comment'),'Например: ivanov@ivanovich.ru')),$Comp);
#-------------------------------------------------------------------------------
$Password = SubStr(Md5(UniqID(Time())),0,8);
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Form/Input',Array('name'=>'IsPasswordCreate','value'=>$Password,'type'=>'checkbox','onclick'=>'PasswordMode();'));
if(Is_Error($Comp))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$NoBody = new Tag('NOBODY',new Tag('DIV',Array('style'=>'margin-bottom:5px;'),$Comp,new Tag('SPAN',Array('style'=>'font-size:10px; cursor:pointer;','onclick'=>'ChangeCheckBox(\'IsPasswordCreate\'); PasswordMode(); return false;'),'Вставить из примера')));
#-------------------------------------------------------------------------------
$Comp = Comp_Load(
  'Form/Input',
  Array(
    'name'   => 'Password',
    'size'   => 16,
    'class'  => 'Duty',
    'prompt' => $Messages['Prompts']['User']['Password'],
    'type'   => 'password'
  )
);
if(Is_Error($Comp))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$NoBody->AddChild($Comp);
#-------------------------------------------------------------------------------
$Table[] = Array(new Tag('NOBODY',new Tag('SPAN','Будущий пароль'),new Tag('BR'),new Tag('SPAN',Array('class'=>'Comment'),new Tag('SPAN',SPrintF('Например: %s',$Password)))),$NoBody);
#-------------------------------------------------------------------------------
$Comp = Comp_Load(
  'Form/Input',
  Array(
    'name'   => '_Password',
    'size'   => 16,
    'class'  => 'Duty',
    'prompt' => $Messages['Prompts']['User']['Password'],
    'type'   => 'password'
  )
);
if(Is_Error($Comp))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Table[] = Array(new Tag('NOBODY',new Tag('SPAN','Подтверждение пароля'),new Tag('BR'),new Tag('SPAN',Array('class'=>'Comment'),'Аналогично полю [Будущий пароль]')),$Comp);
#-------------------------------------------------------------------------------
$Table[] = 'Персональные данные';
#-------------------------------------------------------------------------------
$Comp = Comp_Load(
  'Form/Input',
  Array(
    'name'   => 'Name',
    'size'   => 25,
    'class'  => 'Duty',
    'prompt' => $Messages['Prompts']['User']['Name'],
    'type'   => 'text'
  )
);
if(Is_Error($Comp))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Table[] = Array(new Tag('NOBODY',new Tag('SPAN','Ваше имя'),new Tag('BR'),new Tag('SPAN',Array('class'=>'Comment'),'Например: Иван Иванович')),$Comp);
#-------------------------------------------------------------------------------
$Config = Config();
#-------------------------------------------------------------------------------
$Uin = $Config['IcqClient']['Uin'];
#-------------------------------------------------------------------------------
if($Config['Notifies']['Methods']['ICQ']['IsActive']){
  #-----------------------------------------------------------------------------
  $Td = new Tag('TD',Array('width'=>430,'colspan'=>2,'class'=>'Standard','style'=>'background-color:#FDF6D3;'),SPrintF('Если Вы хотите получать уведомления от нашей системы в режиме реального времени через ICQ, Вы можете указать в следующем поле свой номер. Пожалуйста, так же, добавьте в свой контактный лист номер нашего робота рассылки: %u.',$Uin));
  #-----------------------------------------------------------------------------
  $Table[] = $Td;
}
#-------------------------------------------------------------------------------
$Comp = Comp_Load(
  'Form/Input',
  Array(
    'name'   => 'ICQ',
    'size'   => 12,
    'prompt' => $Messages['Prompts']['ICQ'],
    'type'   => 'text'
  )
);
if(Is_Error($Comp))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Table[] = Array(new Tag('NOBODY',new Tag('SPAN','ICQ-номер'),new Tag('BR'),new Tag('SPAN',Array('class'=>'Comment'),'Например: 537213416')),$Comp);
#-------------------------------------------------------------------------------
$Img = new Tag('IMG',Array('id'=>'Protect','align'=>'left','width'=>80,'height'=>30,'alt'=>'Включите отображение картинок','src'=>SPrintF('/Protect?Rand=%u',Rand(1000,9999))));
#-------------------------------------------------------------------------------
$Comp = Comp_Load(
  'Form/Input',
  Array(
    'name'  => 'Protect',
    'size'  => 8,
    'class' => 'Duty',
    'type'  => 'text'
  )
);
if(Is_Error($Comp))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
if(!IsSet($GLOBALS['__USER']) && $_SERVER['REMOTE_ADDR'] != $_SERVER['SERVER_ADDR']){
  #-----------------------------------------------------------------------------
  $Table[] = 'Защита от автоматических регистраций';
  #-----------------------------------------------------------------------------
  $Table[] = Array(new Tag('NOBODY',new Tag('SPAN','Защитный код'),new Tag('BR'),new Tag('SPAN',Array('class'=>'Comment'),'Цифры на изображении')),new Tag('DIV',$Img,new Tag('SPAN',' = '),$Comp));
}
#-------------------------------------------------------------------------------
if(!IsSet($GLOBALS['__USER'])){
  #-----------------------------------------------------------------------------
  $Div = new Tag('DIV',Array('class'=>'Standard','align'=>'right'));
  #-------------------------------------------------------------------------------
  $Div->AddHTML(TemplateReplace('www.UserRegister'));
  #-------------------------------------------------------------------------------
  $Table[] = $Div;
}
#-------------------------------------------------------------------------------
$Comp = Comp_Load(
  'Form/Input',
  Array(
    'type'    => 'button',
    'onclick' => "if(PasswordCheck(this.form,'Password')) UserRegister();",
    'value'   => 'Регистрация',
  )
);
if(Is_Error($Comp))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Table[] = $Comp;
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Tables/Standard',$Table);
if(Is_Error($Comp))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Form->AddChild($Comp);
#-------------------------------------------------------------------------------
$DOM->AddChild('Into',$Form);
#-------------------------------------------------------------------------------
$Out = $DOM->Build(!XML_HTTP_REQUEST);
#-------------------------------------------------------------------------------
if(Is_Error($Out))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
return (XML_HTTP_REQUEST?Array('Status'=>'Ok','DOM'=>$DOM->Object):$Out);
#-------------------------------------------------------------------------------

?>
