<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args = Args();
#-------------------------------------------------------------------------------
$UserID = (integer) @$Args['UserID'];
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('modules/Authorisation.mod','classes/DOM.class')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$User = DB_Select('Users',Array('ID','RegisterDate','Name','GroupID','Email','EmailConfirmed','ICQ','Mobile','Sign','OwnerID','IsManaged','LayPayMaxDays','LayPayMaxSumm','LayPayThreshold','EnterDate','EnterIP','Rating','IsActive','IsNotifies','IsHidden','IsProtected','AdminNotice'),Array('UNIQ','ID'=>$UserID));
#-------------------------------------------------------------------------------
switch(ValueOf($User)){
  case 'error':
    return ERROR | @Trigger_Error(500);
  case 'exception':
    return ERROR | @Trigger_Error(400);
  case 'array':
    #---------------------------------------------------------------------------
    $__USER = $GLOBALS['__USER'];
    #---------------------------------------------------------------------------
    $IsPermission = Permission_Check('UserRead',(integer)$__USER['ID'],(integer)$User['ID']);
    #---------------------------------------------------------------------------
    switch(ValueOf($IsPermission)){
      case 'error':
        return ERROR | @Trigger_Error(500);
      case 'exception':
        return ERROR | @Trigger_Error(400);
      case 'false':
        return new gException('USER_MANAGMENT_DISABLED','Просмотр информации запрещен');
      case 'true':
        #-----------------------------------------------------------------------
        $DOM = new DOM();
        #-----------------------------------------------------------------------
        $Links = &Links();
        # Коллекция ссылок
        $Links['DOM'] = &$DOM;
        #-----------------------------------------------------------------------
        if(Is_Error($DOM->Load('Window')))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $DOM->AddText('Title','Пользователь');
        #-----------------------------------------------------------------------
        $Table = Array('Общая информация');
        #-----------------------------------------------------------------------
        $Comp = Comp_Load('Formats/Date/Extended',$User['RegisterDate']);
        if(Is_Error($Comp))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $Table[] = Array('Дата регистрации',$Comp);
        #-----------------------------------------------------------------------
        $Table[] = Array('Имя',$User['Name']);
        #-----------------------------------------------------------------------
        $Sign = WordWrap($User['Sign'],100,"\n");
        #-----------------------------------------------------------------------
        $Table[] = Array('Подпись',new Tag('PRE',Array('class'=>'Standard'),$Sign?$Sign:'-'));
        #-----------------------------------------------------------------------
        $Table[] = 'Контактная информация';
        #-----------------------------------------------------------------------
	#-----------------------------------------------------------------------
        $Table[] = Array('Электронный адрес',$User['Email']);
	#-----------------------------------------------------------------------
	if($User['EmailConfirmed'] > 0){
		$Comp = Comp_Load('Formats/Date/Extended',$User['EmailConfirmed']);
		if(Is_Error($Comp))
			return ERROR | @Trigger_Error(500);
		$Table[] = Array('Электронный адрес подтверждён',$Comp);
	}
        #-----------------------------------------------------------------------
	#-----------------------------------------------------------------------
        $Table[] = Array('ICQ-номер',$User['ICQ']);
        #-----------------------------------------------------------------------
        $Table[] = Array('Номер мобильного телефона',$User['Mobile']);
        #-----------------------------------------------------------------------
        $OwnerID = $User['OwnerID'];
        #-----------------------------------------------------------------------
        if($OwnerID){
          #---------------------------------------------------------------------
          $Table[] = 'Партнерская программа';
          #---------------------------------------------------------------------
          $Owner = DB_Select('Users',Array('Name','Email'),Array('UNIQ','ID'=>$OwnerID));
          #---------------------------------------------------------------------
          switch(ValueOf($Owner)){
            case 'error':
              return ERROR | @Trigger_Error(500);
            case 'exception':
              return ERROR | @Trigger_Error(400);
            case 'array':
              #-----------------------------------------------------------------
              $Table[] = Array('Партнер',SPrintF('%s (%s)',$Owner['Name'],$Owner['Email']));
              #-----------------------------------------------------------------
              $Comp = Comp_Load('Formats/Logic',$User['IsManaged']);
              if(Is_Error($Comp))
                return ERROR | @Trigger_Error(500);
              #-----------------------------------------------------------------
              $Table[] = Array('Возможность управления',$Comp);
            break;
            default:
              return ERROR | @Trigger_Error(101);
          }
        }
        #-----------------------------------------------------------------------
        $Table[] = 'Условия отложенного платежа';
        #-----------------------------------------------------------------------
        $Table[] = Array('Максимальное кол-во дней',$User['LayPayMaxDays']);
        #-----------------------------------------------------------------------
        $Comp = Comp_Load('Formats/Currency',$User['LayPayMaxSumm']);
        if(Is_Error($Comp))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $Table[] = Array('Максимальная сумма',$Comp);
        #-----------------------------------------------------------------------
        $Comp = Comp_Load('Formats/Currency',$User['LayPayThreshold']);
        if(Is_Error($Comp))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $Table[] = Array('Пороговая сумма',$Comp);
        #-----------------------------------------------------------------------
        $Table[] = 'Информация о работе в системе';
        #-----------------------------------------------------------------------
        $Comp = Comp_Load('Formats/Date/Extended',$User['EnterDate']);
        if(Is_Error($Comp))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $Table[] = Array('Дата последнего входа',$Comp);
        #-----------------------------------------------------------------------
        $Table[] = Array('IP-адрес последнего входа',$User['EnterIP']);
        #-----------------------------------------------------------------------
        $Table[] = 'Служебная информация';
        #-----------------------------------------------------------------------
        $Table[] = Array('Рейтинг',$User['Rating']);
        #-----------------------------------------------------------------------
        $Comp = Comp_Load('Formats/Logic',$User['IsActive']);
        if(Is_Error($Comp))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $Table[] = Array('Активный пользователь',$Comp);
        #-----------------------------------------------------------------------
        $Comp = Comp_Load('Formats/Logic',$User['IsNotifies']);
        if(Is_Error($Comp))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $Table[] = Array('Рассылать уведомления',$Comp);
        #-----------------------------------------------------------------------
        $Comp = Comp_Load('Formats/Logic',$User['IsHidden']);
        if(Is_Error($Comp))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $Table[] = Array('Скрытый пользователь',$Comp);
        #-----------------------------------------------------------------------
        $Comp = Comp_Load('Formats/Logic',$User['IsProtected']);
        if(Is_Error($Comp))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $Table[] = Array('Защищенный пользователь',$Comp);
        #-----------------------------------------------------------------------
        $Comp = Comp_Load('Tables/Standard',$Table);
        if(Is_Error($Comp))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        $DOM->AddChild('Into',$Comp);
        #-----------------------------------------------------------------------
        if(Is_Error($DOM->Build(FALSE)))
          return ERROR | @Trigger_Error(500);
        #-----------------------------------------------------------------------
        return Array('Status'=>'Ok','DOM'=>$DOM->Object);
      default:
        return ERROR | @Trigger_Error(101);
    }
  default:
    return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------

?>
