<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
if(Is_Error(System_Load('modules/Authorisation.mod','classes/DOM.class.php','libs/Upload.php')))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Config = Config();
#-------------------------------------------------------------------------------
$DOM = new DOM();
#-------------------------------------------------------------------------------
$Links = &Links();
# Коллекция ссылок
$Links['DOM'] = &$DOM;
#-------------------------------------------------------------------------------
if(Is_Error($DOM->Load('Window')))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$DOM->AddText('Title','Персональные данные');
#-------------------------------------------------------------------------------
$Script = new Tag('SCRIPT',Array('type'=>'text/javascript','src'=>'SRC:{Js/Pages/UserPersonalDataChange.js}'));
#-------------------------------------------------------------------------------
$DOM->AddChild('Head',$Script);
#-------------------------------------------------------------------------------
$__USER = $GLOBALS['__USER'];
#-------------------------------------------------------------------------------
$Messages = Messages();
#-------------------------------------------------------------------------------
$Table = Array('Общая информация');
#$Table = Array(new Tag('TD',Array('class'=>'Separator'),'Общая информация'));
#-------------------------------------------------------------------------------
$Comp = Comp_Load(
			'Form/Input',
			Array(
				'name'	=> 'Name',
				'type'	=> 'text',
				'prompt'=> $Messages['Prompts']['User']['Name'],
				'value'	=> $__USER['Name'],
				'style'	=> 'width: 100%'
				)
		);
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Table[] = Array(new Tag('TD',Array('colspan'=>2),'Ваше имя'),new Tag('TD',Array('colspan'=>3),$Comp));
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Form/TextArea',Array('name'=>'Sign','rows'=>3,'prompt'=>'bbcode: link, img, color, b, p, bg',),$__USER['Sign']);
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Table[] = Array(new Tag('TD',Array('colspan'=>2),'Подпись'),new Tag('TD',Array('colspan'=>3),$Comp));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Table[] = Array(new Tag('TD',Array('colspan'=>6,'class'=>'Separator'),'Ваши контактные данные'));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# TODO исправляем юзера - проверить что это реально надо, и надо тут
$Comp = Comp_Load('Tasks/RecoveryUsers',NULL,$__USER['ID']);
#-------------------------------------------------------------------------------
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# шапка контактов
$Tr = new Tag('TR');
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Tr->AddChild(new Tag('TD',Array('class'=>'Head','align'=>'center'),'*'));
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Formats/String','Тип контакта. Цветом обозначены неподтверждённые адреса',13);
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Tr->AddChild(new Tag('TD',Array('class'=>'Head','align'=>'center'),$Comp));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Tr->AddChild(new Tag('TD',Array('class'=>'Head','align'=>'center'),'Контакт'));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Formats/String','Логин для входа в биллинг',5);
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Tr->AddChild(new Tag('TD',Array('class'=>'Head','align'=>'center'),$Comp));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Formats/String','Уведомления для адреса - если включены, то на адрес будут приходить сообщения',5);
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Tr->AddChild(new Tag('TD',Array('class'=>'Head','align'=>'center'),$Comp));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Tr->AddChild(new Tag('TD',Array('class'=>'Head','align'=>'center'),'*'));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Table[] = $Tr;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# перебираем контакты юзера, выводим их
#-------------------------------------------------------------------------------
$Methods = $Config['Notifies']['Methods'];
#-------------------------------------------------------------------------------
foreach($__USER['Contacts'] as $Contact){
	#-------------------------------------------------------------------------------
	$Comp = Comp_Load('UserNotice','Contacts',$Contact['ID'],$Contact['UserNotice'],FALSE,'/UserPersonalDataChange');
	#-------------------------------------------------------------------------------
	if(Is_Error($Comp))
		return ERROR | @Trigger_Error(500);
	#-------------------------------------------------------------------------------
	if($Contact['IsPrimary']){
		#-------------------------------------------------------------------------------
		$OnClick = "ShowAlert('Этот адрес удалить нельзя, т.к. он используетс для входа в биллинг. Для удаления, вначале назначьте другой адрес в качестве логина','Warning')";
		#-------------------------------------------------------------------------------
	}else{
		#-------------------------------------------------------------------------------
		$OnClick = SPrintF("ShowConfirm('Вы подтверждаете удаление контакта?','ContactDelete(%s);');",$Contact['ID']);
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	$Table[] = Array(
			new Tag('TD',$Comp),
			new Tag('TD',Array('class'=>'Head','style'=>SPrintF('background:%s;',($Contact['Confirmed'])?'#D5F66C':'WhiteSmoke')),$Methods[$Contact['MethodID']]['Name']),
			new Tag('TD',Array('class'=>'Head'),new Tag('A',Array('href'=>SPrintF("javascript:ShowWindow('/ContactEdit?ContactID=%u');",$Contact['ID']),'title'=>'Кликните для изменения настроек контактного адреса'),$Contact['Address'])),
			new Tag('TD',Array('class'=>'Head','style'=>SPrintF('background:%s;',($Contact['IsPrimary'])?'#D5F66C':'WhiteSmoke')),($Contact['IsPrimary'])?'Да':'-'),
			new Tag('TD',Array('class'=>'Head','style'=>SPrintF('background:%s;',($Contact['IsActive'])?'#D5F66C':'WhiteSmoke')),($Contact['IsActive'])?'Да':'Нет'),
			new Tag('TD',Array('class'=>'Head'),new Tag('IMG',Array('class'=>'Button','onclick'=>$OnClick,'onmouseover'=>"PromptShow(event,'Удалить контактный адрес',this);",'src'=>'SRC:{Images/Icons/Flush.gif}')))
			);
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Form/Input',Array('type'=>'button','onclick'=>'javascript:ShowWindow(\'/ContactEdit\');','value'=>'Добавить адрес'));
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Table[] = Array(new Tag('TD',Array('colspan'=>6,'align'=>'right'),$Comp));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Table[] = Array(new Tag('TD',Array('colspan'=>6,'class'=>'Separator'),'Данные для участия в обсуждениях'));
#-------------------------------------------------------------------------------
$Foto = GetUploadedFileSize('Users',$__USER['ID']);
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Upload','UserFoto',$Foto?SPrintF('%01.2f Кб.',$Foto/1024):'не загружена');
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Table[] = Array(new Tag('TD',Array('colspan'=>2),'Аватар (90x110)'),new Tag('TD',Array('colspan'=>4),$Comp));
#-------------------------------------------------------------------------------
if($Foto){
	#-------------------------------------------------------------------------------
	$Comp = Comp_Load('Form/Input',Array('type'=>'checkbox','name'=>'IsClear','value'=>'yes')  );
	if(Is_Error($Comp))
		return ERROR | @Trigger_Error(500);
	#-------------------------------------------------------------------------------
	$Table[] = Array(new Tag('TD',Array('colspan'=>2),new Tag('SPAN',Array('style'=>'cursor:pointer;','onclick'=>'ChangeCheckBox(\'IsClear\'); return false;'),'Удалить фотографию')),new Tag('TD',Array('colspan'=>4),$Comp));
	#-------------------------------------------------------------------------------
	$Table[] = Array(new Tag('TD',Array('colspan'=>6,'align'=>'right'),new Tag('IMG',Array('src'=>SPrintF('/UserFoto?UserID=%u',$__USER['ID'])))));
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Form/Input',Array('type'=>'button','onclick'=>'UserPersonalDataChange();','value'=>'Сохранить'));
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Table[] = $Comp;
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Tables/Extended',$Table);
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Tab','User/Settings',new Tag('FORM',Array('name'=>'UserPersonalDataChangeForm','onsubmit'=>'return false;'),$Comp));
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$DOM->AddChild('Into',$Comp);
#-------------------------------------------------------------------------------
if(Is_Error($DOM->Build(FALSE)))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return Array('Status'=>'Ok','DOM'=>$DOM->Object);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------

?>
