<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Result = Array();
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
#if(!CacheManager::isEnabled())
#	return $Result;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Config = Config();
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Messengers = Array('Telegram','Viber','VKontakte');
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Array = Array();
#-------------------------------------------------------------------------------
// перебираем доступные методы - проверяем что контакты подтверждены
foreach(Array_Keys($Config['Notifies']['Methods']) as $MethodID){
	#-------------------------------------------------------------------------------
	// если метод не активен - пропускаем
	if(!$Config['Notifies']['Methods'][$MethodID]['IsActive'])
		continue;
	#-------------------------------------------------------------------------------
	// перебираем контакты пользователя
	foreach($GLOBALS['__USER']['Contacts'] as $Contact){
		#-------------------------------------------------------------------------------
		// сохраняем типы контактов которые есть у пользователя, для следующей стадии - надо ли просить добавить контакт такого типа
		if($Contact['MethodID'] == $MethodID)
			$Array[] = $MethodID;
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		if($Contact['MethodID'] == $MethodID && !$Contact['Confirmed'] && $Config['Interface']['User']['Notes'][$MethodID]['ConfirmRequire']){
			#-------------------------------------------------------------------------------
			$NoBody = new Tag('NOBODY');
			$NoBody->AddHTML(TemplateReplace('Notes.User.Confirmation', Array('Address'=>$Contact['Address'],'Method'=>$Config['Notifies']['Methods'][$MethodID])));
			$NoBody->AddChild(new Tag('STRONG', new Tag('A', Array('href' => SPrintF("javascript:ShowWindow('/ContactEdit?ContactID=%u');",$Contact['ID'])), '[Мои настройки]')));
			#-------------------------------------------------------------------------------
			$Result[] = $NoBody;
			#-------------------------------------------------------------------------------
		}
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// перебираем контакты пользователя, проверяем есть ли у него указанные Telegram/Viber/VKontakte
foreach($Array as $MethodID)
	if(In_Array($MethodID,$Messengers))
		$IM = TRUE;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// снова перебираем методы - проверяем - добавлены ли такие типы контактов у клиента
foreach(Array_Keys($Config['Notifies']['Methods']) as $MethodID){
	#-------------------------------------------------------------------------------
	Debug(SPrintF('[comp/Notes/User/AddressConfirmation]: MethodID = %s',$MethodID));
	#-------------------------------------------------------------------------------
	// если какой-то мессенджер задан, то ввод сотальных не требуем
	if(In_Array($MethodID,Array_Merge($Messengers,Array('Jabber'))) && IsSet($IM))
		continue;
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	// если у юзера есть контакт такого типа - пропускаем его
	if(In_Array($MethodID,$Array))
		continue;
	#-------------------------------------------------------------------------------
	Debug(SPrintF('[comp/Notes/User/AddressConfirmation]: need MethodID = %s',$MethodID));
	#-------------------------------------------------------------------------------
	// если требуется такой тип контакта - просим его ввести
        if($Config['Interface']['User']['Notes'][$MethodID]['Require']){
		#-------------------------------------------------------------------------------
		#Debug(SPrintF('[comp/Notes/User/AddressConfirmation]: need input MethodID = %s',$MethodID));
                #-------------------------------------------------------------------------------
                $NoBody = new Tag('NOBODY');
                $NoBody->AddHTML(TemplateReplace('Notes.User.Confirmation.NoAddress', Array('Method'=>$Config['Notifies']['Methods'][$MethodID])));
                $NoBody->AddChild(new Tag('STRONG', new Tag('A', Array('href' => SPrintF("javascript:ShowWindow('/ContactEdit?MethodID=%s');",$MethodID)), '[Мои настройки]')));
                #-------------------------------------------------------------------------------
                $Result[] = $NoBody;
                #-------------------------------------------------------------------------------
        }
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return $Result;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
?>
