<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Result = Array();
#-------------------------------------------------------------------------------
$Profiles = DB_Select('Profiles',Array('ID','Name'),Array('Where'=>SPrintF("`UserID` = @local.__USER_ID AND `StatusID` = 'OnFilling'")));
#-------------------------------------------------------------------------------
switch(ValueOf($Profiles)){
  case 'error':
    return ERROR | @Trigger_Error(500);
  case 'exception':
    # No more...
  break;
  case 'array':
    #---------------------------------------------------------------------------
    $Result = Array();
    #---------------------------------------------------------------------------
    foreach($Profiles as $Profile){
      #-------------------------------------------------------------------------
      $NoBody = new Tag('NOBODY');
#-------------------------------------------------------------------------------
$Parse = <<<EOD
<NOBODY>
 <SPAN>Обращаем Ваше внимание, что Ваш профиль </SPAN>
 <SPAN style="font-size:14px;font-weight:bold;">%s</SPAN>
 <SPAN> не заполнен полностью и в связи с этим мы не можем сформировать для Вас договор. Для того, чтобы заполнить профиль, пожалуйста, нажмите на кнопку</SPAN>
 <A style="font-size:14px;font-weight:bold;" href="javascript:ShowWindow('/ProfileEdit',{ProfileID:%u});">[заполнить]</A>
</NOBODY>
EOD;
#-------------------------------------------------------------------------------
      $NoBody->AddHTML(SPrintF($Parse,$Profile['Name'],$Profile['ID']));
      #-------------------------------------------------------------------------
      $Result[] = $NoBody;
    }
  break;
  default:
    return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
return $Result;
#-------------------------------------------------------------------------------


?>
