<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Args');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args = IsSet($Args)?$Args:Args();
#-------------------------------------------------------------------------------
$id		= (integer) @$Args['id'];
$elid		= (integer) @$Args['elid'];
$module		= (boolean) @$Args['module'];
$IP		=  (string) @$_SERVER['REMOTE_ADDR'];
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('libs/XXTEA.php')))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if($id < 1)
	return new gException('ID_NOT_SET','Не задан идентификатор лицензии');
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# ищщем в базе IP  с которого пришёл запрос, определяем VPS или DS на котором запущена лицензия
$Where = Array(SPrintF('`IP` = "%s"',$IP),'`StatusID` IN ("Active","OnCreate","SchemeChange","Suspended")');
#-------------------------------------------------------------------------------
$Order = DB_Select('VPSOrdersOwners',Array('ID','UserID'),Array('UNIQ','Where'=>$Where));
switch(ValueOf($Order)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	#-------------------------------------------------------------------------------
	#return new gException('VPS_NOT_FOUND','Заказ VPS не найден');
	#-------------------------------------------------------------------------------
	$Where = Array(SPrintF('`IP` = "%s" OR `ExtraIP` LIKE "%%%s%%"',$IP,$IP),'`StatusID` IN ("Active","OnCreate","SchemeChange","Suspended")');
	#-------------------------------------------------------------------------------
	$Order = DB_Select('DSOrdersOwners',Array('ID','UserID'),Array('UNIQ','Where'=>$Where));
	#-------------------------------------------------------------------------------
	switch(ValueOf($Order)){
	case 'error':
		return ERROR | @Trigger_Error(500);
	case 'exception':
		return new gException('VPS_NOT_FOUND','Заказ VPS/DS не найден');
	case 'array':
		break;
	default:
		return ERROR | @Trigger_Error(101);
	}
	#-------------------------------------------------------------------------------
	break;
	#-------------------------------------------------------------------------------
case 'array':
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# если ничего не найдено, надо посмотреть по лицензии

#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# TODO надо вытянуть номерки автосоздаваемых тарифов, и юзать их заказы
#-------------------------------------------------------------------------------
# по юзеру, которому принадлежит VPS находим заказы на DNSmanager
$DNSmanagerOrders = DB_Select('DNSmanagerOrdersOwners',Array('*','(SELECT `Address` FROM `Servers` WHERE `Servers`.`ID` = `ServerID`) AS `Address`'),Array('Where'=>SPrintF('`UserID` = %u',$Order['UserID']),'IsDesc'=>TRUE,'SortOn'=>'ID'));
#-------------------------------------------------------------------------------
switch(ValueOf($DNSmanagerOrders)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return new gException('DNS_NOT_FOUND','Заказ на вторичные DNS не найдены');
case 'array':
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# выбираем все заказы относящися к разным DNS серверам
$Servers = Array();
#-------------------------------------------------------------------------------
foreach($DNSmanagerOrders as $DNSmanagerOrder)
	if(!IsSet($Servers[$DNSmanagerOrder['ServerID']]))
		$Servers[$DNSmanagerOrder['ServerID']] = $DNSmanagerOrder;
#-------------------------------------------------------------------------------
#Debug(SPrintF('[comp/www/API/ISPswSettingURL]: Servers = %s',print_r($Servers,true)));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# выдаём данные DNSmanager в ответе
$XML = '<func name="slaveserver.edit"><arg name="username">%s</arg><arg name="password">%s</arg><arg name="url">%s</arg></func>';
#-------------------------------------------------------------------------------
$Array = Array();
#-------------------------------------------------------------------------------
foreach($Servers as $Server)
	$Array[] = SPrintF($XML,$Server['Login'],$Server['Password'],$Server['Address']);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Out = SPrintF('<?xml version="1.0" encoding="UTF-8"?><doc>%s</doc>',Implode('',$Array));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$License = DB_Select('ISPswLicenses',Array('LicKey'),Array('UNIQ','Where'=>SPrintF('`elid` = %u',$id)));
switch(ValueOf($License)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return new gException('LICENSE_NOT_FOUND','Лицензия не найдена');
case 'array':
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
echo Bin2Hex(xxtea_encrypt($Out,$License['LicKey']));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
?>
