<?php

#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('LinkID');
/******************************************************************************/
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Links = &Links();
# Коллекция ссылок
$Template = &$Links[$LinkID];
/******************************************************************************/
/******************************************************************************/
$Tr = new Tag('TR');
#-------------------------------------------------------------------------------
$DSSchemes = DB_Select('DSSchemes',Array('ID','Name','CostMonth','(SELECT `Name` FROM `ServersGroups` WHERE (SELECT `ServersGroupID` FROM `Servers` WHERE `Servers`.`ID` = `DSSchemes`.`ServerID`)) as `ServersGroupName`'),Array('SortOn'=>'Name'));
#-------------------------------------------------------------------------------
switch(ValueOf($DSSchemes)){
  case 'error':
    return ERROR | @Trigger_Error(500);
  case 'exception':
    # No more...
  break;
  case 'array':
    #---------------------------------------------------------------------------
    $Options = Array();
    #---------------------------------------------------------------------------
    $Options['Default'] = 'Не указан';
    #---------------------------------------------------------------------------
    foreach($DSSchemes as $DSScheme){
      #-------------------------------------------------------------------------
      $Comp = Comp_Load('Formats/Currency',$DSScheme['CostMonth']);
      if(Is_Error($Comp))
        return ERROR | @Trigger_Error(500);
      #-------------------------------------------------------------------------
      $Options[$DSScheme['ID']] = SPrintF('%s, %s, %s',$DSScheme['Name'],$DSScheme['ServersGroupName'],$Comp);
    }
    #---------------------------------------------------------------------------
    $SchemeID = 'Default';
    #---------------------------------------------------------------------------
    $Session = &$Template['Session'];
    #---------------------------------------------------------------------------
    if(IsSet($Session['SchemeID']))
      $SchemeID = $Session['SchemeID'];
    #---------------------------------------------------------------------------
    $Args = Args();
    #---------------------------------------------------------------------------
    if(IsSet($Args['SchemeID']))
      $SchemeID = $Args['SchemeID'];
    #---------------------------------------------------------------------------
    $Session['SchemeID'] = $SchemeID;
    #---------------------------------------------------------------------------
    $AddingWhere = &$Template['Source']['Adding']['Where'];
    #---------------------------------------------------------------------------
    if($SchemeID != 'Default')
      $AddingWhere[] = SPrintF('`SchemeID` = %u',$SchemeID);
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Form/Select',Array('name'=>'SchemeID','onchange'=>'TableSuperReload();'),$Options,$SchemeID);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Tr->AddChild(new Tag('NOBODY',new Tag('TD',Array('class'=>'Comment'),'Тарифный план'),new Tag('TD',$Comp)));
  break;
  default:
    return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
$DSServers = DB_Select('DSServers',Array('ID','Address'),Array('SortOn'=>'Address'));
#-------------------------------------------------------------------------------
switch(ValueOf($DSServers)){
  case 'error':
    return ERROR | @Trigger_Error(500);
  case 'exception':
    # No more...
  break;
  case 'array':
    #---------------------------------------------------------------------------
    $Table = $Options = Array();
    #---------------------------------------------------------------------------
    $Options['Default'] = 'Не указан';
    #---------------------------------------------------------------------------
    foreach($DSServers as $DSServer)
      $Options[$DSServer['ID']] = $DSServer['Address'];
    #---------------------------------------------------------------------------
    $ServerID = 'Default';
    #---------------------------------------------------------------------------
    $Session = &$Template['Session'];
    #---------------------------------------------------------------------------
    if(IsSet($Session['ServerID']))
      $ServerID = $Session['ServerID'];
    #---------------------------------------------------------------------------
    $Args = Args();
    #---------------------------------------------------------------------------
    if(IsSet($Args['ServerID']))
      $ServerID = $Args['ServerID'];
    #---------------------------------------------------------------------------
    $Session['ServerID'] = $ServerID;
    #---------------------------------------------------------------------------
    $AddingWhere = &$Template['Source']['Adding']['Where'];
    #---------------------------------------------------------------------------
    if($ServerID != 'Default')
      $AddingWhere[] = SPrintF('`ServerID` = %u',$ServerID);
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Form/Select',Array('name'=>'ServerID','onchange'=>'TableSuperReload();'),$Options,$ServerID);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Tr->AddChild(new Tag('NOBODY',new Tag('TD',Array('class'=>'Comment'),'Сервер размещения'),new Tag('TD',$Comp)));
  break;
  default:
    return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
if(!Count($Tr->Childs))
  return FALSE;
#-------------------------------------------------------------------------------
return new Tag('TABLE',Array('class'=>'Standard','cellspacing'=>5),$Tr);
#-------------------------------------------------------------------------------

?>
