<?php
#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
#-------------------------------------------------------------------------------
//if(!Define('COMP_INIT',Base64_Decode('DQokX19hcmdzX18gPSBBcnJheV9TbGljZShGdW5jX0dldF9BcmdzKCksMik7DQppZihJc1NldCgkX19hcmdzX2xpc3QpKXsNCiAgZm9yKCRpPTA7JGk8Q291bnQoJF9fYXJnc19saXN0KTskaSsrKQ0KICAgICR7JF9fYXJnc19saXN0WyRpXX0gPSAoSXNTZXQoJF9fYXJnc19fWyRpXSk/JF9fYXJnc19fWyRpXTpOVUxMKTsNCn0=')))
if(!Define('COMP_INIT',Base64_Decode('aWYoSXNTZXQoJF9fYXJnc19saXN0KSl7DQogIGZvcigkaT0wOyRpPENvdW50KCRfX2FyZ3NfbGlzdCk7JGkrKykNCiAgICAkeyRfX2FyZ3NfbGlzdFskaV19ID0gKElzU2V0KCRfX2FyZ3NfX1skaV0pPyRfX2FyZ3NfX1skaV06TlVMTCk7DQp9')))
  Exit('Не удалось определить константу инициализации компонентов');
#-------------------------------------------------------------------------------
if(!Define('COMP_ALL_HOSTS',UniqID('ID')))
  Exit('Не удалось определить константу загрузки всех хостов');
/*------------------------------------------------------------------------------
      Задача:
Создать возможность использования компонентов. Все компоненты расположены в
папке "HOST_NAME/comp".
Компонент - это PHP файл, принимающий параметры и выполняющий определённые
действия.
------------------------------------------------------------------------------*/
function Comp_Load($Element){
  /****************************************************************************/
  $__args_types = Array('string','*');
  #-----------------------------------------------------------------------------
  $__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
  /****************************************************************************/
  $HostsIDs = System_HostsIDs(SPrintF('comp/%s.comp.php',$Element));
  if(Is_Error($HostsIDs))
    return ERROR | @Trigger_Error('[Comp_Load]: не возможно найти компонент');
  #-----------------------------------------------------------------------------
  $IsCascade = In_Array(COMP_ALL_HOSTS,$__args__,TRUE);
  #-----------------------------------------------------------------------------
  if($IsCascade)
    $HostsIDs = Array_Reverse($HostsIDs);
  #-----------------------------------------------------------------------------
  $Result = Array();
  #-----------------------------------------------------------------------------
  foreach($HostsIDs as $HostID){
    #---------------------------------------------------------------------------
    $Path = SPrintF('%s/hosts/%s/comp/%s.comp.php',SYSTEM_PATH,$HostID,$Element);
    #---------------------------------------------------------------------------
    if(Is_Dir($Path))
      return ERROR | @Trigger_Error('[Comp_Load]: объект не является компонентом');
    #---------------------------------------------------------------------------
    $Args = $__args__;
    #---------------------------------------------------------------------------
    Array_UnShift($Args,$Path);
    #---------------------------------------------------------------------------
    $Comp = Call_User_Func_Array('LoadComp',$Args);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error('[Comp_Load]: не возможно загрузить компонент');
    #---------------------------------------------------------------------------
    if($IsCascade)
      $Result[] = $Comp;
    else{
      #-------------------------------------------------------------------------
      $Result = $Comp;
      #-------------------------------------------------------------------------
      break;
    }
  }
  #-----------------------------------------------------------------------------
  $Loaded = &Link_Get('Comp/Loaded','array');
  #-----------------------------------------------------------------------------
  $Loaded[] = $Element;
  #-----------------------------------------------------------------------------
  return $Result;
}
/*------------------------------------------------------------------------------
      Задача:
Проверить загружался ли компонент в систему.
------------------------------------------------------------------------------*/
function Comp_IsLoaded($Path){
  /****************************************************************************/
  $__args_types = Array('string');
  #-----------------------------------------------------------------------------
  $__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
  /****************************************************************************/
  $Loaded = &Link_Get('Comp/Loaded','array');
  #-----------------------------------------------------------------------------
  return In_Array($Path,$Loaded);
}
//****************************************************************************//
?>
