<?php
#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
#-------------------------------------------------------------------------------
if(!Extension_Loaded('mcrypt'))
  $GLOBALS['__MESSAGES'][] = 'Модуль mcrypt не установлен. Функции шифрования могут работать не правильно. Пожалуйста, исправьте ошибку.';
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
function Crypt_Encode($String){
  /****************************************************************************/
  $__args_types = Array('string');
  #-----------------------------------------------------------------------------
  $__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
  /****************************************************************************/
  if(Extension_Loaded('mcrypt')){
    #---------------------------------------------------------------------------
    $Module = &Link_Get('Crypt');
    #---------------------------------------------------------------------------
    if(!Is_Resource($Module)){
      #-------------------------------------------------------------------------
      $Module = @MCrypt_Module_Open(MCRYPT_DES,'',MCRYPT_MODE_ECB,'');
      if(!Is_Resource($Module))
        return ERROR | @Trigger_Error('[Crypt_Encode]: не удалось открыть дескриптор');
      #-------------------------------------------------------------------------
      $Iv = @MCrypt_Create_Iv(MCrypt_Enc_Get_Iv_Size($Module),MCRYPT_RAND);
      if(!$Iv)
        return ERROR | @Trigger_Error('[Crypt_Encode]: не удалось создать IV');
      #-------------------------------------------------------------------------
      $Key = SubStr(HOST_ID,0,MCrypt_Enc_Get_Key_Size($Module));
      #-------------------------------------------------------------------------
      $IsInit = @MCrypt_Generic_Init($Module,$Key,$Iv);
      if(!Is_Integer($IsInit))
        return ERROR | @Trigger_Error('[Crypt_Encode]: не удалось инициализовать модуль шифрования');
    }
    #---------------------------------------------------------------------------
    $String = @MCrypt_Generic($Module,$String);
    if(!Is_String($String))
      return ERROR | @Trigger_Error('[Crypt_Encode]: не удалось зашифровать данные');
  }
  #-----------------------------------------------------------------------------
  return Base64_Encode($String);
}
#-------------------------------------------------------------------------------
function Crypt_Decode($String){
  /****************************************************************************/
  $__args_types = Array('string');
  #-----------------------------------------------------------------------------
  $__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
  /****************************************************************************/
  $String = Base64_Decode($String);
  #-----------------------------------------------------------------------------
  if (Empty($String)) { return $String; }
  #-----------------------------------------------------------------------------
  if(Extension_Loaded('mcrypt')){
    #---------------------------------------------------------------------------
    $Module = &Link_Get('Crypt');
    #---------------------------------------------------------------------------
    if(!Is_Resource($Module)){
      #-------------------------------------------------------------------------
      $Module = @MCrypt_Module_Open(MCRYPT_DES,'',MCRYPT_MODE_ECB,'');
      if(!Is_Resource($Module))
        return ERROR | @Trigger_Error('[Crypt_Decode]: не удалось открыть дескриптор');
      #-------------------------------------------------------------------------
      $Iv = @MCrypt_Create_Iv(MCrypt_Enc_Get_Iv_Size($Module),MCRYPT_RAND);
      if(!$Iv)
        return ERROR | @Trigger_Error('[Crypt_Decode]: не удалось создать IV');
      #-------------------------------------------------------------------------
      $Key = SubStr(HOST_ID,0,MCrypt_Enc_Get_Key_Size($Module));
      #-------------------------------------------------------------------------
      $IsInit = @MCrypt_Generic_Init($Module,$Key,$Iv);
      if(!Is_Integer($IsInit))
        return ERROR | @Trigger_Error('[Crypt_Decode]: не удалось инициализовать модуль дешифрования');
    }
    #---------------------------------------------------------------------------
    $String = @MDecrypt_Generic($Module,$String);
    if(!Is_String($String))
      return ERROR | @Trigger_Error('[Crypt_Decode]: не удалось дешифровать данные');
    #---------------------------------------------------------------------------
    $String = Trim($String);
  }
  #-----------------------------------------------------------------------------
  return $String;
}
#-------------------------------------------------------------------------------
?>
