<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Config = Config();
#-------------------------------------------------------------------------------
$Settings = $Config['Tasks']['Types']['DSForDelete'];
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# достаём время выполнения
$ExecuteTime = Comp_Load('Formats/Task/ExecuteTime',Array('ExecuteTime'=>$Settings['ExecuteTime'],'ExecuteDays'=>@$Settings['ExecuteDays'],'DefaultTime'=>MkTime(1,10,0,Date('n'),Date('j')+1,Date('Y'))));
if(Is_Error($ExecuteTime))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
if(!$Settings['IsActive'])
	return $ExecuteTime;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$DeleteTimeout = $Config['Tasks']['Types']['DSForDelete']['DeleteTimeout'] * 24 * 3600;
#-------------------------------------------------------------------------------
$Where = Array('`StatusID` = "Suspended"',SPrintF('`StatusDate` + %u - UNIX_TIMESTAMP() <= 0',$DeleteTimeout));
#-------------------------------------------------------------------------------
$DSOrders = DB_Select('DSOrders','ID',Array('Where'=>$Where));
#-------------------------------------------------------------------------------
switch(ValueOf($DSOrders)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	# No more...
	break;
case 'array':
	#-------------------------------------------------------------------------------
	$GLOBALS['TaskReturnInfo'] = Array('Deleted'=>Array(SizeOf($DSOrders)));
	#-------------------------------------------------------------------------------
	foreach($DSOrders as $DSOrder){
		#-------------------------------------------------------------------------------
		/* заказ выделенного сервера, нельзя просто удалить - он снова будет доступен для заказа.
		необходимо удалить данные с дисков, сменить пароли IPMI/iLO и т.п... 
		поэтому статус при удалении - OnService, а не Deleted */
		$Comp = Comp_Load('www/API/StatusSet',Array('ModeID'=>'DSOrders','StatusID'=>'OnService','RowsIDs'=>$DSOrder['ID'],'Comment'=>'Срок блокировки заказа окончен'));
		#-------------------------------------------------------------------------------
		switch(ValueOf($Comp)){
		case 'error':
			return ERROR | @Trigger_Error(500);
		case 'exception':
			return ERROR | @Trigger_Error(400);
		case 'array':
			# No more...
			break;
		default:
			return ERROR | @Trigger_Error(101);
		}
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	break;
	#-------------------------------------------------------------------------------
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return $ExecuteTime;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------

?>
