<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Config = Config();
#-------------------------------------------------------------------------------
$Settings = $Config['Tasks']['Types']['ServerAccountsResources'];
#-------------------------------------------------------------------------------
/*
$ExecuteTime = Comp_Load('Formats/Task/ExecuteTime',Array('ExecutePeriod'=>$Settings['ExecutePeriod']));
if(Is_Error($ExecuteTime))
	return ERROR | @Trigger_Error(500);
	*/
#-------------------------------------------------------------------------------
if(!$Settings['IsActive'])
	return 3600;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('classes/HostingServer.class.php','classes/VPSServer.class.php','classes/DSServer.class.php')))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Where = Array(
		'`Services`.`ID` = `ServersGroups`.`ServiceID`',
		'(`ServersGroups`.`ID` = `Servers`.`ServersGroupID`)',
		'(SELECT `ServiceID` FROM `ServersGroups` WHERE `Servers`.`ServersGroupID` = `ServersGroups`.`ID`) IN(10000,30000,40000,52000)',
		);
#-------------------------------------------------------------------------------
$Columns = Array(
		'`Servers`.`ID`','Address','`Servers`.`IsActive`','`Servers`.`Params`','`ServersGroups`.`SortID` AS `ServersGroupsSortID`',
		'(SELECT `Name` FROM `ServersGroups` WHERE `ServersGroups`.`ID` = `Servers`.`ServersGroupID`) AS `Name`',
		'(SELECT `Code` FROM `Services` WHERE `Services`.`ID` = `ServersGroups`.`ServiceID`) AS `Code`',
		);
#-------------------------------------------------------------------------------
$Servers = DB_Select(Array('Servers','ServersGroups','Services'),$Columns,Array('Where'=>$Where,'SortOn'=>Array('ServersGroupsSortID','Address')));
#-------------------------------------------------------------------------------
switch(ValueOf($Servers)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return Time() + 1200;
case 'array':
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Array = Array();
#-------------------------------------------------------------------------------
foreach($Servers as $Server){
	#-------------------------------------------------------------------------------
	//if($Server['Address'] != 'kvm.host-food.ru')
	//	continue;
	#-------------------------------------------------------------------------------
	if(!$Server['IsActive'])
		continue;
	#-------------------------------------------------------------------------------
	// осталяем услуги с ресурсами - хостинг, ВПС, выделенные
	if(!In_Array($Server['Code'],Array('Hosting','VPS','DS')))
		continue;
	#-------------------------------------------------------------------------------
	# если время последнего опроса задано, и с тех пор прошло меньше 30 минут - пропускаем
	if(IsSet($Server['Params']['LastResourcesQuestioning']) && $Server['Params']['LastResourcesQuestioning'] > Time() - 1800)
		continue;
	#-------------------------------------------------------------------------------
	Debug(SPrintF('[comp/Tasks/ServerAccountsResources]: необходимо опросить сервер %s/%s/%s',$Server['Code'],$Server['Name'],$Server['Address']));
	#-------------------------------------------------------------------------------
	$Array[] = $Server;
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
if(SizeOf($Array) < 1){
	#-------------------------------------------------------------------------------
	Debug(SPrintF('[comp/Tasks/ServerAccountsResources]: все сервера опрошены'));
	#-------------------------------------------------------------------------------
	return Time() + 1200;
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
Debug(SPrintF('[comp/Tasks/ServerAccountsResources]: необходимо опросить серверов: %u',SizeOf($Array)));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$GLOBALS['TaskReturnInfo'] = Array();
#-------------------------------------------------------------------------------
$Server = Current($Array);
#-------------------------------------------------------------------------------
if(Is_Null($Server['Name']))
	$Server['Name'] = 'NoGroup';
#-------------------------------------------------------------------------------
if(!IsSet($GLOBALS['TaskReturnInfo'][$Server['Name']]))
	$GLOBALS['TaskReturnInfo'][$Server['Name']] = Array();
#-------------------------------------------------------------------------------
$GLOBALS['TaskReturnInfo'][$Server['Name']][] = $Server['Address'];
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$ClassName = SPrintF('%sServer',$Server['Code']);
#-------------------------------------------------------------------------------
$ClassServer = new $ClassName();
#-------------------------------------------------------------------------------
$IsSelected = $ClassServer->Select((integer)$Server['ID']);
#-------------------------------------------------------------------------------
switch(ValueOf($IsSelected)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return ERROR | @Trigger_Error(400);
case 'true':
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// используемые ресурсы 
if(In_Array($Server['Code'],Array('Hosting','VPS','DS'))){
	#-------------------------------------------------------------------------------
	// достаём список выделенных серверов на этом управляющем сервере
	$Columns = Array(
			'OrderID','(SELECT `Code` FROM `Services` WHERE `ID` = `OrdersOwners`.`ServiceID`) AS `Code`',
			"(SELECT `Params` FROM `TmpData` WHERE `AppID` = 'Order.Statistics' AND `OrdersOwners`.`OrderID` = `TmpData`.`Col1` LIMIT 1) AS `Params`"
			);
	$Orders = DB_Select('OrdersOwners',$Columns,Array('Where'=>Array('`StatusID` IN ("Active","Suspended")',SPrintF('`ServerID` = %u',$Server['ID']))));
	#-------------------------------------------------------------------------------
	switch(ValueOf($Orders)){
	case 'error':
		return ERROR | @Trigger_Error(500);
	case 'exception':
		break;
	case 'array':
		#-------------------------------------------------------------------------------
		$Array = $Array1 = Array();
		#-------------------------------------------------------------------------------
		if(In_Array($Server['Code'],Array('DS'))){
			#-------------------------------------------------------------------------------
			// проверяем у выделенных серверов поле Params['UpdateDate'], когда обновлялись графики
			// если находим сервер где не обновлялись - обновляем его. одного
			foreach($Orders as $Order){
				#-------------------------------------------------------------------------------
				//Debug(SPrintF('[comp/Tasks/ServerAccountsResources]: Order[Code] = %s',$Order['Code']));
				#-------------------------------------------------------------------------------
				// IP адреса тоже на этом управляющем сервере
				if($Order['Code'] != 'DS')
					continue;
				#-------------------------------------------------------------------------------
				// если поле задано и обновлялся менее получаса назад - пропускаем
				if(IsSet($Order['Params']['UpdateDate']) && StrToTime($Order['Params']['UpdateDate']) > Time() - 1800)
					continue;
				#-------------------------------------------------------------------------------
				// складываем в массив, ключ/значение[время обновления]
				$UpdateDate = IsSet($Order['Params']['UpdateDate'])?StrToTime($Order['Params']['UpdateDate']):0;
				$Array1[$Order['OrderID']] = $UpdateDate;
				//$Array[] = $Order['OrderID'];
				#-------------------------------------------------------------------------------
				// чё-то внеслось, выходим из цикла
				//break;
				#-------------------------------------------------------------------------------
			}
			#-------------------------------------------------------------------------------
			Debug(SPrintF('[comp/Tasks/ServerAccountsResources]: на %s необходимо обработать %s выделенных серверов',$Server['Address'],SizeOf($Array1)));
			#-------------------------------------------------------------------------------
			// если чё-то влетело, сортируем
			if(SizeOf($Array1) > 0)
				ASort($Array1);
			#-------------------------------------------------------------------------------
			Debug(SPrintF('[comp/Tasks/ServerAccountsResources]: заказы выделенных серверов: %s',Implode(',',Array_Keys($Array1))));
			// втыкаем в выхлоп последний ключ
			$Array[] = Current(Array_Keys($Array1));
			#-------------------------------------------------------------------------------
			Debug(SPrintF('[comp/Tasks/ServerAccountsResources]: текущий заказ выделенного сервера: %s',Implode(',',$Array)));
			#-------------------------------------------------------------------------------
		}else{
			#-------------------------------------------------------------------------------
			// хостинг, ВПС - все учётки скопом проверяем
			foreach($Orders as $Order)
				$Array[] = $Order['OrderID'];
			#-------------------------------------------------------------------------------
		}
		#-------------------------------------------------------------------------------
		Debug(SPrintF('[comp/Tasks/ServerAccountsResources]: достаём ресурсы с сервера %s; учётных записей %s',$Server['Address'],SizeOf($Array)));
		#-------------------------------------------------------------------------------
		// достаём статистику использования выделенных ресурсов
		// это делается отдельным компонентом, иначе не получится сделать кнопку обновления в интерфейсе юзера
		$IsUpdate = Comp_Load('www/API/UpdateResourcesUsed',Array('Orders'=>$Array));
		if(Is_Error($IsUpdate))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		break;
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
	default:
		return ERROR | @Trigger_Error(101);
	}
	
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// у выделенных серверов надо проверить, что всё что необходимо - уже опрошено.
// только после этого обновлять дату опроса самого управляющего сервера
if(In_Array($Server['Code'],Array('DS'))){
	#-------------------------------------------------------------------------------
	// достаём список выделенных серверов на этом управляющем сервере
	$Columns = Array('OrderID',"(SELECT `Params` FROM `TmpData` WHERE `AppID` = 'Order.Statistics' AND `OrdersOwners`.`OrderID` = `TmpData`.`Col1` LIMIT 1) AS `Params`");
	$Orders = DB_Select('OrdersOwners',$Columns,Array('Where'=>Array('`StatusID` IN ("Active","Suspended")',SPrintF('`ServerID` = %u',$Server['ID']))));
	#-------------------------------------------------------------------------------
	switch(ValueOf($Orders)){
	case 'error':
		return ERROR | @Trigger_Error(500);
	case 'exception':
		break;
	case 'array':
		#-------------------------------------------------------------------------------
		foreach($Orders as $Order){
			#-------------------------------------------------------------------------------
			// если поле задано и обновлялся недавно - пропускаем
			if(IsSet($Order['Params']['UpdateDate']) && StrToTime($Order['Params']['UpdateDate']) > Time() - 1800)
				continue;
			#-------------------------------------------------------------------------------
			// тут мы оказываемся только если есть непрочеканные сервера
			return 10;
			#-------------------------------------------------------------------------------
		}
		#-------------------------------------------------------------------------------
		break;
		#-------------------------------------------------------------------------------
	default:
		return ERROR | @Trigger_Error(101);
	}
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// по хорошему, надо снова достать это поле ип отом всунуть обратно - за время опроса могли произойти изменения
$Server = DB_Select('Servers',Array('ID','Params'),Array('ID'=>$Server['ID'],'UNIQ'));
#-------------------------------------------------------------------------------
switch(ValueOf($Server)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return ERROR | @Trigger_Error(400);
case 'array':
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
$Server['Params']['LastResourcesQuestioning'] = Time();
#-------------------------------------------------------------------------------
$IsUpdate = DB_Update('Servers',Array('Params'=>$Server['Params']),Array('ID'=>$Server['ID']));
if(Is_Error($IsUpdate))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return 20;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
?>
