<?php
#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
#-------------------------------------------------------------------------------
function SNAC_Create($FamilyID,$SubTypeID,$Data = ''){
  /****************************************************************************/
  $__args_types = Array('integer','integer','string');
  #-----------------------------------------------------------------------------
  $__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
  /****************************************************************************/
  $Result = Bytes_I2B(WORD,HexDec($FamilyID)). # Номер семейства
            Bytes_I2B(WORD,HexDec($SubTypeID)). # Номер подсемейства
            Bytes_I2B(BUTE,0). # Флаг 1
            Bytes_I2B(BUTE,0). # Флаг 2
            Bytes_I2B(DWORD,Rand(1,65025)); # Номер запроса
  #-----------------------------------------------------------------------------
  $Result .= $Data; # Сам пакет
  #-----------------------------------------------------------------------------
  return $Result;
}
#-------------------------------------------------------------------------------
function SNAC_Explode($String){
  /****************************************************************************/
  $__args_types = Array('string');
  #-----------------------------------------------------------------------------
  $__args__ = Func_Get_Args(); Eval(FUNCTION_INIT);
  /****************************************************************************/
  $Result = Array(
    #---------------------------------------------------------------------------
    'FamilyID'  => Bytes_Get($String,00,WORD), # Номер семейства
    'SubTypeID' => Bytes_Get($String,02,WORD), # Номер подсемейства
    'Flag0'     => Bytes_Get($String,05,BUTE), # Флаг 1
    'Flag1'     => Bytes_Get($String,06,BUTE), # Флаг 2
    'RequestID' => Bytes_Get($String,04,BUTE)  # Номер запроса
  );
  #-----------------------------------------------------------------------------
  $Result['Data'] = SubStr($String,11); # Сам пакет
  #-----------------------------------------------------------------------------
  return $Result;
}
#-------------------------------------------------------------------------------
?>