//------------------------------------------------------------------------------
/** @author Бреславский А.В. (Joonte Ltd.) */
//------------------------------------------------------------------------------
function UserPersonalDataChange() {
    //----------------------------------------------------------------------------
    var $Form = document.forms['UserPersonalDataChangeForm'];
    //----------------------------------------------------------------------------
    $HTTP = new HTTP();
    //----------------------------------------------------------------------------
    if (!$HTTP.Resource) {
	//--------------------------------------------------------------------------
	alert('Не удалось создать HTTP соединение');
	//--------------------------------------------------------------------------
	return false;
    }
    //----------------------------------------------------------------------------
    $HTTP.onLoaded = function() {
	//--------------------------------------------------------------------------
	HideProgress();
    }
    //----------------------------------------------------------------------------
    $HTTP.onAnswer = function($Answer) {
	//--------------------------------------------------------------------------
	switch ($Answer.Status) {
	    case 'Error':
		ShowAlert($Answer.Error.String, 'Warning');
		break;
	    case 'Exception':
		ShowAlert(ExceptionsStack($Answer.Exception), 'Warning');
		break;
	    case 'Ok':
		//----------------------------------------------------------------------
		try {
		    document.getElementById('UserFoto').src = '/UserFoto?Rand=' + (Math.round(Math.random() * 8999) + 1000);
		} catch (exception) {
		    Debug(exception);
		}
		;
		//----------------------------------------------------------------------
		ShowTick('Информация успешно сохранена');
		break;
	    default:
		alert('Не известный ответ');
	}
    };
    //----------------------------------------------------------------------------
    var $Args = FormGet($Form);
    //----------------------------------------------------------------------------
    if (!$HTTP.Send('/API/UserPersonalDataChange', $Args)) {
	//--------------------------------------------------------------------------
	alert('Не удалось отправить запрос на сервер');
	//--------------------------------------------------------------------------
	return false;
    }
    //----------------------------------------------------------------------------
    ShowProgress('Смена персональных данных');
}
//------------------------------------------------------------------------------
function ICQTest() {
    //----------------------------------------------------------------------------
    var $Form = document.forms['UserPersonalDataChangeForm'];
    //----------------------------------------------------------------------------
    $HTTP = new HTTP();
    //----------------------------------------------------------------------------
    if (!$HTTP.Resource) {
	//--------------------------------------------------------------------------
	alert('Не удалось создать HTTP соединение');
	//--------------------------------------------------------------------------
	return false;
    }
    //----------------------------------------------------------------------------
    $HTTP.onLoaded = function() {
	//--------------------------------------------------------------------------
	HideProgress();
    }
    //----------------------------------------------------------------------------
    $HTTP.onAnswer = function($Answer) {
	//--------------------------------------------------------------------------
	switch ($Answer.Status) {
	    case 'Error':
		ShowAlert($Answer.Error.String, 'Warning');
		break;
	    case 'Exception':
		ShowAlert(ExceptionsStack($Answer.Exception), 'Warning');
		break;
	    case 'Ok':
		ShowAlert('Сообщение успешно отправлено');
	}
    }
    //----------------------------------------------------------------------------
    var $Args = {UIN: $Form.ICQ.value};
    //----------------------------------------------------------------------------
    if (!$HTTP.Send('/API/ICQTest', $Args)) {
	//--------------------------------------------------------------------------
	alert('Не удалось отправить запрос на сервер');
	//--------------------------------------------------------------------------
	return false;
    }
    //----------------------------------------------------------------------------
    ShowProgress('Отправка сообщения в ICQ');
}

// added by lissyara 2011-08-12 in 10:24 MSK
function JabberTest() {
    //----------------------------------------------------------------------------
    var $Form = document.forms['UserPersonalDataChangeForm'];
    //----------------------------------------------------------------------------
    $HTTP = new HTTP();
    //----------------------------------------------------------------------------
    if (!$HTTP.Resource) {
	//--------------------------------------------------------------------------
	alert('Не удалось создать HTTP соединение');
	//--------------------------------------------------------------------------
	return false;
    }
    //----------------------------------------------------------------------------
    $HTTP.onLoaded = function() {
	//--------------------------------------------------------------------------
	HideProgress();
    }
    //----------------------------------------------------------------------------
    $HTTP.onAnswer = function($Answer) {
	//--------------------------------------------------------------------------
	switch ($Answer.Status) {
	    case 'Error':
		ShowAlert($Answer.Error.String, 'Warning');
		break;
	    case 'Exception':
		ShowAlert(ExceptionsStack($Answer.Exception), 'Warning');
		break;
	    case 'Ok':
		ShowAlert('Сообщение успешно отправлено');
	}
    }
    //----------------------------------------------------------------------------
    var $Args = {JabberID: $Form.JabberID.value};
    //----------------------------------------------------------------------------
    if (!$HTTP.Send('/API/JabberTest', $Args)) {
	//--------------------------------------------------------------------------
	alert('Не удалось отправить запрос на сервер');
	//--------------------------------------------------------------------------
	return false;
    }
    //----------------------------------------------------------------------------
    ShowProgress('Отправка сообщения в Jabber');
}

// added by lissyara 2011-12-21 in 11:22 MSK
function EmailConfirm() {
    //----------------------------------------------------------------------------
    var $Form = document.forms['UserPersonalDataChangeForm'];
    //----------------------------------------------------------------------------
    $HTTP = new HTTP();
    //----------------------------------------------------------------------------
    if (!$HTTP.Resource) {
	//--------------------------------------------------------------------------
	alert('Не удалось создать HTTP соединение');
	//--------------------------------------------------------------------------
	return false;
    }
    //----------------------------------------------------------------------------
    $HTTP.onLoaded = function() {
	//--------------------------------------------------------------------------
	HideProgress();
    }
    //----------------------------------------------------------------------------
    $HTTP.onAnswer = function($Answer) {
	//--------------------------------------------------------------------------
	switch ($Answer.Status) {
	    case 'Error':
		ShowAlert($Answer.Error.String, 'Warning');
		break;
	    case 'Exception':
		ShowAlert(ExceptionsStack($Answer.Exception), 'Warning');
		break;
	    case 'Ok':
		ShowAlert('Проверочная ссылка успешно отправлена на ваш почтовый адрес.');
	}
    }
    //----------------------------------------------------------------------------
    var $Args = {Email: $Form.Email.value};
    //----------------------------------------------------------------------------
    if (!$HTTP.Send('/API/EmailConfirm', $Args)) {
	//--------------------------------------------------------------------------
	alert('Не удалось отправить запрос на сервер');
	//--------------------------------------------------------------------------
	return false;
    }
    //----------------------------------------------------------------------------
    ShowProgress('Отправка сообщения по электронной почте');
}

// added by lissyara 2011-12-21 in 11:24 MSK
function MobileConfirm() {
    //----------------------------------------------------------------------------
    var $Form = document.forms['UserPersonalDataChangeForm'];
    //----------------------------------------------------------------------------
    $HTTP = new HTTP();
    //----------------------------------------------------------------------------
    if (!$HTTP.Resource) {
	//--------------------------------------------------------------------------
	alert('Не удалось создать HTTP соединение');
	//--------------------------------------------------------------------------
	return false;
    }
    //----------------------------------------------------------------------------
    $HTTP.onLoaded = function() {
	//--------------------------------------------------------------------------
	HideProgress();
    }
    //----------------------------------------------------------------------------
    $HTTP.onAnswer = function($Answer) {
	//--------------------------------------------------------------------------
	switch ($Answer.Status) {
	    case 'Error':
		ShowAlert($Answer.Error.String, 'Warning');
		break;
	    case 'Exception':
		ShowAlert(ExceptionsStack($Answer.Exception), 'Warning');
		break;
	    case 'Ok':
		ShowAlert('SMS cообщение с кодом подтверждения успешно отправлено');
		break;
	    default:
		alert('Не известный ответ');
	}
    }
    //----------------------------------------------------------------------------
    var $Args = {Mobile: $Form.Mobile.value};
    //----------------------------------------------------------------------------
    if (!$HTTP.Send('/API/MobileConfirm', $Args)) {
	//--------------------------------------------------------------------------
	alert('Не удалось отправить запрос на сервер');
	//--------------------------------------------------------------------------
	return false;
    }
    //----------------------------------------------------------------------------
    ShowProgress('Отправка SMS сообщения');
}
// add rootden 21.05.2013
function MobileConfirmCheck() {
    //----------------------------------------------------------------------------
    var $Form = document.forms['UserPersonalDataChangeForm'];
    //----------------------------------------------------------------------------
    $HTTP = new HTTP();
    //----------------------------------------------------------------------------
    if (!$HTTP.Resource) {
	//--------------------------------------------------------------------------
	alert('Не удалось создать HTTP соединение');
	//--------------------------------------------------------------------------
	return false;
    }
    //----------------------------------------------------------------------------
    $HTTP.onLoaded = function() {
	//--------------------------------------------------------------------------
	HideProgress();
    }
    //----------------------------------------------------------------------------
    $HTTP.onAnswer = function($Answer) {
	//--------------------------------------------------------------------------
	switch ($Answer.Status) {
	    case 'Error':
		ShowAlert($Answer.Error.String, 'Warning');
		break;
	    case 'Exception':
		ShowAlert(ExceptionsStack($Answer.Exception), 'Warning');
		break;
	    case 'Ok':
		ShowAlert('Номер телефона успешно подтвержден. Теперь вам доступны настройки SMS уведомлений во вкладке --> Уведомления. Внимание! Предыдущие настройки для SMS были сброшены.');
		break;
	    default:
		alert('Неизвестный ответ');
	}
    }
    //----------------------------------------------------------------------------
    var $Args = {Confirm: $Form.MobileConfirmCode.value};
    //----------------------------------------------------------------------------
    if (!$HTTP.Send('/API/MobileConfirm', $Args)) {
	//--------------------------------------------------------------------------
	alert('Не удалось отправить запрос на сервер');
	//--------------------------------------------------------------------------
	return false;
    }
    //----------------------------------------------------------------------------
    ShowProgress('Проверка кода подтверждения');
}


