<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Args');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args = IsSet($Args)?$Args:Args();
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('modules/Authorisation.mod')))
        return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(!IsSet($GLOBALS['__USER']))
	return Array();
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
/*
Stat->Last->HDD->Status->Ok/Critical/Warning		кружок - тобишь статус
ID							номер заказа
Домен/Хостинг/Счёт					название услуги
ContractID						договор
Customer						Название договора
DaysRemainded						дата конца/остаток дней / Time() + DaysRemainded
StatusID						статус
Url							кнопка оплаты/страница статуса/т.п.
*/
#-------------------------------------------------------------------------------
$Config = Config();
#-------------------------------------------------------------------------------
$Statuses = $Config['Statuses'];
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// достаём договора, чтобы не дёргать каждый раз на каждую услугу
$iContracts = DB_Select('ContractsOwners',Array('ID','Customer'),Array('Where'=>SPrintF('`UserID` = %u',$GLOBALS['__USER']['ID'])));
#-------------------------------------------------------------------------------
switch(ValueOf($iContracts)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return ERROR | @Trigger_Error(400);
case 'array':
	#-------------------------------------------------------------------------------
	$Contracts = Array();
	#-------------------------------------------------------------------------------
	foreach($iContracts as $iContract)
		$Contracts[$iContract['ID']] = $iContract['Customer'];
	#-------------------------------------------------------------------------------
	break;
	#-------------------------------------------------------------------------------
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// достаём сервисы, чтобы не дёргать каждый раз на каждую услугу
$iServices = DB_Select('ServicesOwners',Array('ID','NameShort'));
#-------------------------------------------------------------------------------
switch(ValueOf($iServices)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return ERROR | @Trigger_Error(400);
case 'array':
	#-------------------------------------------------------------------------------
	$Services = Array();
	#-------------------------------------------------------------------------------
	foreach($iServices as $iService)
		$Services[$iService['ID']] = $iService['NameShort'];
	#-------------------------------------------------------------------------------
	break;
	#-------------------------------------------------------------------------------
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Out = Array();
#-------------------------------------------------------------------------------
// заказы
$Orders = Comp_Load('www/API/v2/Orders');
if(Is_Error($Orders))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
foreach($Orders as $Order){
	#-------------------------------------------------------------------------------
	// проверяем наличие алерта у заказа
	$Status = 'Ok';
	#-------------------------------------------------------------------------------
	if(IsSet($Order['Stat']['Last']))
		foreach(Array_Keys($Order['Stat']['Last']) as $Key)
			if(IsSet($Order['Stat']['Last'][$Key]['Status']))
				$Status = $Order['Stat']['Last'][$Key]['Status'];
	#-------------------------------------------------------------------------------
	if($Status == 'Ok' && $Order['DaysRemainded'] > 10)
		continue;
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	$Line = Array(
			'ID'		=> $Order['OrderID'],
			'Code'		=> $Order['Code'],
			'Name'		=> $Services[$Order['ServiceID']],
			'ContractID'	=> $Order['ContractID'],
			'Customer'	=> $Contracts[$Order['ContractID']],
			'DaysRemainded'	=> $Order['DaysRemainded'],
			'StatusID'	=> $Order['StatusID'],
//			'StatusID'	=> $Statuses[SPrintF('%sOrders',($Order['Code'] != 'Default')?$Order['Code']:'')][$Order['StatusID']]['Name'],
			'Stat'		=> $Order['Stat'],
			'Url'		=> ($Order['Code'] != 'Default')?SPrintF('/v2/%sOrders/%u',$Order['Code'],$Order['OrderID']):SPrintF('/v2/AdditionalServices/%u',$Order['OrderID']),
			);
	#-------------------------------------------------------------------------------
	$Out[] = $Line;
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// счета
$Invoices = Comp_Load('www/API/v2/Invoices');
if(Is_Error($Invoices))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
foreach($Invoices as $Invoice){
	#-------------------------------------------------------------------------------
	if(In_Array($Invoice['StatusID'],Array('Payed','Rejected')))
		continue;
	#-------------------------------------------------------------------------------
	$Line = Array(
			'ID'		=> $Invoice['ID'],
			'Code'		=> 'Invoices',
			'Name'		=> 'Счёт на оплату',
			'ContractID'	=> $Invoice['ContractID'],
			'Customer'	=> $Contracts[$Invoice['ContractID']],
			'DaysRemainded'	=> '-',
			'StatusID'	=> $Invoice['StatusID'],
//			'StatusID'	=> $Statuses['Invoices'][$Invoice['StatusID']]['Name'],
			'Stat'		=> Array('Last'=>Array(Array('Name'=>'Статус','Used'=>'Ожидает оплату','Status'=>'Warning'))),
			'Url'		=> SPrintF('/v2/Invoices/%u',$Invoice['ID']),
			);
	#-------------------------------------------------------------------------------
	$Out[] = $Line;
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return $Out;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
