<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args = Args();
#-------------------------------------------------------------------------------
$ModeID	=  (string) @$Args['ModeID'];
$RowID	= (integer) @$Args['RowID'];
$OrderID= (integer) @$Args['OrderID'];
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('modules/Authorisation.mod')))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
// костыль, для уменьшения числа запросов к АПИ фронтом
if($OrderID){
	#-------------------------------------------------------------------------------
	// код услуги
	$Order = DB_Select('OrdersOwners',Array('(SELECT `Code` FROM `Services` WHERE `ID` = `OrdersOwners`.`ServiceID`) AS `Code`'),Array('ID'=>$OrderID,'UNIQ'));
	#-------------------------------------------------------------------------------
	switch(ValueOf($Order)){
	case 'error':
		return ERROR | @Trigger_Error(500);
	case 'exception':
		return ERROR | @Trigger_Error(400);
	case 'array':
		break;
	default:
		return ERROR | @Trigger_Error(101);
	}
	#-------------------------------------------------------------------------------
	$ModeID = SPrintF('%sOrders',$Order['Code']);
	#-------------------------------------------------------------------------------
	// идентфикатор по таблице услуги
	$Order = DB_Select(SPrintF('%sOwners',$ModeID),Array('ID'),Array('Where'=>SPrintF('`OrderID` = %u',$OrderID),'UNIQ'));
	#-------------------------------------------------------------------------------
	switch(ValueOf($Order)){
	case 'error':
		return ERROR | @Trigger_Error(500);
	case 'exception':
		return ERROR | @Trigger_Error(400);
	case 'array':
		break;
	default:
		return ERROR | @Trigger_Error(101);
	}
	#-------------------------------------------------------------------------------
	$RowID = $Order['ID'];
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Regulars = Regulars();
#-------------------------------------------------------------------------------
if(!Preg_Match($Regulars['ID'],$ModeID))
	return ERROR | @Trigger_Error(201);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Config = Config();
#-------------------------------------------------------------------------------
$Statuses = $Config['Statuses'][$ModeID];
#-------------------------------------------------------------------------------
$Row = DB_Select(SPrintF('%sOwners',$ModeID),'UserID',Array('UNIQ','Limits'=>Array(0,1),'Where'=>SPrintF("`ID` = %u",$RowID)));
#-------------------------------------------------------------------------------
switch(ValueOf($Row)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return ERROR | @Trigger_Error(400);
case 'array':
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$IsPermission = Permission_Check('StatusesHistory',(integer)$GLOBALS['__USER']['ID'],(integer)$Row['UserID']);
#-------------------------------------------------------------------------------
switch(ValueOf($IsPermission)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return ERROR | @Trigger_Error(400);
case 'false':
	return ERROR | @Trigger_Error(700);
case 'true':
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Out = Array();
#-------------------------------------------------------------------------------
$StatusesHistory = DB_Select('StatusesHistory','*',Array('SortOn'=>Array('StatusDate','ID'),'Where'=>SPrintF("`ModeID` = '%s' AND `RowID` = %u",$ModeID,$RowID)));
#-------------------------------------------------------------------------------
switch(ValueOf($StatusesHistory)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return $Out;
case 'array':
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
foreach($StatusesHistory as $StatusHistory){
	#-------------------------------------------------------------------------------
	$StatusHistory['Initiator'] = $GLOBALS['__USER']['IsAdmin']?$StatusHistory['Initiator']:Preg_Replace('/\s(\(\H+\))$/', '',$StatusHistory['Initiator']);
	#-------------------------------------------------------------------------------
	$Out[$StatusHistory['ID']] = $StatusHistory;
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return $Out;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------

?>
