//------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
//------------------------------------------------------------------------------
function Logon($Email,$Password,$IsRemember){
  //----------------------------------------------------------------------------
  $HTTP = new HTTP();
  //----------------------------------------------------------------------------
  if(!$HTTP.Resource){
    //--------------------------------------------------------------------------
    alert('Не удалось создать HTTP соединение');
    //--------------------------------------------------------------------------
    return false;
  }
  //----------------------------------------------------------------------------
  $HTTP.onLoaded = function(){
    //--------------------------------------------------------------------------
    HideProgress();
  }
  //----------------------------------------------------------------------------
  $HTTP.onAnswer = function($Answer){
    //--------------------------------------------------------------------------
    switch($Answer.Status){
      case 'Error':
        ShowAlert($Answer.Error.String,'Warning');
      break;
      case 'Exception':
        ShowAlert(ExceptionsStack($Answer.Exception),'Warning');
      break;
      case 'Ok':
        //----------------------------------------------------------------------
        var $Href = document.location.href;
        //----------------------------------------------------------------------
        ShowProgress('Осуществление входа в систему');
        //----------------------------------------------------------------------
        if($Href.indexOf('/Logon') != -1 || $Href.indexOf('/Index') != -1)
          document.location = $Answer.Home;
        else
          GetURL(document.location);
      break;
      default:
        alert('Не известный ответ');
    }
  };
  //----------------------------------------------------------------------------
  var $Args = {Email:$Email,Password:$Password,IsRemember:Number($IsRemember),ReOpen:'yes'};
  //----------------------------------------------------------------------------
  if(!$HTTP.Send('/API/Logon',$Args)){
    //--------------------------------------------------------------------------
    alert('Не удалось отправить запрос на сервер');
    //--------------------------------------------------------------------------
    return false;
  }
  //----------------------------------------------------------------------------
  ShowProgress('Авторизация в системе');
}