//------------------------------------------------------------------------------
/** @author Бреславский А.В. (Joonte Ltd.) */
//------------------------------------------------------------------------------
function MotionDocumentDownload($MotionDocumentID){
  //----------------------------------------------------------------------------
  var $HTTP = new HTTP();
  //----------------------------------------------------------------------------
  if(!$HTTP.Resource){
    //--------------------------------------------------------------------------
    alert('Не удалось создать HTTP соединение');
    //--------------------------------------------------------------------------
    return false;
  }
  //----------------------------------------------------------------------------
  $HTTP.onLoaded = function(){
    //--------------------------------------------------------------------------
    HideProgress();
  }
  //----------------------------------------------------------------------------
  $HTTP.onAnswer = function($Answer){
    //--------------------------------------------------------------------------
    switch($Answer.Status){
      case 'Error':
        ShowAlert($Answer.Error.String,'Warning');
      break;
      case 'Exception':
        ShowAlert(ExceptionsStack($Answer.Exception),'Warning');
      break;
      case 'Ok':
        //----------------------------------------------------------------------
        $HTTP.onAnswer = function($Answer){
          //--------------------------------------------------------------------
          switch($Answer.Status){
            case 'Error':
              ShowAlert($Answer.Error.String,'Warning');
            break;
            case 'Exception':
              ShowAlert(ExceptionsStack($Answer.Exception),'Warning');
            break;
            case 'Ok':
              document.location = $Answer.Location;
            break;
            default:
              alert('Не известный ответ');
          }
        };
        //----------------------------------------------------------------------
        var $AjaxCall = $Answer.AjaxCall;
        //----------------------------------------------------------------------
        if(!$HTTP.Send($AjaxCall.Url,$AjaxCall.Args)){
          //--------------------------------------------------------------------
          alert('Не удалось отправить запрос на сервер');
          //--------------------------------------------------------------------
          return false;
        }
        //----------------------------------------------------------------------
        ShowProgress('Формирование документа');
      break;
      default:
        alert('Не известный ответ');
    }
  };
  //----------------------------------------------------------------------------
  var $Args = {MotionDocumentID:$MotionDocumentID};
  //----------------------------------------------------------------------------
  if(!$HTTP.Send('/MotionDocumentDownload',$Args)){
    //--------------------------------------------------------------------------
    alert('Не удалось отправить запрос на сервер');
    //--------------------------------------------------------------------------
    return false;
  }
  //----------------------------------------------------------------------------
  ShowProgress('Получение ссылки на документ');
}