<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args = Args();
#-------------------------------------------------------------------------------
$MessageID = (integer) @$Args['MessageID'];
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(!$MessageID)
  return new gException('MESSAGE_ID_IS_EMPTY','Выберите сообщение');
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('modules/Authorisation.mod','libs/Tree.php','libs/Upload.php')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$__USER = $GLOBALS['__USER'];
#-------------------------------------------------------------------------------
#-----------------------------------------------------------------------------
$IsPermission = Permission_Check('/Administrator/',(integer)$__USER['ID']);
#-----------------------------------------------------------------------------
switch(ValueOf($IsPermission)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return ERROR | @Trigger_Error(400);
case 'false':
	return ERROR | @Trigger_Error(700);
case 'true':
	# all OK
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# ПРоверяем - есть ли такое сообщение?
$Count = DB_Count('EdesksMessages',Array('ID'=>$MessageID));
if(Is_Error($Count))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
if(!$Count)
	return new gException('MESSAGE_NOT_FOUND','Сообщение не найдено');
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# проверяем - не единственное ли это сообщение треда?
$Count = DB_Count('EdesksMessages',Array('Where'=>SPrintF("`EdeskID` = (SELECT `EdeskID` FROM `EdesksMessages` WHERE `ID` = %u)",$MessageID)));
if(Is_Error($Count))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
if($Count == 1)
	return new gException('LAST_MESSAGE_IN_TRED','Это - последнее сообщение тикета. Необходимо удалять тикет.');
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$IsDeleted = DB_Delete('EdesksMessages',Array('ID'=>$MessageID));
if(Is_Error($IsDeleted))
	return ERROR | @Trigger_Error(500);
#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------
return Array('Status'=>'Ok');




?>
