<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args = Args();
#-------------------------------------------------------------------------------
$MessageID = (integer) @$Args['MessageID'];
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(!$MessageID)
  return new gException('MESSAGE_ID_IS_EMPTY','Выберите сообщение');
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('modules/Authorisation.mod','libs/Tree.php','libs/Upload.php')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$__USER = $GLOBALS['__USER'];
#-------------------------------------------------------------------------------
#-----------------------------------------------------------------------------
if(!$__USER['IsAdmin']){
	return ERROR | @Trigger_Error(700);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# ПРоверяем - есть ли такое сообщение?
$Count = DB_Count('EdesksMessages',Array('ID'=>$MessageID));
if(Is_Error($Count))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
if(!$Count)
	return new gException('MESSAGE_NOT_FOUND','Сообщение не найдено');
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# проверяем - не единственное ли это сообщение треда?
$Count = DB_Count('EdesksMessages',Array('Where'=>SPrintF("`EdeskID` = (SELECT `EdeskID` FROM `EdesksMessages` WHERE `ID` = %u)",$MessageID)));
if(Is_Error($Count))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
if($Count == 1)
	return new gException('LAST_MESSAGE_IN_TRED','Это - последнее сообщение тикета. Необходимо удалять тикет.');
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# выбираем текст тикета, и его тему - для записи события
$EdeskMessage = DB_Select('EdesksOwners',Array('ID','Theme','Content'),Array('UNIQ','Where'=>SPrintF('`MessageID` = %u',$MessageID)));
#-------------------------------------------------------------------------------
switch(ValueOf($EdeskMessage)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return ERROR | @Trigger_Error(400);
case 'array':
	# All OK
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$IsDeleted = DB_Delete('EdesksMessages',Array('ID'=>$MessageID));
if(Is_Error($IsDeleted))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Event = Array(
		'UserID'	=> $__USER['ID'],
		'PriorityID'	=> 'Warning',
		'Text'		=> SPrintF('Удалено сообщение #%u, тикет #%u (%s), текст сообщения (%s...)',$MessageID,$EdeskMessage['ID'],$EdeskMessage['Theme'],SubStr($EdeskMessage['Content'],0,100))
		);
$Event = Comp_Load('Events/EventInsert',$Event);
#-------------------------------------------------------------------------------
if(!$Event)
	return ERROR | @Trigger_Error(500);
#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------
return Array('Status'=>'Ok');




?>
