<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args = Args();
#-------------------------------------------------------------------------------
$Email		= (string) @$Args['Email'];
$Confirm	= (string) @$Args['Confirm'];
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('modules/Authorisation.mod')))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$CacheID = Md5($__FILE__ . $GLOBALS['__USER']['ID']); 
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if($Email){
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	#return new gException('Email_CONFIRM_NOT_IMPLEMENTED','Данный функционал, ещё не реализован');
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	if(Time() < $GLOBALS['__USER']['EmailConfirmed'] + 3600)
		return new gException('EMAIL_ALREDY_CONFIRMED','Ваш почтовый адрес уже подтверждён. Повторное подтверждение возможно не ранее чем через час.');
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	$Email = $GLOBALS['__USER']['Email'];
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	$Executor = DB_Select('Users',Array('Sign','Email'),Array('UNIQ','ID'=>100));
	if(!Is_Array($Executor))
		return ERROR | @Trigger_Error(500);
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	$Message = "Уважаемый %s!\r\nДля подтверждения вашего почтового адреса, пройдите по этой ссылке:\r\n%s\r\nЕсли ссылка не открывается, то скопируйте и вставьте её в адресную строку браузера\r\n\r\n--\r\n%s\r\n";
	#-------------------------------------------------------------------------------
	$Theme = "Подтверждение Email адреса";
	#-------------------------------------------------------------------------------
	$Heads = "From: " . $Executor['Email'] . "\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=UTF-8\r\nContent-Transfer-Encoding: 8bit";
	#-------------------------------------------------------------------------------
	$Confirm = md5($GLOBALS['__USER']['ID'] . MicroTime());
	CacheManager::add($CacheID, $Confirm, 10*24*3600);
	#-------------------------------------------------------------------------------
	$Url = "http://" . HOST_ID . "/API/EmailConfirm?Confirm=" . $Confirm;
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	#Array('Task','Email','Theme','Message','Heads','ID');
	$Comp = Comp_Load('Tasks/Email',NULL,$Email,$Theme,SPrintF($Message,$GLOBALS['__USER']['Name'],$Url,$Executor['Sign']),$Heads,$GLOBALS['__USER']['ID']);
	if(Is_Error($Comp)){
		#-----------------------------------------------------------------------------
		return new gException('ERROR_MESSAGE_SEND','Не удалось отправить сообщение');
	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	# SQL - set email in DB as unconfirmed, SET confirm code
	$IsUpdate = DB_Update('Users',Array('EmailConfirmed'=>0),Array('ID'=>$GLOBALS['__USER']['ID']));
	if(Is_Error($IsUpdate))
		return ERROR | @Trigger_Error(500);
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	return Array('Status'=>'Ok');
	#-------------------------------------------------------------------------------
}else{
	#-------------------------------------------------------------------------------
	if(Is_Error(System_Load('modules/Authorisation.mod','classes/DOM.class.php')))
		return ERROR | @Trigger_Error(500);
	#-------------------------------------------------------------------------------
	$DOM = new DOM();
	#-------------------------------------------------------------------------------
	$Links = &Links();
	# Коллекция ссылок
	$Links['DOM'] = &$DOM;
	#-------------------------------------------------------------------------------
	if(Is_Error($DOM->Load('Base')))
		return ERROR | @Trigger_Error(500);
	#-------------------------------------------------------------------------------
	$DOM->AddText('Title','Подтверждение почтового адреса');
	#-------------------------------------------------------------------------------
	$NoBody = new Tag('NOBODY');
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	if(Time() < $GLOBALS['__USER']['EmailConfirmed'] + 3600){
		$DOM->AddAttribs('Body',Array('onload'=>"ShowAlert('Ваш почтовый адрес уже подтверждён. Повторное подтверждение возможно не ранее чем через час.','Warning');"));
	}else{
		#-------------------------------------------------------------------------------
		$Result = CacheManager::get($CacheID);
		if($Result && $Confirm == $Result){
			#-------------------------------------------------------------------------------
			$IsUpdate = DB_Update('Users',Array('EmailConfirmed'=>Time()),Array('ID'=>$GLOBALS['__USER']['ID']));
			if(Is_Error($IsUpdate))
				return ERROR | @Trigger_Error(500);
			#-------------------------------------------------------------------------------
			$DOM->AddAttribs('Body',Array('onload'=>"ShowAlert('Почтовый адрес успешно подтверждён.','Ok');"));
			#-------------------------------------------------------------------------------
			$Event = Array(
					'UserID'	=> $GLOBALS['__USER']['ID'],
					'PriorityID'	=> 'Billing',
					'Text'		=> SPrintF('Почтовый адрес (%s) успешно подтверждён',$GLOBALS['__USER']['Email'])
					);
			$Event = Comp_Load('Events/EventInsert',$Event);
			if(!$Event)
				return ERROR | @Trigger_Error(500);
			#-------------------------------------------------------------------------------
			# erase $Confirm
			CacheManager::add($CacheID, '1', 60);
		}else{
			$DOM->AddAttribs('Body',Array('onload'=>"ShowAlert('Введён неверный или просроченный код подтверждения. Попробуйте ещё раз.','Warning');"));
		}
	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	$DOM->AddChild('Into',$NoBody);
	#-------------------------------------------------------------------------------
	$Out = $DOM->Build();
	#-------------------------------------------------------------------------------
	if(Is_Error($Out))
		return ERROR | @Trigger_Error(500);
	#-------------------------------------------------------------------------------
	return $Out;
	#-------------------------------------------------------------------------------
}



?>
