<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args = Args();
#-------------------------------------------------------------------------------
$JabberID = (string) @$Args['JabberID'];
#-------------------------------------------------------------------------------
if(!$JabberID)
	return new gException('JabberID_NOT_FILLED','Jabber ID не указан');
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('modules/Authorisation.mod')))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Executor = DB_Select('Users','Sign',Array('UNIQ','ID'=>100));
if(!Is_Array($Executor))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Tasks/Jabber',NULL,$JabberID,TemplateReplace('www.API.ICQTest',Array('User'=>$GLOBALS['__USER'],'Executor'=>$Executor,'Service'=>'Jabber'),FALSE),'Тестовое сообщение через Jabber',$GLOBALS['__USER']['ID']);
if(Is_Error($Comp))
	return new gException('ERROR_MESSAGE_SEND','Не удалось отправить сообщение');
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return Array('Status'=>'Ok');
#-------------------------------------------------------------------------------

?>
