<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args	= IsSet($Args)?$Args:Args();
#-------------------------------------------------------------------------------
$Secret	= (string) @$Args['Secret'];	// секретный ключ
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('libs/HTTP.php','libs/Server.php','libs/MAX.php')))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Config = Config();
#-------------------------------------------------------------------------------
$Settings = SelectServerSettingsByTemplate('MAX');
#-------------------------------------------------------------------------------
switch(ValueOf($Settings)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return new gException('NO_MAXONTAKTE_SERVERS','Отсуствует настроенный сервер MAX');
case 'array':
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// параметры сервера как подстановка
$Replace = Array_ToLine($Settings,'%');
#-------------------------------------------------------------------------------
UnSet($Replace['%Params.Token%']);
UnSet($Replace['%Params.Secret%']);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// проверяем секретный ключ, убеждаемся что сообщение пришло от телеграмма
if(!$Secret || $Secret != $Settings['Params']['Secret'])
	return new gException('SECRET_KEY_NOT_MATCH','Секретный ключ не совпадает с ключом из настроек');
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// MAX на вебхук шлёт данные постом, json. читаем их.
$Data = Json_Decode(File_Get_Contents('php://input'));
#-------------------------------------------------------------------------------
Debug(SPrintF('[comp/www/API/MAX]: Data = %s',print_r($Data,true)));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Type = $Data->{'update_type'};
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// если это какая-то ненужная информация - выходим
if(!In_Array($Type,Array(/*'bot_started',*/'message_created'))){
	#-------------------------------------------------------------------------------
	Debug(SPrintF('[comp/www/API/MAX]: нет необходимости что-то делать, type = %s',$Type));
	#-------------------------------------------------------------------------------
	return 'ok';
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$MAX = new MAX($Settings['Params']['Token'],$Settings['Params']['Secret']);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// далее везде юзается $Data->{'object'}, поэтому сокращаем
$Data = $Data->{'message'};
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
//Debug(SPrintF('[comp/www/API/MAX]: Data->message = %s',print_r($Data,true)));
#-------------------------------------------------------------------------------
$MaxUserID = IntVal($Data->{'sender'}->{'user_id'}); // вернет ID отправителя
#-------------------------------------------------------------------------------
if(!$MaxUserID)
        return new gException('NO_USER_ID','Не удалось определить отправителя сообщения');
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// достаём сообщение или примечание, если оно есть
if(IsSet($Data->{'body'}->{'text'}) && $Data->{'body'}->{'text'}){
	#-------------------------------------------------------------------------------
	$Message = $Data->{'body'}->{'text'};
	#-------------------------------------------------------------------------------
/*
}elseif(IsSet($Data->{'text'}) && $Data->{'text'}){
	#-------------------------------------------------------------------------------
	// ответ на сообщение
	$Message = $Data->{'text'};
*/	#-------------------------------------------------------------------------------
}else{
	#-------------------------------------------------------------------------------
	$Message = 'сообщение без текста';
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// ищем в базе - есть ли такой отправитель в контактах хоть у кого-то
$Count = DB_Count('Contacts',Array('Where'=>SPrintF('`ExternalID` = %u',$MaxUserID)));
if(Is_Error($Count))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
// если отправитель есть - тихий режим отключаем, этот юзер тока с ботом общается
if($Count)
	$Settings['Params']['IsSilent'] = FALSE;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// возможно это - ответ на сообщение. тогда проверяем идентфикатор на который ответ
if(IsSet($Data->{'link'}->{'type'}) && $Data->{'link'}->{'type'} == 'reply'){
	#-------------------------------------------------------------------------------
	//Debug(SPrintF('[comp/www/API/MAX]: Data->link = %s',print_r($Data->{'link'},true)));
	$ReplyToID = $Data->{'link'}->{'message'}->{'mid'};
	#-------------------------------------------------------------------------------
	Debug(SPrintF('[comp/www/API/MAX]: ответ на сообщение = %s',$ReplyToID));
	#-------------------------------------------------------------------------------
	// ищем тикет
	$Attribs = $MAX->FindThreadID($ReplyToID);
	#-------------------------------------------------------------------------------
	// проверяем соответствие телеграммовского идентфикатора и нашего
	if($Attribs && $Attribs['TicketID'] != 0){
		#-------------------------------------------------------------------------------
		Debug(SPrintF('[comp/www/API/MAX]: link->message->mid = %s; UserID = %u; TicketID = %u; MessageID = %u',$ReplyToID,$Attribs['UserID'],$Attribs['TicketID'],$Attribs['MessageID']));
		#-------------------------------------------------------------------------------
		// проверяем наличие такого треда
		$Count = DB_Count('Edesks',Array('ID'=>$Attribs['TicketID']));
		if(Is_Error($Count))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
		// треда нет, шлём соответствующее сообщение
		if(!$Count){
			#-------------------------------------------------------------------------------
			Debug(SPrintF('[comp/www/API/MAX]: тикет НЕ найден: TicketID = %s',$Attribs['TicketID']));
			#-------------------------------------------------------------------------------
			// в тихом режиме - просто уходим
			if($Settings['Params']['IsSilent'])
				return 'ok';
			#-------------------------------------------------------------------------------
			// TODO надо создать новый тикет
			if($MaxMessageIDs = $MAX->MessageSend($MaxUserID,$Settings['Params']['EdeskNotFound'])){
				#-------------------------------------------------------------------------------
				// сохраняем сооветствие отправленного сообщения и кому оно ушло
				if(Is_Array($MaxMessageIDs))
					foreach($MaxMessageIDs as $MaxMessageID)
						if(!$MAX->SaveThreadID($Attribs['UserID'],0,0,$MaxMessageID))
							return ERROR | @Trigger_Error(500);
				#-------------------------------------------------------------------------------
				// выходим
				return 'ok';
				#-------------------------------------------------------------------------------
			}else{
				#-------------------------------------------------------------------------------
				return new gException('ERROR_SEND_EdeskNotFound_MESSAGE','Ошибка отправки сообщения о не найденном тикете');
				#-------------------------------------------------------------------------------
			}
			#-------------------------------------------------------------------------------
		}else{
			#-------------------------------------------------------------------------------
			Debug(SPrintF('[comp/www/API/MAX]: тикет найден: UserID = %s; TicketID = %s',$Attribs['UserID'],$Attribs['TicketID']));
			#-------------------------------------------------------------------------------
			$UserID = $Attribs['UserID'];
			#-------------------------------------------------------------------------------
		}
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		// проверяем существование юзера. может удалён уже
		$Count = DB_Count('Users',Array('ID'=>$Attribs['UserID']));
		if(Is_Error($Count))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
		if(!$Count){
			#-------------------------------------------------------------------------------
			Debug(SPrintF('[comp/www/API/MAX]: пользователь с идентфикатором (%s) не существует',$Attribs['UserID']));
			#-------------------------------------------------------------------------------
                        if(!$Settings['Params']['IsSilent']){
				#-------------------------------------------------------------------------------
				// сообщаем об этом
				$MAX->MessageSend($MaxUserID,'Пользователь от имени которого вы отправляете сообщение не существует');
					return new gException('ERROR_SEND_USER_NOT_FOUND_MESSAGE','Ошибка отправки сообщения о не найденном пользователе');
				#-------------------------------------------------------------------------------
			}
			#-------------------------------------------------------------------------------
			#-------------------------------------------------------------------------------
			// выходим
			return 'ok';
			#-------------------------------------------------------------------------------
			#-------------------------------------------------------------------------------
		}
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		Debug(SPrintF('[comp/www/API/MAX]: инициализируем пользователя (%s)',$UserID));
		// инициализируюем юзера, иначе статус не проставится
		$Init = Comp_Load('Users/Init',IsSet($UserID)?$UserID:100);
		if(Is_Error($Init))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		// проверяем приложенные файлы и фотки, выковыриваем их
		if(IsSet($Data->{'body'}->{'attachments'}) && SizeOf($Data->{'body'}->{'attachments'}) > 0){
			#-------------------------------------------------------------------------------
			$Count = SizeOf($Data->{'body'}->{'attachments'}) - 1;
			#-------------------------------------------------------------------------------
			Debug(SPrintF('[comp/www/API/MAX]: в сообщении (%u) приложенных файлов',$Count+1));
			#-------------------------------------------------------------------------------
			$Hash = Array();
			#-------------------------------------------------------------------------------
			// перебираем файлы
			foreach($Data->{'body'}->{'attachments'} as $File){
				#-------------------------------------------------------------------------------
				$FileType = $File->{'type'};
				#-------------------------------------------------------------------------------
				Debug(SPrintF('[comp/www/API/MAX]: тип файла: %s',$FileType));
				#-------------------------------------------------------------------------------
				if($FileType == 'file'){	// документ прислали
					#-------------------------------------------------------------------------------
					$Url = $File->{'payload'}->{'url'};
					$Name= $File->{'filename'};
					#-------------------------------------------------------------------------------
				}elseif($FileType == 'image'){
					#-------------------------------------------------------------------------------
					// с фотами проблема, нет имени, нет реального типа изображения, нет размера
					// вроде как оно всё: RIFF (little-endian) data, Web/P image
					$Url = $File->{'payload'}->{'url'};
					$Name= SPrintF('%s.webp',$File->{'payload'}->{'photo_id'});
					#-------------------------------------------------------------------------------
				}else{
					#-------------------------------------------------------------------------------
					// х.з. чего это...
					Debug(SPrintF('[comp/www/API/MAX]: тип файла неизвестен: %s',$FileType));
					#-------------------------------------------------------------------------------
					continue;
					#-------------------------------------------------------------------------------
				}
				#-------------------------------------------------------------------------------
				Debug(SPrintF('[comp/www/API/MAX]: Url: %s',$Url));
				#-------------------------------------------------------------------------------
				// какой-то файл есть
				if($FileData = $MAX->GetFile($Url,$Name)){
					#-------------------------------------------------------------------------------
					// говорим что не интерактивно, чтоб размер не проверяло
					$GLOBALS['IsCron'] = TRUE;
					#-------------------------------------------------------------------------------
					// прописываем имя, если оно есть
					if(IsSet($FileName))
						$FileData['name'] = $FileName;
					#-------------------------------------------------------------------------------
					$_FILES = Array('Upload'=>$FileData);
					#-------------------------------------------------------------------------------
					global $_FILES;
					#-------------------------------------------------------------------------------
					$Hash1 = Comp_Load('www/API/Upload');
					if(Is_Error($Hash1))
						return ERROR | @Trigger_Error(500);
					#-------------------------------------------------------------------------------
					$Hash[] = $Hash1;
					#-------------------------------------------------------------------------------
				}
				#-------------------------------------------------------------------------------
			}
			#-------------------------------------------------------------------------------
		}else{
			#-------------------------------------------------------------------------------
			Debug(SPrintF('[comp/www/API/MAX]: вложений нет: Data->body = %s',print_r($Data->{'body'},true)));
			#-------------------------------------------------------------------------------
		}
		#-------------------------------------------------------------------------------
		// постим сообщение в существующий тред
		#-------------------------------------------------------------------------------
		// снимаем флаг у треда
		$IsUpdate = DB_Update('Edesks',Array('Flags'=>'No'),Array('ID'=>$Attribs['TicketID']));
		if(Is_Error($IsUpdate))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
		if(!$GLOBALS['__USER']['IsAdmin'])
			$Message = SPrintF("%s\n\n[size=10][color=gray]posted via Telegram, from chat_id: %s[/color][/size]",Trim($Message),$ChatID);
		#-------------------------------------------------------------------------------
		// цитируем предыдущее сообщение, если это не от администратора
		if(!$GLOBALS['__USER']['IsAdmin'])
			$Message = SPrintF('[quote]%s[/quote]%s',$Data->{'link'}->{'message'}->{'text'},($Message)?$Message:'');
		#-------------------------------------------------------------------------------
		// текста может и не быть, даже от админа
		if(!$Message)
			$Message = 'текст сообщения отсуствует';
		#-------------------------------------------------------------------------------
		$Params = Array('Message'=>$Message,'TicketID'=>$Attribs['TicketID'],'UserID'=>$UserID,'IsInternal'=>TRUE);
		#-------------------------------------------------------------------------------
		if(IsSet($Hash) && SizeOf($Hash))
			$Params['TicketMessageFile'] = $Hash;
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		// статус для тикета
		$StatusID = ($GLOBALS['__USER']['IsAdmin'])?'Opened':'Working';
		#-------------------------------------------------------------------------------
		// постим от админа, т.к. пост может идти от другого юзера в ответ на...
		$GLOBALS['__USER']['ID']	= 100;
		$GLOBALS['__USER']['IsAdmin']	= TRUE;
		$GLOBALS['__USER']['IsNoLogIP']	= 'MAX';
		#-------------------------------------------------------------------------------
		$IsAdd = Comp_Load('www/API/TicketMessageEdit',$Params);
		if(Is_Error($IsAdd))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		// ставим статус, так как постили по факту от админа, статус не встаёт
		$IsStatus = Comp_Load('www/API/StatusSet',Array('ModeID'=>'Edesks','IsNotNotify'=>TRUE,'IsNoTrigger'=>TRUE,'StatusID'=>$StatusID,'Comment'=>'Сообщение через MAX','RowsIDs'=>$Attribs['TicketID']));
		if(Is_Error($IsAdd))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		$GLOBALS['__USER']['ID']        = 100;
		$GLOBALS['__USER']['IsAdmin']   = FALSE;
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		return 'ok';
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
	}else{
		#-------------------------------------------------------------------------------
		// не найдено соответсвтие идентификатора в телеграмме и номера сообщения в тикетнцие
		Debug(SPrintF('[comp/www/API/MAX]: НЕ найдено соответствие сообщения в MAX и тикета: Data->link->message->mid = %s',$Data->{'link'}->{'message'}->{'mid'}));
		#-------------------------------------------------------------------------------
		if(!$Settings['Params']['IsSilent'])
			if(!$MAX->MessageSend($MaxUserID,$Settings['Params']['EdeskNotFound']))
				return new gException('ERROR_SEND_EdeskNotFound_MESSAGE','Ошибка отправки сообщения о не найденном тикете');
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		return 'ok';
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
}elseif($Type == 'message_created'){
	#-------------------------------------------------------------------------------
	// это новое сообщение, возможно это код подтверждения
	#-------------------------------------------------------------------------------
	// разбираем текст на слова, слова проверяем как код подтверждения
	$Words = Explode(" ",$Message);
	$wCount = 0;
	#-------------------------------------------------------------------------------
	foreach($Words as $Word){
		#-------------------------------------------------------------------------------
		#Debug(SPrintF('[comp/www/API/MAX]: Word = %s',$Word));
		#-------------------------------------------------------------------------------
		// удаляем дефисы
		$Word = Preg_Replace('/\D/','',$Word);
		#-------------------------------------------------------------------------------
		if(StrLen($Word) < 6 || StrLen($Word) > 10)
			continue;
		#-------------------------------------------------------------------------------
		// если это число - ищем по базе
		if(IntVal($Word) != 0){
			#-------------------------------------------------------------------------------
			// могут быть ведущие нули в коде
			$Count = DB_Count('Contacts',Array('Where'=>SPrintF('`Confirmation` = "%s"',$Word)));
			if(Is_Error($Count))
				return ERROR | @Trigger_Error(500);
			#-------------------------------------------------------------------------------
			if($Count){
				#-------------------------------------------------------------------------------
				$Contact = DB_Select('Contacts',Array('UserID','Address','ExternalID'),Array('UNIQ','Where'=>SPrintF('`Confirmation` = "%s"',$Word)));
				if(!Is_Array($Contact))
					return ERROR | @Trigger_Error(500);
				#-------------------------------------------------------------------------------
				// код найден в базе, проставляем что контакт подтверждён
				$IsUpdated = DB_Update('Contacts',Array('Confirmed'=>Time(),'Confirmation'=>'','ExternalID'=>$MaxUserID,'IsActive'=>TRUE),Array('Where'=>SPrintF('`Confirmation` = "%s"',$Word)));
				if(Is_Error($IsUpdated))
					return ERROR | @Trigger_Error(500);
				#-------------------------------------------------------------------------------
				$Event = Array('UserID'=>$Contact['UserID'],'PriorityID'=>'Billing','Text'=>SPrintF('Контактный адрес (%s/%s) подтверждён через "%s"',$Contact['Address'],$MaxUserID,$Config['Notifies']['Methods']['MAX']['Name']));
				#-------------------------------------------------------------------------------
				$Event = Comp_Load('Events/EventInsert',$Event);
				if(!$Event)
					return ERROR | @Trigger_Error(500);
				#-------------------------------------------------------------------------------
				#-------------------------------------------------------------------------------
				// шлём сообщение о успешной активации
				if(!$MAX->MessageSend($MaxUserID,$Settings['Params']['ConfirmSuccess']))
					return new gException('ERROR_SEND_SUCCESS_ACTIVATE_MESSAGE','Ошибка отправки сообщения о успешной активации на сервер MAX');
				#-------------------------------------------------------------------------------
				// шлём сообщение со справочной информацией
				if(!$MAX->MessageSend($MaxUserID,$Settings['Params']['StubMessage']))
					return new gException('ERROR_SEND_START_MESSAGE','Ошибка отправки сообщения-затычки на сервер MAX');
				#-------------------------------------------------------------------------------
				// вываливаемся из скрипта, вообще
				return 'ok';
				#-------------------------------------------------------------------------------
				#-------------------------------------------------------------------------------
			}
			#-------------------------------------------------------------------------------
		}
		#-------------------------------------------------------------------------------
		// всё перебирать бессмысленно, достаточно первого десятка слов
		if($wCount > 9)
			break;
		#-------------------------------------------------------------------------------
		$wCount++;
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// если в сообщении написано /start - выводим подсказку
if($Message == '/start'){
	#-------------------------------------------------------------------------------
	foreach(Array_Keys($Replace) as $Key)
		$Settings['Params']['StartMessage'] = Str_Replace($Key,$Replace[$Key],$Settings['Params']['StartMessage']);
	#-------------------------------------------------------------------------------
	// TODO надо проверить есть ли такой телеграмм у кого-то. если есть - другое сообщение надо слать - справку или рассказ что и почему
	if(!$MAX->MessageSend($MaxUserID,$Settings['Params']['StartMessage']))
		return new gException('ERROR_SEND_START_MESSAGE','Ошибка отправки стартового сообщения на сервер Telegram');
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// в тихом режиме - просто уходим
if($Settings['Params']['IsSilent'])
	return 'ok';
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// сюда мы попали если ничего не найдено
if(!$MAX->MessageSend($MaxUserID,SPrintF($Settings['Params']['StartMessage'],$Settings['Params']['BotName'])))
	return new gException('ERROR_SEND_START_MESSAGE','Ошибка отправки стартового сообщения на сервер MAX');
#-------------------------------------------------------------------------------
if(!$MAX->MessageSend($MaxUserID,$Settings['Params']['StubMessage']))
	return new gException('ERROR_SEND_START_MESSAGE','Ошибка отправки сообщения-затычки на сервер MAX');
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return 'ok';
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------


?>
