<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args = IsSet($Args)?$Args:Args();
#-------------------------------------------------------------------------------
$Secret		=  (string) @$Args['Secret'];	// секретный ключ
// эти данные используются при отправке
$UserID		= (integer) @$Args['UserID'];	// идентификатор юзера в телеграмме
$Text		=  (string) @$Args['Text'];	// текст сообщения
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('libs/HTTP.php','libs/Server.php','libs/Telegram.php')))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Config = Config();
#-------------------------------------------------------------------------------
$Settings = SelectServerSettingsByTemplate('Telegram');
#-------------------------------------------------------------------------------
switch(ValueOf($Settings)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return new gException('NO_TELEGRAM_SERVERS','Отсуствует настроенный сервер Telegramm');
case 'array':
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// проверяем секретный ключ, убеждаемся что сообщение пришло от телеграмма
if(!$Secret || $Secret != $Settings['Params']['Secret'])
	return new gException('SECRET_KEY_NOT_MATCH','Секретный ключ не совпадает с ключом из настроек');
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// телега на вебхук шлёт данные постом, json. читаем их.
$Data = Json_Decode(File_Get_Contents('php://input'));
#-------------------------------------------------------------------------------
#Debug(SPrintF('[comp/www/API/Telegramm]: Data = %s',print_r($Data,true)));
#-------------------------------------------------------------------------------
$Data = $Data->{'message'};
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// достаём сообщение, если оно есть
$Message = (IsSet($Data->{'text'}))?$Data->{'text'}:'';
#-------------------------------------------------------------------------------
$ChatID = $Data->{'chat'}->{'id'}; // вернет ID отправителя
#-------------------------------------------------------------------------------
Debug(SPrintF('[comp/www/API/Telegramm]: входящее сообщение от ChatID = %u',$ChatID));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// если в сообщении написано /start - выводим подсказку
if($Message == '/start'){
	#-------------------------------------------------------------------------------
	if(!TgSendMessage($Settings,$ChatID,SPrintF($Settings['Params']['StartMessage'],$Settings['Params']['BotName'])))
		return new gException('ERROR_SEND_START_MESSAGE','Ошибка отправки стартового сообщения на сервер Telegramm');
	#-------------------------------------------------------------------------------
	return Array('Status'=>'Ok');
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
// проверяем идентфикатор в базе, если он есть и подтверждён - это входящее сообщение от старого юзера
// блин... это ничего не значит. может тот же телеграмм у другого юзера быть и он его подтверждает
#$Count = DB_Count('Contacts',Array('Where'=>SPrintF(''));
#if(Is_Error($Count))
#	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
// разбираем текст на слова, слова проверяем как код подтверждения
$Words = Explode(" ",$Message);
$Count = 0;
#-------------------------------------------------------------------------------
foreach($Words as $Word){
	#-------------------------------------------------------------------------------
	// удаляем дефисы
	$Word = str_replace ('-','',$Word) ;
	#-------------------------------------------------------------------------------
	#Debug(SPrintF('[comp/www/API/Telegramm]: Word = %s',$Word));
	// если это число - ищем по базе
	if(IntVal($Word) != 0){
		#-------------------------------------------------------------------------------
		// могут быть ведущие нули в коде
		$Count = DB_Count('Contacts',Array('Where'=>SPrintF('`Confirmation` = "%s"',$Word)));
		if(Is_Error($Count))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
		if($Count){
			#-------------------------------------------------------------------------------
			$Contact = DB_Select('Contacts',Array('UserID','Address','ExternalID'),Array('UNIQ','Where'=>SPrintF('`Confirmation` = "%s"',$Word)));
			if(!Is_Array($Contact))
				return ERROR | @Trigger_Error(500);
			#-------------------------------------------------------------------------------
			$Event = Array('UserID'=>$Contact['UserID'],'PriorityID'=>'Billing','Text'=>SPrintF('Контактный адрес (%s/%s) подтверждён через "%s"',$Contact['Address'],$ChatID,$Config['Notifies']['Methods']['Telegram']['Name']));
			#-------------------------------------------------------------------------------
			$Event = Comp_Load('Events/EventInsert',$Event);
			if(!$Event)
				return ERROR | @Trigger_Error(500);
			#-------------------------------------------------------------------------------
			// код найден в базе, проставляем что контакт подтверждён
			$IsUpdated = DB_Update('Contacts',Array('Confirmed'=>Time(),'Confirmation'=>'','ExternalID'=>$ChatID),Array('Where'=>SPrintF('`Confirmation` = "%s"',$Word)));
			if(Is_Error($IsUpdated))
				return ERROR | @Trigger_Error(500);
			#-------------------------------------------------------------------------------
			#-------------------------------------------------------------------------------
			// шлём сообщение о успешной активации
			if(!TgSendMessage($Settings,$ChatID,$Settings['Params']['ConfirmSuccess']))
				return new gException('ERROR_SEND_SUCCESS_ACTIVATE_MESSAGE','Ошибка отправки сообщения о успешной активации на сервер Telegramm');
			#-------------------------------------------------------------------------------
			#-------------------------------------------------------------------------------
			// вываливаемся из скрипта, вообще
			return Array('Status'=>'Ok');
			#-------------------------------------------------------------------------------
		}
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	// всё перебирать бессмысленно, достаточно первого десятка слов
	if($Count > 9)
		break;
	#-------------------------------------------------------------------------------
	$Count++;
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// сюда мы попали если ничего не найдено
if(!TgSendMessage($Settings,$ChatID,SPrintF($Settings['Params']['StartMessage'],$Settings['Params']['BotName'])))
	return new gException('ERROR_SEND_START_MESSAGE','Ошибка отправки стартового сообщения на сервер Telegramm');
#-------------------------------------------------------------------------------
if(!TgSendMessage($Settings,$ChatID,$Settings['Params']['StubMessage']))
	return new gException('ERROR_SEND_START_MESSAGE','Ошибка отправки сообщения-затычки на сервер Telegramm');
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return Array('Status'=>'Ok');
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------


?>
