<?php

#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args = Args();
#-------------------------------------------------------------------------------
$Name		=  (string) @$Args['Name'];
$Sign		=  (string) @$Args['Sign'];
$IsClear	= (boolean) @$Args['IsClear'];
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$__USER = $GLOBALS['__USER'];
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('modules/Authorisation.mod','libs/Upload.php','libs/Image.php')))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Config = Config();
#-------------------------------------------------------------------------------
$Regulars = Regulars();
#-------------------------------------------------------------------------------
if(!Preg_Match($Regulars['UserName'],$Name))
	return new gException('WRONG_USER_NAME','Вы ввели неверное имя');
#-------------------------------------------------------------------------------
if(!$Sign)
	return new gException('SIGN_IS_EMPTY','Укажите Вашу подпись');
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$UUser = Array('Name'=>Trim($Name),'Sign'=>Trim($Sign),'Params'=>$__USER['Params']);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// просит удалить фотку, достаём все файлы и удаляем
if($IsClear){
	#-------------------------------------------------------------------------------
	$Files = GetUploadedFilesInfo('Users',$__USER['ID']);
	#-------------------------------------------------------------------------------
	foreach($Files as $File)
		if(!DeleteUploadedFile($File['ID']))
			return new gException('CANNOT_DELETE_FILE','Не удалось удалить связанный файл');
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// проверяем есть ли загруженные файлы
$Files = Upload_Get('UserFoto');
#-------------------------------------------------------------------------------
switch(ValueOf($Files)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	# No more...
	break;
case 'array':
	#-------------------------------------------------------------------------------
	// достаём все старые файлы, их надо будет удалить, иначе так и будут болтаться
	$FilesOld = GetUploadedFilesInfo('Users',$__USER['ID']);
	#-------------------------------------------------------------------------------
	// работаем только с первым файлом
	$Foto = $Files[0]['Data'];
	#-------------------------------------------------------------------------------
	$Foto = Image_Resize($Foto,90,110);
	#-------------------------------------------------------------------------------
	if(Is_Error($Foto))
		return new gException('FOTO_RESIZE_ERROR','Ошибка изменения размеров персональной фотографии. Приложите изображение в формате: jpeg, gif, png');
	#-------------------------------------------------------------------------------
	// заново строим массив с одним файлом с преобразованной фоткой
	$Files = Array(
			Array(
				'Name' => SPrintF('Avatar%s.jpeg',$__USER['ID']),
				'Data' => $Foto,
				'Size' => Mb_StrLen($Foto,'8bit'),
				'Mime' => 'image/jpeg'
				)
			);
	#-------------------------------------------------------------------------------
	// сохраняем файлы в таблицу
	if(Is_Error(SaveUploadedFile($Files,'Users',$__USER['ID'])))
		return new gException('CANNOT_SAVE_UPLOADED_FILES','Не удалось сохранить загруженный файл');
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	// удаляем все старые файлы
	if(SizeOf($FilesOld) > 0)
		foreach($FilesOld as $File)
			if(!DeleteUploadedFile($File['ID']))
				return new gException('CANNOT_DELETE_FILE','Не удалось удалить связанный файл');
	#-------------------------------------------------------------------------------
	break;
	#-------------------------------------------------------------------------------
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$IsUpdate = DB_Update('Users',$UUser,Array('ID'=>$__USER['ID']));
if(Is_Error($IsUpdate))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# исправляем юзера, на всякий случай
$Comp = Comp_Load('Tasks/RecoveryUsers',NULL,$__USER['ID']);
#-------------------------------------------------------------------------------
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return Array('Status'=>'Ok');
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------

?>
