<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('FileID','Width','Height');
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$File = DB_Select('ClausesFiles','Comment',Array('UNIQ','ID'=>$FileID));
#-------------------------------------------------------------------------------
switch(ValueOf($File)){
  case 'error':
    return ERROR | @Trigger_Error(500);
  case 'exception':
    return ERROR | @Trigger_Error(400);
  case 'array':
    #---------------------------------------------------------------------------
    if(Is_Null($Width))
      $Width = 500;
    #---------------------------------------------------------------------------
    if(Is_Null($Height))
      $Height = 300;
    #---------------------------------------------------------------------------
    $Links = &Links();
    # Коллекция ссылок
    #---------------------------------------------------------------------------
    $DOM = &$Links['DOM'];
    #---------------------------------------------------------------------------
    $Td = new Tag('TD',Array('valign'=>'top'));
    #---------------------------------------------------------------------------
    $Embed = new Tag('EMBED',Array('type'=>'application/x-shockwave-flash','src'=>'SRC:{others/FlvPlayer.swf}','width'=>'100%','height'=>'100%','align'=>'middle','bgcolor'=>'#FFFFFF','quality'=>'high','flashVars'=>SPrintF('way=/ClauseFileDownload%%3FIsPrintOut%%26ClauseFileID%%3D%u&amp;pic=&amp;autoplay=0&amp;tools=0&amp;skin=white&amp;volume=70&amp;q=&amp;comment=',$FileID)));
    #---------------------------------------------------------------------------
    $Td->AddChild($Embed);
    #---------------------------------------------------------------------------
    return new Tag('TABLE',Array('cellspacing'=>5,'width'=>$Width,'height'=>$Height),new Tag('TR',new Tag('TD',Array('class'=>'Standard','align'=>'center'),$File['Comment'])),new Tag('TR',$Td));
  default:
    return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------

?>
