<?php


#-------------------------------------------------------------------------------
/*<JBsDOC>
 <Target>file</Target>
 <Org>Joonte Ltd.</Org>
 <Author>Бреславский А.В.</Author>
</JBsDOC>*/
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Url','Width','Height');
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
if(Is_Null($Width))
  $Width = 500;
#-------------------------------------------------------------------------------
if(Is_Null($Height))
  $Height = 300;
#-------------------------------------------------------------------------------
$Links = &Links();
# Коллекция ссылок
#-------------------------------------------------------------------------------
$DOM = &$Links['DOM'];
#-------------------------------------------------------------------------------
$Td = new Tag('TD',Array('valign'=>'top','style'=>'border:1px solid #DCDCDC;padding:0px;','width'=>$Width,'height'=>$Height));
#-------------------------------------------------------------------------------
$Embed = new Tag('EMBED',Array('type'=>'application/x-shockwave-flash','src'=>'SRC:{others/FreeMind.swf}','width'=>'100%','height'=>'100%','align'=>'middle','bgcolor'=>'#A0A0F0','quality'=>'high','flashVars'=>SPrintF('openUrl=_blank&startCollapsedToLevel=3&maxNodeWidth=200&mainNodeShape=elipse&justMap=false&initLoadFile=%s&defaultToolTipWordWrap=200&offsetX=center&offsetY=center&buttonsPos=top&min_alpha_buttons=20&max_alpha_buttons=100&scaleTooltips=false',$Url)));
#-------------------------------------------------------------------------------
$Td->AddChild($Embed);
#-------------------------------------------------------------------------------
return new Tag('TABLE',new Tag('TR',$Td));
#-------------------------------------------------------------------------------

?>
