<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args = Args();
#-------------------------------------------------------------------------------
$TableID 	=  (string) @$Args['TableID'];
$ColumnID	=  (string) @$Args['ColumnID'];
$RowID   	= (integer) @$Args['RowID'];
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('modules/Authorisation.mod')))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
Debug(SPrintF('[comp/www/API/BooleanEdit]: TableID = %s; ColumnID = %s; RowID = %s',$TableID,$ColumnID,$RowID));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// для юзеров, ограниченный список таблиц и полей которые они могут править
$UserFields = Array('Contracts,IsHidden'/* для теста,'Servers,IsActive'*/);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(!$GLOBALS['__USER']['IsAdmin']){
	#-------------------------------------------------------------------------------
	$IsAllow = FALSE;
	#-------------------------------------------------------------------------------
	foreach($UserFields as $UserField){
		#-------------------------------------------------------------------------------
		List($Table,$Column) = Explode(",",$UserField);
		#-------------------------------------------------------------------------------
		//Debug(SPrintF('[comp/www/API/BooleanEdit]: Table = %s; Column = %s;',$Table,$Column));
		if($Table == $TableID && $Column == $ColumnID)
			$IsAllow = TRUE;
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	if(!$IsAllow)
		return ERROR | @Trigger_Error('[comp/www/API/BooleanEdit]: запрещённая комбинация таблицы/колонки');
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
/* в принципе, при ограниченных комбинациях полей, этой проверки не надо
// в имени таблицы и колонки - только буквы
if(Preg_Match("/\W/i",$TableID))
        return new gException('WRONG_TABLE','Неверное имя таблицы');
#-------------------------------------------------------------------------------
if(Preg_Match("/\W/i",$ColumnID))
        return new gException('WRONG_COLUMN','Неверное имя колонки');
*/
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Selected = DB_Select(SPrintF('%sOwners',$TableID),Array('UserID',$ColumnID),Array('UNIQ','ID'=>$RowID));
#-------------------------------------------------------------------------------
switch(ValueOf($Selected)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return ERROR | @Trigger_Error(400);
case 'array':
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(!$GLOBALS['__USER']['IsAdmin'] && $GLOBALS['__USER']['ID'] != $Selected['UserID'])
	return ERROR | @Trigger_Error(SPrintF('[comp/www/API/BooleanEdit]: попытка редактирования чужой записи: GLOBALS[__USER][ID] = %s; Selected[UserID] = %s',$GLOBALS['__USER']['ID'],$Selected['UserID']));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$IsUpdate = DB_Update($TableID,Array($ColumnID=>($Selected[$ColumnID])?FALSE:TRUE),Array('ID'=>$RowID));
if(Is_Error($IsUpdate))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return Array('Status'=>'Ok');
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------

?>
