<?php

#-------------------------------------------------------------------------------
/** @author Лапшин С.М. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('IsCreate','Folder','StartDate','FinishDate','Details');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
if(Is_Error(System_Load('libs/Artichow.php')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Result = Array('Title'=>'Распределение заказов на хостинг по серверам');
#-------------------------------------------------------------------------------
$NoBody = new Tag('NOBODY');
#-------------------------------------------------------------------------------
$NoBody->AddChild(new Tag('P','Данный вид статистики содержит информацию о количестве заказов закрепленных за каждым сервером хостинга.'));
#-------------------------------------------------------------------------------
if(!$IsCreate)
  return $Result;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Columns = Array(
		'ID',
		'Address',
		'(SELECT COUNT(*) FROM `HostingOrders` WHERE `HostingOrders`.`ServerID` = `HostingServers`.`ID` AND (`HostingOrders`.`StatusID` = "Active" OR `HostingOrders`.`StatusID` = "Suspended")) as `Count`'
		);
#-------------------------------------------------------------------------------
$HostingServers = DB_Select('HostingServers',$Columns,Array('SortOn'=>'Address'));
#-------------------------------------------------------------------------------
switch(ValueOf($HostingServers)){
  case 'error':
    return ERROR | @Trigger_Error(500);
  case 'exception':
    return $Result;
  case 'array':
    #---------------------------------------------------------------------------
    $Params = $Labels = Array();
    #---------------------------------------------------------------------------
    $Table = Array(Array(new Tag('TD',Array('class'=>'Head'),'Адрес сервера'),new Tag('TD',Array('class'=>'Head'),'Кол-во заказов')));
    #---------------------------------------------------------------------------
    foreach($HostingServers as $HostingServer){
      #-------------------------------------------------------------------------
      $Params[] = $HostingServer['Count'];
      $Labels[] = $HostingServer['Address'];
      #-------------------------------------------------------------------------
      $Table[] = Array($HostingServer['Address'],(integer)$HostingServer['Count']);
    }
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Tables/Extended',$Table);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $NoBody->AddChild($Comp);
    #---------------------------------------------------------------------------
    if(Count($Params) > 1){
      #-------------------------------------------------------------------------
      $File = SPrintF('%s.jpg',Md5('HostingServers1'));
      #-------------------------------------------------------------------------
      Artichow_Pie('Распределение заказов по серверам хостинга',SPrintF('%s/%s',$Folder,$File),$Params,$Labels);
      #-------------------------------------------------------------------------
      $NoBody->AddChild(new Tag('BR'));
      #-------------------------------------------------------------------------
      $NoBody->AddChild(new Tag('IMG',Array('src'=>$File)));
    }
    #---------------------------------------------------------------------------
    $Result['DOM'] = $NoBody;
    #---------------------------------------------------------------------------
    return $Result;
  default:
    return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------

?>
