<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
if(Is_Error(System_Load('modules/Authorisation.mod')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Args = Args();
#-------------------------------------------------------------------------------
$GroupID      =  (integer) @$Args['GroupID'];
$ParentID     =  (integer) @$Args['ParentID'];
$Name         =   (string) @$Args['Name'];
$IsDefault    =  (boolean) @$Args['IsDefault'];
$IsDepartment =  (boolean) @$Args['IsDepartment'];
$Comment      =   (string) @$Args['Comment'];
#-------------------------------------------------------------------------------
$Count = DB_Count('Groups',Array('ID'=>$ParentID));
if(Is_Error($Count))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
if(!$Count)
  return new gException('PARENT_GROUP_NOT_FOUND','Группа родитель не найдена');
#-------------------------------------------------------------------------------
if(!Preg_Match('/^[A-Za-zА-ЯёЁа-я0-9\-\s\(\)\.]+$/u',$Name))
  return new gException('WRONG_SCHEME_NAME','Неверное имя группы');
#-------------------------------------------------------------------------------
if($IsDefault){
  #-----------------------------------------------------------------------------
  $IsUpdate = DB_Update('Groups',Array('IsDefault'=>FALSE));
  if(Is_Error($IsUpdate))
    return ERROR | @Trigger_Error(500);
}
#-------------------------------------------------------------------------------
$IGroup = Array(
  #-----------------------------------------------------------------------------
  'ParentID'     => $ParentID,
  'Name'         => $Name,
  'IsDefault'    => $IsDefault,
  'IsDepartment' => $IsDepartment,
  'Comment'      => $Comment
);
#-------------------------------------------------------------------------------
if($GroupID){
  #-----------------------------------------------------------------------------
  $IsUpdate = DB_Update('Groups',$IGroup,Array('ID'=>$GroupID));
  if(Is_Error($IsUpdate))
    return ERROR | @Trigger_Error(500);
}else{
  #-----------------------------------------------------------------------------
  $IsInsert = DB_Insert('Groups',$IGroup);
  if(Is_Error($IsInsert))
    return ERROR | @Trigger_Error(500);
}
#-------------------------------------------------------------------------------
$IsFlush = MemoryCache_Flush();
if(Is_Error($IsFlush))
  @Trigger_Error(500);
#-------------------------------------------------------------------------------
return Array('Status'=>'Ok');
#-------------------------------------------------------------------------------

?>
