<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args = Args();
#-------------------------------------------------------------------------------
$TicketID      = (integer) @$Args['TicketID'];
$Theme         =  (string) @$Args['Theme'];
$PriorityID    =  (string) @$Args['PriorityID'];
$TargetGroupID = (integer) @$Args['TargetGroupID'];
$TargetUserID  = (integer) @$Args['TargetUserID'];
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('modules/Authorisation.mod')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
if(!$Theme)
  return new gException('THEME_NOT_FILLED','Укажите тему запроса');
#-------------------------------------------------------------------------------
$Config = Config();
#-------------------------------------------------------------------------------
if(!IsSet($Config['Edesks']['Priorities'][$PriorityID]))
  return new gException('WRONG_PRIORITY_ID','Неверный приоритет');
#-------------------------------------------------------------------------------
$Count = DB_Count('Groups',Array('ID'=>$TargetGroupID));
if(Is_Error($Count))
 return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
if(!$Count)
  return new gException('TARGET_USER_NOT_FOUND','Отвественный отдел не найден');
#-------------------------------------------------------------------------------
$Count = DB_Count('Users',Array('ID'=>$TargetUserID));
if(Is_Error($Count))
 return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
if(!$Count)
  return new gException('TARGET_USER_NOT_FOUND','Отвественный сотрудник не найден');
#-------------------------------------------------------------------------------
$UTicket = Array(
  #-----------------------------------------------------------------------------
  'PriorityID'    => $PriorityID,
  'TargetGroupID' => $TargetGroupID,
  'TargetUserID'  => $TargetUserID,
  'Theme'         => $Theme
);
#-------------------------------------------------------------------------------
$IsUpdate = DB_Update('Edesks',$UTicket,Array('ID'=>$TicketID));
if(Is_Error($IsUpdate))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
return Array('Status'=>'Ok');
#-------------------------------------------------------------------------------

?>
