<?php

#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
if(Is_Error(System_Load('modules/Authorisation.mod','classes/DOM.class.php')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Args = Args();
#-------------------------------------------------------------------------------
$DomainSchemeID = (string) @$Args['DomainSchemeID'];
#-------------------------------------------------------------------------------
$Columns = Array('*','(SELECT `Name` FROM `Registrators` WHERE `RegistratorID` = `Registrators`.`ID`) as `RegistratorName`');
#-------------------------------------------------------------------------------
$DomainScheme = DB_Select('DomainsSchemes',$Columns,Array('UNIQ','ID'=>$DomainSchemeID));
#-------------------------------------------------------------------------------
switch(ValueOf($DomainScheme)){
  case 'error':
    return ERROR | @Trigger_Error(500);
  case 'exception':
    return ERROR | @Trigger_Error(400);
  case 'array':
    #---------------------------------------------------------------------------
    $DOM = new DOM();
    #---------------------------------------------------------------------------
    $Links = &Links();
    # Коллекция ссылок
    $Links['DOM'] = &$DOM;
    #---------------------------------------------------------------------------
    if(Is_Error($DOM->Load('Window')))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $DOM->AddText('Title','Тариф домена');
    #---------------------------------------------------------------------------
    $Table = Array('Общая информация');
    #---------------------------------------------------------------------------
    $Table[] = Array('Доменная зона',$DomainScheme['Name']);
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Formats/Currency',$DomainScheme['CostOrder']);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Formats/Logic',$DomainScheme['IsActive']);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Table[] = Array('Тариф активен',$Comp);
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Formats/Logic',$DomainScheme['IsProlong']);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Table[] = Array('Возможность продления',$Comp);
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Formats/Currency',$DomainScheme['CostProlong']);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Table[] = Array('Стоимость продления',$Comp);
    #---------------------------------------------------------------------------
    $Table[] = Array('Регистратор',$DomainScheme['RegistratorName']);
    #---------------------------------------------------------------------------
    #---------------------------------------------------------------------------
    $Table[] = 'Ограничения';
    #---------------------------------------------------------------------------
    $Table[] = Array('Минимальное кол-во лет заказа',$DomainScheme['MinOrderYears']);
    #---------------------------------------------------------------------------
    $Table[] = Array('Максимальное кол-во лет делегирования',$DomainScheme['MaxActionYears']);
    #---------------------------------------------------------------------------
    $Table[] = Array('Кол-во дней до продления',$DomainScheme['DaysToProlong']);
    #---------------------------------------------------------------------------
    if($DomainScheme['MaxOrders'] > 0)
      $Table[] = Array('Максимальное число заказов',$DomainScheme['MaxOrders']);
    #---------------------------------------------------------------------------
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Tables/Standard',$Table);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $DOM->AddChild('Into',$Comp);
    #---------------------------------------------------------------------------
    if(Is_Error($DOM->Build(FALSE)))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    return Array('Status'=>'Ok','DOM'=>$DOM->Object);
  default:
    return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------

?>
