<?php

#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
if(Is_Error(System_Load('modules/Authorisation.mod','classes/DOM.class.php')))
	return ERROR | @Trigger_Error(500);

#if(!$GLOBALS['__USER']['IsAdmin'])
#	return "IN DEVELOP";

$Args = IsSet($Args)?$Args:Args();
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$DomainName	= (string) @$Args['DomainName'];


# проверить с точкой домен или нет, если надо - усечь


#-------------------------------------------------------------------------------
$DOM = new DOM();
#-------------------------------------------------------------------------------
$Links = &Links();
# Коллекция ссылок
$Links['DOM'] = &$DOM;
#-------------------------------------------------------------------------------
if(Is_Error($DOM->Load('Base')))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$DOM->AddAttribs('MenuLeft',Array('args'=>'User/Services'));
#-------------------------------------------------------------------------------
$DOM->AddText('Title','Услуги → Домены → Проверка домена');
#-------------------------------------------------------------------------------
$DOM->AddChild('Head',new Tag('SCRIPT',Array('type'=>'text/javascript','src'=>'SRC:{Js/WhoIs.js}')));
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Table = Array();
#-------------------------------------------------------------------------------
$Messages = Messages();
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Form/Input',Array('name'=>'DomainName','value'=>$DomainName,'onkeydown'=>'if(IsEnter(event)) document.location = "/DomainWhoIs?DomainName=" + document.forms.WhoIsForm.DomainName.value;','prompt'=>$Messages['Prompts']['Domain']['Name'],'type'=>'text'));
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Span = new Tag('SPAN',$Comp);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Form/Input',Array('type'=>'button','onclick'=>'document.location = "/DomainWhoIs?DomainName=" + document.forms.WhoIsForm.DomainName.value','value'=>'Проверить'));
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Span->AddChild($Comp);
#-------------------------------------------------------------------------------
$Table[] = Array('Доменное имя',$Span);
#-------------------------------------------------------------------------------


if($DomainName){
	#-------------------------------------------------------------------------------
	$Config = Config();
	#-------------------------------------------------------------------------------
	$Settings = $Config['Interface']['User']['Orders']['Domain']['DomainWhoIs'];
	#-------------------------------------------------------------------------------
	$Zones = Array();
	#-------------------------------------------------------------------------------
	$Table[] = 'Результаты проверки';
	#-------------------------------------------------------------------------------
	if($Settings['IsSchemesOnly']){
		#-------------------------------------------------------------------------------
		$__USER = $GLOBALS['__USER'];
		#-------------------------------------------------------------------------------
		$UniqID = UniqID('DomainSchemes');
		#-------------------------------------------------------------------------------
		$Comp = Comp_Load('Services/Schemes','DomainSchemes',$__USER['ID'],Array('Name','ServerID'),$UniqID);
		if(Is_Error($Comp))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
		$Columns = Array('ID','Name','ServerID','CostOrder');
		#-------------------------------------------------------------------------------
		$DomainSchemes = DB_Select($UniqID,$Columns,Array('SortOn'=>Array('SortID'),'Where'=>Array("`IsActive` = 'yes'")));
		#-------------------------------------------------------------------------------
		switch(ValueOf($DomainSchemes)){
		case 'error':
			return ERROR | @Trigger_Error(500);
		case 'exception':
			return new gException('NO_SUPPORTED_DOMAIN_ZONES','Тарифы на домены не настроены');
		case 'array':
			break;
		default:
			return ERROR | @Trigger_Error(101);
		}
		#-------------------------------------------------------------------------------
		foreach($DomainSchemes as $DomainScheme)
			$Zones[$DomainScheme['ID']] = Array('Name'=>$DomainScheme['Name'],'CostOrder'=>$DomainScheme['CostOrder']);
		#-------------------------------------------------------------------------------
	}else{
		#-------------------------------------------------------------------------------
		$DomainZones = System_XML('config/DomainZones.xml');
		if(Is_Error($DomainZones))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
		foreach($DomainZones as $DomainZone)
			$Zones[$DomainZone['Name']] = SPrintF('.%s',$DomainZone['Name']);
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	$Row = $Scripts = Array();
	#-------------------------------------------------------------------------------
	foreach(Array('Название домена','Статус','Цена в год','Сделать заказ') as $Text)
		$Row[] = new Tag('TD',Array('class'=>'Head'),$Text);
	#-------------------------------------------------------------------------------
	$Rows = Array($Row);
	#-------------------------------------------------------------------------------
	foreach(Array_Keys($Zones) as $Key){
		#-------------------------------------------------------------------------------
		$Row = Array();
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		# имя домена
		$Row[] = SPrintF('%s.%s',$DomainName,$Zones[$Key]['Name']);
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		# статус домена
		$Row[] = new Tag('TD',Array('class'=>'Standard'),new Tag('SPAN',Array('id'=>$Zones[$Key]['Name']),new Tag('IMG',Array('src'=>'SRC:{Images/load.gif}'))));
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		# цена
		$Summ = Comp_Load('Formats/Currency',$Zones[$Key]['CostOrder']);
		if(Is_Error($Summ))
			return ERROR | @Trigger_Error(500);
		$Row[] = $Summ;
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		# кнопка заказа
		$Row[] = 'заказать';
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		$Rows[] = $Row;
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		#$Tr = new Tag('TR',Array('style'=>'display: block;'));
		#$Tr->AddChild(new Tag('TD',Array('class'=>'Standard','colspan'=>4)));
		#$Rows[] = $Tr;
		$Rows[] = Array(new Tag('TD',Array('colspan'=>4,'style'=>'display: none;','id'=>SPrintF('%sInfo',$Zones[$Key]['Name']),'aaaa')));

		#if($Zones[$Key]['Name'] == 'ru')
		$Scripts[] = SPrintF("WhoIs('%s','%s');",$DomainName,$Zones[$Key]['Name']);
		#-------------------------------------------------------------------------------
	}



$DOM->AddAttribs('Body',Array('onload'=>Implode(' ',$Scripts)));



$Comp = Comp_Load('Tables/Extended',$Rows,Array('align'=>'center','width'=>'100%'));

if(Is_Error($Comp))

return ERROR | @Trigger_Error(500);

#-------------------------------------------------------------------------------

$Table[] = $Comp;





}








$Comp = Comp_Load('Tables/Standard',$Table);
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Form = new Tag('FORM',Array('name'=>'WhoIsForm','onsubmit'=>'return false;'),$Comp);
#-------------------------------------------------------------------------------
$NoBody = new Tag('NOBODY',$Form,new Tag('DIV',Array('id'=>'WhoIsInfo')));
#-------------------------------------------------------------------------------

$Comp = Comp_Load('Tab','User/Domain',$NoBody);
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$DOM->AddChild('Into',$Comp);
#-------------------------------------------------------------------------------
$Out = $DOM->Build();
#-------------------------------------------------------------------------------
if(Is_Error($Out))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
return $Out;
#-------------------------------------------------------------------------------

?>
