<?php

#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args = Args();
#-------------------------------------------------------------------------------
$HostingSchemeID = (string) @$Args['HostingSchemeID'];
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('modules/Authorisation.mod','classes/DOM.class.php')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$HostingScheme = DB_Select('HostingSchemes','*',Array('UNIQ','ID'=>$HostingSchemeID));
#-------------------------------------------------------------------------------
switch(ValueOf($HostingScheme)){
  case 'error':
    return ERROR | @Trigger_Error(500);
  case 'exception':
    return ERROR | @Trigger_Error(400);
  case 'array':
    #---------------------------------------------------------------------------
    $DOM = new DOM();
    #---------------------------------------------------------------------------
    $Links = &Links();
    # Коллекция ссылок
    $Links['DOM'] = &$DOM;
    #---------------------------------------------------------------------------
    if(Is_Error($DOM->Load('Window')))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $DOM->AddText('Title','Тариф хостинга');
    #---------------------------------------------------------------------------
    $Table = Array('Общая информация');
    #---------------------------------------------------------------------------
    $Table[] = Array('Название тарифа',$HostingScheme['Name']);
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Formats/Currency',$HostingScheme['CostDay']);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Table[] = Array('Цена 1 дн.',$Comp);
    #---------------------------------------------------------------------------
    #---------------------------------------------------------------------------
    $ServersGroup = DB_Select('ServersGroups','*',Array('UNIQ','ID'=>$HostingScheme['ServersGroupID']));
    if(!Is_Array($ServersGroup))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Table[] = Array('Группа серверов',$ServersGroup['Name']);
    #---------------------------------------------------------------------------
    #---------------------------------------------------------------------------
    $HardServer = DB_Select('Servers','*',Array('UNIQ','ID'=>$HostingScheme['HardServerID']));
    if(!Is_Array($HardServer)){
      $HardServerName = 'Любой сервер группы';
    }else{
      $HardServerName = $HardServer['Address'];
    }
    #---------------------------------------------------------------------------
    $Table[] = Array('Сервер размещения',$HardServerName);
    #---------------------------------------------------------------------------
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Formats/Logic',$HostingScheme['IsReselling']);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Table[] = Array('Права реселлера',$Comp);
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Formats/Logic',$HostingScheme['IsActive']);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Table[] = Array('Тариф активен',$Comp);
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Formats/Logic',$HostingScheme['IsProlong']);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Table[] = Array('Возможность продления',$Comp);
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Formats/Logic',$HostingScheme['IsSchemeChange']);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Table[] = Array('Возможность смены тарифа',$Comp);
    #---------------------------------------------------------------------------
    if($HostingScheme['MaxOrders'] > 0)
      $Table[] = Array('Максимальное число заказов',$HostingScheme['MaxOrders']);
    #---------------------------------------------------------------------------
    $Table[] = 'Общие ограничения';
    #---------------------------------------------------------------------------
    $Table[] = Array('Дисковое пространство',SPrintF("%u Мб.",$HostingScheme['QuotaDisk']));
    #---------------------------------------------------------------------------
    $Table[] = Array('Почтовые ящики',$HostingScheme['QuotaEmail']);
    #---------------------------------------------------------------------------
    $Table[] = Array('Кол-во доменов',$HostingScheme['QuotaDomains']);
    #---------------------------------------------------------------------------
    $Table[] = Array('FTP пользователи',$HostingScheme['QuotaFTP']);
    #---------------------------------------------------------------------------
    $Table[] = Array('Кол-во псевдонимов домена',$HostingScheme['QuotaParkDomains']);
    #---------------------------------------------------------------------------
    #---------------------------------------------------------------------------
    $Table[] = Array('Кол-во баз данных',$HostingScheme['QuotaDBs']);
    #---------------------------------------------------------------------------
    $Table[] = Array('Месячный трафик',SPrintF('%u Мб.',$HostingScheme['QuotaTraffic']));
    #---------------------------------------------------------------------------
    #---------------------------------------------------------------------------
    #---------------------------------------------------------------------------
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Formats/Logic',$HostingScheme['IsShellAccess']);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Table[] = Array('Secure Shell (SSH)',$Comp);
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Formats/Logic',$HostingScheme['IsSSLAccess']);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Table[] = Array('Secure Sockets Layer (SSL)',$Comp);
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Formats/Logic',$HostingScheme['IsCGIAccess']);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Table[] = Array('Common Gateway Interface (CGI)',$Comp);
    #---------------------------------------------------------------------------
    $SystemsIDs = Array();
    #---------------------------------------------------------------------------
    $Servers = DB_Select('Servers','Params',Array('Where'=>SPrintF('`ServersGroupID` = %u',$HostingScheme['ServersGroupID'])));
    #---------------------------------------------------------------------------
    switch(ValueOf($Servers)){
      case 'error':
        return ERROR | @Trigger_Error(500);
      case 'exception':
        # No more...
      break;
      case 'array':
        #-----------------------------------------------------------------------
        foreach($Servers as $Server)
	  $SystemsIDs[] = $Server['Params']['SystemID'];
      break;
      default:
        return ERROR | @Trigger_Error(101);
    }
    #---------------------------------------------------------------------------
    if(In_Array('IspManager4',$SystemsIDs)){
      #-------------------------------------------------------------------------
      $Table[] = 'Ограничения для ISPmanager';
      #-------------------------------------------------------------------------
      $Table[] = Array('Кол-во WWW доменов',$HostingScheme['QuotaWWWDomains']);
      #-------------------------------------------------------------------------
      $Table[] = Array('Кол-во почтовых доменов',$HostingScheme['QuotaEmailDomains']);
      #-------------------------------------------------------------------------
      $Table[] = Array('Кол-во пользователей баз данных',$HostingScheme['QuotaUsersDBs']);
      #-------------------------------------------------------------------------
      $Table[] = Array('Время выполения скриптов',SPrintF('%s секунд',$HostingScheme['MaxExecutionTime']));
      #-------------------------------------------------------------------------
      $Table[] = Array('Ограничение на процессор',SPrintF('%s%%',$HostingScheme['QuotaCPU']));
      #-------------------------------------------------------------------------
      $Table[] = Array('Ограничение на отправку писем',SPrintF('%s в час',$HostingScheme['mailrate']));
      #-------------------------------------------------------------------------
      $Comp = Comp_Load('Formats/Logic',$HostingScheme['IsSSIAccess']);
      if(Is_Error($Comp))
        return ERROR | @Trigger_Error(500);
      #-------------------------------------------------------------------------
      $Table[] = Array('Server Side Includes (SSI)',$Comp);
      #-------------------------------------------------------------------------
      $Comp = Comp_Load('Formats/Logic',$HostingScheme['IsPHPModAccess']);
      if(Is_Error($Comp))
        return ERROR | @Trigger_Error(500);
      #-------------------------------------------------------------------------
      $Table[] = Array('PHP как модуль',$Comp);
      #-------------------------------------------------------------------------
      $Comp = Comp_Load('Formats/Logic',$HostingScheme['IsPHPCGIAccess']);
      if(Is_Error($Comp))
        return ERROR | @Trigger_Error(500);
      #-------------------------------------------------------------------------
      $Table[] = Array('PHP как CGI',$Comp);
      #-------------------------------------------------------------------------
      $Comp = Comp_Load('Formats/Logic',$HostingScheme['IsPHPFastCGIAccess']);
      if(Is_Error($Comp))
        return ERROR | @Trigger_Error(500);
      #-------------------------------------------------------------------------
      $Table[] = Array('PHP как FastCGI',$Comp);
    }
    #---------------------------------------------------------------------------
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Tables/Standard',$Table);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $DOM->AddChild('Into',$Comp);
    #---------------------------------------------------------------------------
    if(Is_Error($DOM->Build(FALSE)))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    return Array('Status'=>'Ok','DOM'=>$DOM->Object);
  default:
    return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------

?>
