<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Args = Args();
#-------------------------------------------------------------------------------
$ISPswSchemeID = (string) @$Args['ISPswSchemeID'];
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('modules/Authorisation.mod','classes/DOM.class.php')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$ISPswScheme = DB_Select('ISPswSchemes','*',Array('UNIQ','ID'=>$ISPswSchemeID));
#-------------------------------------------------------------------------------
switch(ValueOf($ISPswScheme)){
  case 'error':
    return ERROR | @Trigger_Error(500);
  case 'exception':
    return ERROR | @Trigger_Error(400);
  case 'array':
    #---------------------------------------------------------------------------
    $DOM = new DOM();
    #---------------------------------------------------------------------------
    $Links = &Links();
    # Коллекция ссылок
    $Links['DOM'] = &$DOM;
    #---------------------------------------------------------------------------
    if(Is_Error($DOM->Load('Window')))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $DOM->AddText('Title','Тариф ПО ISPsystem');
    #---------------------------------------------------------------------------
    $Table = Array('Общая информация');
    #---------------------------------------------------------------------------
    $Table[] = Array('Название тарифа',$ISPswScheme['Name']);
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Formats/Currency',$ISPswScheme['CostDay']);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Table[] = Array('Цена 1 дн.',$Comp);
    #---------------------------------------------------------------------------
    #---------------------------------------------------------------------------
    #---------------------------------------------------------------------------
#    $Comp = Comp_Load('Formats/Logic',$ISPswScheme['IsReselling']);
#    if(Is_Error($Comp))
#      return ERROR | @Trigger_Error(500);
#    #---------------------------------------------------------------------------
#    $Table[] = Array('Права реселлера',$Comp);
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Formats/Logic',$ISPswScheme['IsActive']);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Table[] = Array('Тариф активен',$Comp);
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Formats/Logic',$ISPswScheme['IsProlong']);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Table[] = Array('Возможность продления',$Comp);
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Formats/Logic',$ISPswScheme['IsSchemeChange']);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $Table[] = Array('Возможность смены тарифа',$Comp);
    #---------------------------------------------------------------------------
    $Table[] = 'Общие ограничения';
    #---------------------------------------------------------------------------
#    $Table[] = Array('Дисковое пространство',SPrintF("%u Мб.",$ISPswScheme['QuotaDisk']));
#    #---------------------------------------------------------------------------
#    $Table[] = Array('Почтовые ящики',$ISPswScheme['QuotaEmail']);
#    #---------------------------------------------------------------------------
#    $Table[] = Array('Кол-во доменов',$ISPswScheme['QuotaDomains']);
#    #---------------------------------------------------------------------------
#    $Table[] = Array('FTP пользователи',$ISPswScheme['QuotaFTP']);
#    #---------------------------------------------------------------------------
#    $Table[] = Array('Кол-во псевдонимов домена',$ISPswScheme['QuotaParkDomains']);
#    #---------------------------------------------------------------------------
#    $Table[] = Array('Кол-во поддоменов',$ISPswScheme['QuotaSubDomains']);
#    #---------------------------------------------------------------------------
#    $Table[] = Array('Кол-во баз данных',$ISPswScheme['QuotaDBs']);
#    #---------------------------------------------------------------------------
#    $Table[] = Array('Месячный трафик',SPrintF('%u Мб.',$ISPswScheme['QuotaTraffic']));
#    #---------------------------------------------------------------------------
#    $Table[] = Array('Кол-во почтовых автоответчиков',$ISPswScheme['QuotaEmailAutoResp']);
#    #---------------------------------------------------------------------------
#    $Table[] = Array('Кол-во списков рассылки',$ISPswScheme['QuotaEmailLists']);
#    #---------------------------------------------------------------------------
#    $Table[] = Array('Кол-во пересылок почты',$ISPswScheme['QuotaEmailForwards']);
#    #---------------------------------------------------------------------------
#    $Comp = Comp_Load('Formats/Logic',$ISPswScheme['IsShellAccess']);
#    if(Is_Error($Comp))
#      return ERROR | @Trigger_Error(500);
#    #---------------------------------------------------------------------------
#    $Table[] = Array('Secure Shell (SSH)',$Comp);
#    #---------------------------------------------------------------------------
#    $Comp = Comp_Load('Formats/Logic',$ISPswScheme['IsSSLAccess']);
#    if(Is_Error($Comp))
#      return ERROR | @Trigger_Error(500);
#    #---------------------------------------------------------------------------
#    $Table[] = Array('Secure Sockets Layer (SSL)',$Comp);
#    #---------------------------------------------------------------------------
#    $Comp = Comp_Load('Formats/Logic',$ISPswScheme['IsCGIAccess']);
#    if(Is_Error($Comp))
#      return ERROR | @Trigger_Error(500);
#    #---------------------------------------------------------------------------
#    $Table[] = Array('Common Gateway Interface (CGI)',$Comp);
#    #---------------------------------------------------------------------------
#    $SystemsIDs = Array();
#    #---------------------------------------------------------------------------
#    $ISPswGroups = DB_Select('ISPswGroups','SystemID',Array('Where'=>SPrintF('`ServersGroupID` = %u',$ISPswScheme['ServersGroupID']),'GroupBy'=>'SystemID'));
#    #---------------------------------------------------------------------------
#    switch(ValueOf($ISPswGroups)){
#      case 'error':
#        return ERROR | @Trigger_Error(500);
#      case 'exception':
#        # No more...
#      break;
#      case 'array':
#        #-----------------------------------------------------------------------
#        foreach($ISPswGroups as $ISPswGroup)
#          $SystemsIDs[] = $ISPswGroup['SystemID'];
#      break;
#      default:
#        return ERROR | @Trigger_Error(101);
#    }
#    #---------------------------------------------------------------------------
    #---------------------------------------------------------------------------
    $Comp = Comp_Load('Tables/Standard',$Table);
    if(Is_Error($Comp))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    $DOM->AddChild('Into',$Comp);
    #---------------------------------------------------------------------------
    if(Is_Error($DOM->Build(FALSE)))
      return ERROR | @Trigger_Error(500);
    #---------------------------------------------------------------------------
    return Array('Status'=>'Ok','DOM'=>$DOM->Object);
  default:
    return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------

?>
