<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Order');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/

Debug(SPrintF('[comp/Triggers/Active]: ModeID = %s; Order = %s',$Order['ModeID'],print_r($Order['Row'],true)));


if(!IsSet($Order['Row']['ServerID']) || Is_Null($Order['Row']['ServerID'])){
	#-------------------------------------------------------------------------------
	Debug(SPrintF('[comp/Triggers/Active]: Для заказа OrderID = %u (%s) не задан сервер, невозможно определить сервис',$Order['Row']['OrderID'],$Order['ModeID']));
	#-------------------------------------------------------------------------------
	return TRUE;
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
# пробуем определить сервис, к которому относится услуга
$ServersGroup = DB_Select('ServersGroups',Array('*'),Array('UNIQ','Where'=>SPrintF('`ID` = (SELECT `ServersGroupID` FROM `Servers` WHERE `ID` = %u)',$Order['Row']['ServerID'])));
#-------------------------------------------------------------------------------
switch(ValueOf($ServersGroup)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return ERROR | @Trigger_Error(400);
case 'array':
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
Debug(SPrintF('[comp/Triggers/Active]: Params = %s',print_r($ServersGroup['Params'],true)));
#-------------------------------------------------------------------------------
if($ServersGroup['Params']['Count']){
	#-------------------------------------------------------------------------------
	Debug(SPrintF('[comp/Triggers/Active]: Необходимо активировать дополнительных услуг: %u',$ServersGroup['Params']['Count']));
	#-------------------------------------------------------------------------------
	for($i = 1; $i <= $ServersGroup['Params']['Count']; $i++){
		#-------------------------------------------------------------------------------
		$ServiceID	= $ServersGroup['Params'][(SPrintF('Service%u',$i))];
		$SchemeID	= $ServersGroup['Params'][(SPrintF('Scheme%u',$i))];
		$IsNoDuplicate	= $ServersGroup['Params'][(SPrintF('IsNoDuplicate%u',$i))];
		#-------------------------------------------------------------------------------
		Debug(SPrintF('[comp/Triggers/Active]: Создание заказа на услугу #%u; сервис = %u; тариф = %u; дубликаты = %s',$i,$ServiceID,$SchemeID,(($IsNoDuplicate)?'TRUE':'FALSE')));
		#-------------------------------------------------------------------------------
		# проверяем наличие такой услуги у юзера

		# проверяем наличие такого тарифа для такой услуги, и его активность

		# заказываем услугу

		# оплачиваем услугу на минимальное число дней (или юзать параметры? или юзать срок оплаты основной услуги?)

		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return TRUE;
#-------------------------------------------------------------------------------

?>
