<?php
/**
 *
 *  Joonte Billing System
 *
 *  Copyright © 2020 Alex Keda, for www.host-food.ru
 *
 */

class DNSmanagerOrdersSuspendedMsg extends Message {
	#-------------------------------------------------------------------------------
	public function __construct(array $params, $toUser) {
		#-------------------------------------------------------------------------------
		parent::__construct('DNSmanagerOrdersSuspended', $toUser, $params);
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	public function getParams() {
		#-------------------------------------------------------------------------------
		$DNSmanagerScheme = DB_Select('DNSmanagerSchemes', Array('*'), Array('UNIQ', 'Where' => SPrintF('`ID` = %u',$this->params['SchemeID'])));
		#-------------------------------------------------------------------------------
		if(!Is_Array($DNSmanagerScheme))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
		$this->params['DNSmanagerScheme'] = $DNSmanagerScheme;
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		// ссылка на продление заказа
		$Ajax = SPrintF("ShowWindow('/DNSmanagerOrderPay',{DNSmanagerOrderID:'%s'});",$this->params['ID']);
		#-------------------------------------------------------------------------------
		$ProlongLink = Comp_Load('Formats/System/EvalLink',$Ajax);
		if(Is_Error($ProlongLink))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
		$this->params['ProlongLink'] = $ProlongLink;
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		// ссылка на смену тарифа
		$Ajax = SPrintF("ShowWindow('/DNSmanagerOrderSchemeChange',{DNSmanagerOrderID:'%s'});",$this->params['ID']);
		#-------------------------------------------------------------------------------
		$SchemeChangeLink = Comp_Load('Formats/System/EvalLink',$Ajax);
		if(Is_Error($SchemeChangeLink))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
		$this->params['SchemeChangeLink'] = $SchemeChangeLink;
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		return $this->params;
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
}

