<?php
/**
 *
 *  Joonte Billing System
 *
 *  Copyright © 2020 Alex Keda, for www.host-food.ru
 *
 */

class HostingOrdersSuspendedMsg extends Message {
	#-------------------------------------------------------------------------------
	public function __construct(array $params, $toUser) {
		#-------------------------------------------------------------------------------
		parent::__construct('HostingOrdersSuspended', $toUser, $params);
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	public function getParams() {
		#-------------------------------------------------------------------------------
		$HostingScheme = DB_Select('HostingSchemes', Array('*'), Array('UNIQ', 'Where' => SPrintF('`ID` = %u',$this->params['SchemeID'])));
		#-------------------------------------------------------------------------------
		if(!Is_Array($HostingScheme))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
		$this->params['HostingScheme'] = $HostingScheme;
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		// ссылка на продление заказа
		$Ajax = SPrintF("ShowWindow('/HostingOrderPay',{HostingOrderID:'%s'});",$this->params['ID']);
		#-------------------------------------------------------------------------------
		$ProlongLink = Comp_Load('Formats/System/EvalLink',$Ajax);
		if(Is_Error($ProlongLink))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
		$this->params['ProlongLink'] = $ProlongLink;
		$this->params['ProlongLink'] = SPrintF('%s://%s/HostingOrders/%u/',Url_Scheme(),HOST_ID,$this->params['OrderID']);
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		// ссылка на смену тарифа
		$this->params['ProlongLink'] = SPrintF('%s://%s/HostingOrders/%u/',Url_Scheme(),HOST_ID,$this->params['OrderID']);
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
		return $this->params;
		#-------------------------------------------------------------------------------
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
}

