<?php

#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
if(Is_Error(System_Load('classes/DOM.class.php')))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Links = &Links();
# Коллекция ссылок
#-------------------------------------------------------------------------------
$DOM = &$Links['DOM'];
#-------------------------------------------------------------------------------
$DOM->AddChild('Head',new Tag('SCRIPT',Array('type'=>'text/javascript','src'=>'SRC:{Js/WhoIs.js}')));
#-------------------------------------------------------------------------------
$Table = Array();
#-------------------------------------------------------------------------------
$Messages = Messages();
#-------------------------------------------------------------------------------
$Comp = Comp_Load(
		'Form/Input',
		Array(
			'name'		=> 'DomainName',
			'size'		=> 12,
			'onkeydown'	=> 'if(IsEnter(event)) WhoIs();',
			'prompt'	=> $Messages['Prompts']['Domain']['Name'],
			'type'		=> 'text'
			)
		);
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Span = new Tag('SPAN',$Comp);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Config = Config();
#-------------------------------------------------------------------------------
$Settings = $Config['Interface']['User']['Orders']['Domain']['DomainWhoIs'];
#-------------------------------------------------------------------------------
$Options = Array();
#-------------------------------------------------------------------------------
if($Settings['IsSchemesOnly']){
	#-------------------------------------------------------------------------------
	$__USER = $GLOBALS['__USER'];
	#-------------------------------------------------------------------------------
	$UniqID = UniqID('DomainSchemes');
	#-------------------------------------------------------------------------------
	$Comp = Comp_Load('Services/Schemes','DomainSchemes',$__USER['ID'],Array('Name','ServerID'),$UniqID);
	if(Is_Error($Comp))
		return ERROR | @Trigger_Error(500);
	#-------------------------------------------------------------------------------
	$Columns = Array('ID','Name','ServerID','CostProlong','(SELECT `Params` FROM `Servers` WHERE `ServerID` = `Servers`.`ID`) as `Params`');
	#-------------------------------------------------------------------------------
	$DomainSchemes = DB_Select($UniqID,$Columns,Array('SortOn'=>Array('SortID'),'Where'=>Array("`IsActive` = 'yes'")));
	#-------------------------------------------------------------------------------
	switch(ValueOf($DomainSchemes)){
	case 'error':
		return ERROR | @Trigger_Error(500);
	case 'exception':
		return new gException('NO_SUPPORTED_DOMAIN_ZONES','Тарифы на домены не настроены');
	case 'array':
		break;
	default:
		return ERROR | @Trigger_Error(101);
	}
	#-------------------------------------------------------------------------------
	foreach($DomainSchemes as $DomainScheme)
		$Options[$DomainScheme['Name']] = SPrintF('.%s',$DomainScheme['Name']);
	#-------------------------------------------------------------------------------
}else{
	#-------------------------------------------------------------------------------
	$DomainZones = System_XML('config/DomainZones.xml');
	if(Is_Error($DomainZones))
		return ERROR | @Trigger_Error(500);
	#-------------------------------------------------------------------------------
	foreach($DomainZones as $DomainZone)
		$Options[$DomainZone['Name']] = SPrintF('.%s',$DomainZone['Name']);
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Form/Select',Array('name'=>'DomainZone'),$Options);
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Span->AddChild($Comp);
#-------------------------------------------------------------------------------
$Table[] = Array('Доменное имя',$Span);
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Form/Input',Array('type'=>'button','onclick'=>'WhoIs();','value'=>'Проверить'));
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Table[] = $Comp;
#-------------------------------------------------------------------------------
$Comp = Comp_Load('Tables/Standard',$Table);
if(Is_Error($Comp))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Form = new Tag('FORM',Array('name'=>'WhoIsForm','onsubmit'=>'return false;'),$Comp);
#-------------------------------------------------------------------------------
$NoBody = new Tag('NOBODY',$Form,new Tag('DIV',Array('id'=>'WhoIsInfo')));
#-------------------------------------------------------------------------------
return $NoBody;
#-------------------------------------------------------------------------------

?>
