<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Replace');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Replace['HostingOrder'] = $Replace['Row'];
#-------------------------------------------------------------------------------
$HostingOrder = &$Replace['HostingOrder'];
#-------------------------------------------------------------------------------
$StatusDate = Comp_Load('Formats/Date/Standard',$HostingOrder['StatusDate']);
if(Is_Error($StatusDate))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$HostingOrder['StatusDate'] = $StatusDate;
#-------------------------------------------------------------------------------
$Number = Comp_Load('Formats/Order/Number',$HostingOrder['OrderID']);
if(Is_Error($Number))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$HostingOrder['Number'] = $Number;
#-------------------------------------------------------------------------------
$Server = DB_Select('HostingServers',Array('Address','Url','Ns1Name','Ns2Name'),Array('UNIQ','ID'=>$HostingOrder['ServerID']));
if(!Is_Array($Server))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$HostingOrder['Server'] = $Server;
#-------------------------------------------------------------------------------
$Message = <<<EOT
Здравствуйте, %User.Name%!

Уведомляем Вас о том, что %HostingOrder.StatusDate% Ваш заказ №%HostingOrder.Number% на хостинг был успешно активирован.

Ваши данные для доступа к аккаунту на сервере:
  * Адрес панели управления:
      %HostingOrder.Server.Url%
  * Логин:
      %HostingOrder.Login%
  * Пароль:
      %HostingOrder.Password%
  * Доменное имя:
      %HostingOrder.Domain%
  * FTP, POP3, SMTP, IMAP:
      %HostingOrder.Server.Address%
Сервера имен:
  * Первичный сервер имен:
      %HostingOrder.Server.Ns1Name%
  * Вторичный сервер имен:
      %HostingOrder.Server.Ns2Name%

Сохраните эти данные в надежном месте, они потребуются для дальнейшей работы.

%From.Sign%
EOT;
#-------------------------------------------------------------------------------
$Replace = Array_ToLine($Replace,'%');
#-------------------------------------------------------------------------------
foreach(Array_Keys($Replace) as $Key)
  $Message = Str_Replace($Key,$Replace[$Key],$Message);
#-------------------------------------------------------------------------------
return Array('Theme'=>'Заказ хостинга успешно активирован','Message'=>$Message);
#-------------------------------------------------------------------------------

?>
