<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Replace');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Replace['HostID'] = HOST_ID;
#-------------------------------------------------------------------------------
$Number = Comp_Load('Formats/Edesk/Number',$Replace['TicketID']);
if(Is_Error($Number))
  return ERROR | Trigger_Error(500);
#-------------------------------------------------------------------------------
$Replace['Number'] = $Number;
#-------------------------------------------------------------------------------
$Message = <<<EOT
Здравствуйте, %User.Name%!

В службу поддержки поступило новое сообщение по запросу №%Number%, с темой: %Theme%.

---
%Message%
---

Для просмотра истории запроса или нового ответа, пройдите по ссылке:

http://%HostID%/Administrator/Tickets

%From.Sign%
EOT;
#-------------------------------------------------------------------------------
$Replace = Array_ToLine($Replace,'%');
#-------------------------------------------------------------------------------
foreach(Array_Keys($Replace) as $Key)
  $Message = Str_Replace($Key,$Replace[$Key],$Message);
#-------------------------------------------------------------------------------
$Theme = 'Ответ на запрос №%Number% с темой: %Theme%';
#-------------------------------------------------------------------------------
foreach(Array_Keys($Replace) as $Key)
  $Theme = Str_Replace($Key,$Replace[$Key],$Theme);
#-------------------------------------------------------------------------------
return Array('Theme'=>$Theme,'Message'=>$Message);
#-------------------------------------------------------------------------------

?>
