<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Replace');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Replace['HostID'] = HOST_ID;
#-------------------------------------------------------------------------------
$Message = <<<EOT
Здравствуйте, %User.Name%!

По Вашему запросу, был восстановлен Ваш пароль для входа в биллинговую систему.

Ваши данные для входа в биллинговую систему:
  * Адрес для входа:
      http://%HostID%/Logon
  * Ваш электронный адрес (используется для входа в биллинговую систему):
      %User.Email%
  * Ваш новый пароль:
      %Password%

Сохраните эти данные в надежном месте, они потребуются для дальнейшей работы.

%From.Sign%
EOT;
#-------------------------------------------------------------------------------
$Replace = Array_ToLine($Replace,'%');
#-------------------------------------------------------------------------------
foreach(Array_Keys($Replace) as $Key)
  $Message = Str_Replace($Key,$Replace[$Key],$Message);
#-------------------------------------------------------------------------------
return Array('Theme'=>'Ваши данные для входа','Message'=>$Message);
#-------------------------------------------------------------------------------

?>
