<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
if(Is_Error(System_Load('modules/Authorisation.mod')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Args = Args();
#-------------------------------------------------------------------------------
$DSServersGroupID	= (integer) @$Args['DSServersGroupID'];
$Name			=  (string) @$Args['Name'];
//$FunctionID		=  (string) @$Args['FunctionID'];
$Comment		=  (string) @$Args['Comment'];
$SortID			= (integer) @$Args['SortID'];
$SystemID		=  (string) @$Args['SystemID'];
#-------------------------------------------------------------------------------
if(!$Name)
  return new gException('NAME_IS_EMPTY','Не указано название группы');
#-------------------------------------------------------------------------------
$Config = Config();
#-------------------------------------------------------------------------------
if(!$Comment)
	return new gException('COMMENT_IS_EMPTY','Не указан комментарий');
#-------------------------------------------------------------------------------
if(!IsSet($Config['DS']['Systems'][$SystemID]))
	return new gException('SYSTEM_NOT_FOUND','Система управления не найдена');
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Answer = Array('Status'=>'Ok');
#-------------------------------------------------------------------------------
$IDSServersGroup = Array(
  #-----------------------------------------------------------------------------
  'Name'	=> $Name,
  //'FunctionID'=> $FunctionID,
  'Comment'	=> $Comment,
  'SystemID'	=> $SystemID,
  'SortID'	=> $SortID
);
#-------------------------------------------------------------------------------
if($DSServersGroupID){
  #-----------------------------------------------------------------------------
  $IsUpdate = DB_Update('DSServersGroups',$IDSServersGroup,Array('ID'=>$DSServersGroupID));
  if(Is_Error($IsUpdate))
    return ERROR | @Trigger_Error(500);
}else{
  #-----------------------------------------------------------------------------
  $ServersGroupID = DB_Insert('DSServersGroups',$IDSServersGroup);
  if(Is_Error($ServersGroupID))
    return ERROR | @Trigger_Error(500);
  #-----------------------------------------------------------------------------
  $Answer['ServersGroupID'] = $ServersGroupID;
}
#-------------------------------------------------------------------------------
return $Answer;
#-------------------------------------------------------------------------------

?>
