<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
if(Is_Error(System_Load('modules/Authorisation.mod')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Args = Args();
#-------------------------------------------------------------------------------
$ExtraIPsGroupID = (integer) @$Args['ExtraIPsGroupID'];
$Name                  =  (string) @$Args['Name'];
//$FunctionID            =  (string) @$Args['FunctionID'];
$Comment               =  (string) @$Args['Comment'];
$SortID                = (integer) @$Args['SortID'];
#-------------------------------------------------------------------------------
if(!$Name)
  return new gException('NAME_IS_EMPTY','Не указано название группы');
#-------------------------------------------------------------------------------
$Config = Config();
#-------------------------------------------------------------------------------
//$Functions = $Config['ExtraIP']['Balancing']['Functions'];
//#-------------------------------------------------------------------------------
//if(!IsSet($Functions[$FunctionID]))
//  return new gException('WRONG_FUNCTION_ID','Неверная функция балансировки');
#-------------------------------------------------------------------------------
if(!$Comment)
  return new gException('COMMENT_IS_EMPTY','Не указан комментарий');
#-------------------------------------------------------------------------------
$Answer = Array('Status'=>'Ok');
#-------------------------------------------------------------------------------
$IExtraIPsGroup = Array(
  #-----------------------------------------------------------------------------
  'Name'       => $Name,
  //'FunctionID' => $FunctionID,
  'Comment'    => $Comment,
  'SortID'     => $SortID
);
#-------------------------------------------------------------------------------
if($ExtraIPsGroupID){
  #-----------------------------------------------------------------------------
  $IsUpdate = DB_Update('ExtraIPsGroups',$IExtraIPsGroup,Array('ID'=>$ExtraIPsGroupID));
  if(Is_Error($IsUpdate))
    return ERROR | @Trigger_Error(500);
}else{
  #-----------------------------------------------------------------------------
  $sGroupID = DB_Insert('ExtraIPsGroups',$IExtraIPsGroup);
  if(Is_Error($sGroupID))
    return ERROR | @Trigger_Error(500);
  #-----------------------------------------------------------------------------
  $Answer['sGroupID'] = $sGroupID;
}
#-------------------------------------------------------------------------------
return $Answer;
#-------------------------------------------------------------------------------

?>
