<?php

#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
if(Is_Error(System_Load('modules/Authorisation.mod')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Args = Args();
#-------------------------------------------------------------------------------
$ISPswGroupID = (integer) @$Args['ISPswGroupID'];
$Name                  =  (string) @$Args['Name'];
$Comment               =  (string) @$Args['Comment'];
$SortID                = (integer) @$Args['SortID'];
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(!Is_Array(SelectServerSettingsByService(51000))){
	#-------------------------------------------------------------------------------
	$Exception =  new gException('BILLMANAGER_SETTINGS_NOT_FOUND_2','Дополнения -> Мастера настройки -> Сервера');
	#-------------------------------------------------------------------------------
	return new gException('BILLMANAGER_SETTINGS_NOT_FOUND_1','Для создания группы ПО необходимо создать группу серверов для сервиса ISPsw, а также активный сервер входящий в эту группу. Для этого, пройдите в следующий раздел биллинговой системы:',$Exception);
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(!$Name)
	return new gException('NAME_IS_EMPTY','Не указано название группы');
#-------------------------------------------------------------------------------
$Config = Config();
#-------------------------------------------------------------------------------
//$Functions = $Config['ISPsw']['Balancing']['Functions'];
//#-------------------------------------------------------------------------------
//if(!IsSet($Functions[$FunctionID]))
//  return new gException('WRONG_FUNCTION_ID','Неверная функция балансировки');
#-------------------------------------------------------------------------------
if(!$Comment)
  return new gException('COMMENT_IS_EMPTY','Не указан комментарий');
#-------------------------------------------------------------------------------
$Answer = Array('Status'=>'Ok');
#-------------------------------------------------------------------------------
$IISPswGroup = Array(
  #-----------------------------------------------------------------------------
  'Name'       => $Name,
  //'FunctionID' => $FunctionID,
  'Comment'    => $Comment,
  'SortID'     => $SortID
);
#-------------------------------------------------------------------------------
if($ISPswGroupID){
  #-----------------------------------------------------------------------------
  $IsUpdate = DB_Update('ISPswGroups',$IISPswGroup,Array('ID'=>$ISPswGroupID));
  if(Is_Error($IsUpdate))
    return ERROR | @Trigger_Error(500);
}else{
  #-----------------------------------------------------------------------------
  $ServersGroupID = DB_Insert('ISPswGroups',$IISPswGroup);
  if(Is_Error($ServersGroupID))
    return ERROR | @Trigger_Error(500);
  #-----------------------------------------------------------------------------
  $Answer['ServersGroupID'] = $ServersGroupID;
}
#-------------------------------------------------------------------------------
return $Answer;
#-------------------------------------------------------------------------------

?>
