<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
#-------------------------------------------------------------------------------
if(Is_Error(System_Load('modules/Authorisation.mod')))
	return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Args = Args();
#-------------------------------------------------------------------------------
$ProxyOrderID	= (integer) @$Args['ProxyOrderID'];
$ServerID	= (integer) @$Args['ServerID'];
$DaysReserved	= (integer) @$Args['DaysReserved'];
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(!$DaysReserved)
	return new gException('DAYS_NOT_DEFINED','Кол-во дней компенсации не указано');
#-------------------------------------------------------------------------------
if($ProxyOrderID){
	#-------------------------------------------------------------------------------
	$ProxyOrder = DB_Select('ProxyOrdersOwners',Array('StatusID','OrderID'),Array('UNIQ','ID'=>$ProxyOrderID));
	#-------------------------------------------------------------------------------
	switch(ValueOf($ProxyOrder)){
	case 'error':
		return ERROR | @Trigger_Error(500);
	case 'exception':
		return new gException('HOSTING_ORDER_NOT_FOUND','Заказ на прокси-сервер не найден');
	case 'array':
		#-------------------------------------------------------------------------------
		if($ProxyOrder['StatusID'] != 'Active')
			return new gException('HOSTING_ORDER_NOT_ACTIVE','Заказ прокси-сервер не активен');
		#-------------------------------------------------------------------------------
		break;
		#-------------------------------------------------------------------------------
	default:
		return ERROR | @Trigger_Error(101);
	}
	#-------------------------------------------------------------------------------
}else{
	#-------------------------------------------------------------------------------
	$Count = DB_Count('Servers',Array('ID'=>$ServerID));
	if(Is_Error($Count))
		return ERROR | @Trigger_Error(500);
	#-------------------------------------------------------------------------------
	if(!$Count)
		return new gException('SERVER_NOT_FOUND','Сервер прокси не найден');
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$ProxyOrders = DB_Select('ProxyOrdersOwners',Array('ID','OrderID','(SELECT `CostDay` FROM `ProxySchemes` WHERE `ProxySchemes`.`ID` = `ProxyOrdersOwners`.`SchemeID`) as `CostDay`'),$ProxyOrderID?Array('ID'=>$ProxyOrderID):Array('Where'=>SPrintF("(SELECT `ServerID` FROM `OrdersOwners` WHERE `ProxyOrdersOwners`.`OrderID` = `OrdersOwners`.`ID`) = %u AND `StatusID` = 'Active'",$ServerID)));
#-------------------------------------------------------------------------------
switch(ValueOf($ProxyOrders)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return new gException('HOSTING_ORDERS_NOT_FOUND','Нет активных заказов на прокси-сервера, принадлежащих данному серверу');
case 'array':
	#-------------------------------------------------------------------------------
	foreach($ProxyOrders as $ProxyOrder){
		#-------------------------------------------------------------------------------
		$IOrdersConsider = Array(
					'OrderID'	=> $ProxyOrder['OrderID'],
					'DaysReserved'	=> $DaysReserved,
					'Cost'		=> $ProxyOrder['CostDay'],
					'Discont'	=> 1
					);
		#-------------------------------------------------------------------------------
		$OrdersConsiderID = DB_Insert('OrdersConsider',$IOrdersConsider);
		#-------------------------------------------------------------------------------
		if(Is_Error($OrdersConsiderID))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
		$IsUpdate = DB_Update('OrdersConsider',Array('DaysConsidered'=>0),Array('ID'=>$OrdersConsiderID));
		if(Is_Error($IsUpdate))
			return ERROR | @Trigger_Error(500);
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	return Array('Status'=>'Ok','Orders'=>Count($ProxyOrders));
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
?>
