<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
if(Is_Error(System_Load('modules/Authorisation.mod')))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Args = Args();
#-------------------------------------------------------------------------------
$VPSServersGroupID = (integer) @$Args['VPSServersGroupID'];
$Name                  =  (string) @$Args['Name'];
//$FunctionID            =  (string) @$Args['FunctionID'];
$Comment               =  (string) @$Args['Comment'];
$SortID                = (integer) @$Args['SortID'];
#-------------------------------------------------------------------------------
if(!$Name)
  return new gException('NAME_IS_EMPTY','Не указано название группы');
#-------------------------------------------------------------------------------
$Config = Config();
#-------------------------------------------------------------------------------
//$Functions = $Config['VPS']['Balancing']['Functions'];
//#-------------------------------------------------------------------------------
//if(!IsSet($Functions[$FunctionID]))
//  return new gException('WRONG_FUNCTION_ID','Неверная функция балансировки');
#-------------------------------------------------------------------------------
if(!$Comment)
  return new gException('COMMENT_IS_EMPTY','Не указан комментарий');
#-------------------------------------------------------------------------------
$Answer = Array('Status'=>'Ok');
#-------------------------------------------------------------------------------
$IVPSServersGroup = Array(
  #-----------------------------------------------------------------------------
  'Name'       => $Name,
  //'FunctionID' => $FunctionID,
  'Comment'    => $Comment,
  'SortID'     => $SortID
);
#-------------------------------------------------------------------------------
if($VPSServersGroupID){
  #-----------------------------------------------------------------------------
  $IsUpdate = DB_Update('VPSServersGroups',$IVPSServersGroup,Array('ID'=>$VPSServersGroupID));
  if(Is_Error($IsUpdate))
    return ERROR | @Trigger_Error(500);
}else{
  #-----------------------------------------------------------------------------
  $ServersGroupID = DB_Insert('VPSServersGroups',$IVPSServersGroup);
  if(Is_Error($ServersGroupID))
    return ERROR | @Trigger_Error(500);
  #-----------------------------------------------------------------------------
  $Answer['ServersGroupID'] = $ServersGroupID;
}
#-------------------------------------------------------------------------------
return $Answer;
#-------------------------------------------------------------------------------

?>
