<?php


#-------------------------------------------------------------------------------
if(IsSet($_GET['Source'])){
  #-----------------------------------------------------------------------------
  Highlight_String(File_Get_Contents(__FILE__));
  #-----------------------------------------------------------------------------
  Exit;
}
#-------------------------------------------------------------------------------
Header('Content-type: text/plain; charset=utf-8');
#-------------------------------------------------------------------------------
# Электронный адрес администратора система
$Email = 'admin@company.com';
# Пароль администратора системы
$Password = 'default';
# Доменное имя на котором функционирует система
$Domain = 'joonte.com';
#-------------------------------------------------------------------------------
$TestID = 1;
#-------------------------------------------------------------------------------
# Обращение к службе WhoIs и вывод прямой ссылки на заказ после регистрации
#-------------------------------------------------------------------------------
if($TestID == 1){
  #-----------------------------------------------------------------------------
  $DomainName = 'my-super-domain';
  $DomainZone = 'ru';
  #-----------------------------------------------------------------------------
  $Params = Array(
    'DomainName'     => $DomainName,
    'DomainZone'     => $DomainZone,
    'XMLHttpRequest' => TRUE
  );
  #-----------------------------------------------------------------------------
  $Query = Http_Build_Query($Params);
  #-----------------------------------------------------------------------------
  $Answer = File_Get_Contents("http://{$Domain}/API/WhoIs?{$Query}");
  if(!$Answer)
    Exit('Request error');
  #-----------------------------------------------------------------------------
  $Answer = @JSON_Decode($Answer,TRUE);
  if(!$Answer)
    Exit('Bad answer');
  #-----------------------------------------------------------------------------
  switch($Answer['Status']){
    case 'Error':
      #-------------------------------------------------------------------------
      $Error = $Answer['Error'];
      #-------------------------------------------------------------------------
      Exit($Error['String']);
    case 'Exception':
      #-------------------------------------------------------------------------
      $Exception = $Answer['Exception'];
      #-------------------------------------------------------------------------
      Exit($Exception['String']);
    case 'Fail':
      Exit('WhoIs server connection error');
    case 'Borrowed':
      #-------------------------------------------------------------------------
      print_r($Answer);
      #-------------------------------------------------------------------------
      Exit('Доменное имя занято');
    case 'Free':
      #-------------------------------------------------------------------------
      # Поиск идентификатора тарифа по имени зоны
      #-------------------------------------------------------------------------
      $Params = Array(
        'Email'          => $Email,
        'Password'       => $Password,
        'XMLHttpRequest' => TRUE,
        'TableID'        => 'DomainsSchemes',
        'ColumnsIDs'     => 'ID',
        'Conditions'     => "Name={$DomainZone}"
      );
      #-------------------------------------------------------------------------
      $Query = Http_Build_Query($Params);
      #-------------------------------------------------------------------------
      $Answer = File_Get_Contents("http://{$Domain}/Administrator/API/SelectDB?{$Query}");
      if(!$Answer)
        Exit('Request error');
      #-------------------------------------------------------------------------
      $Answer = @JSON_Decode($Answer,TRUE);
      if(!$Answer)
        Exit('Bad answer');
      #-------------------------------------------------------------------------
      switch($Answer['Status']){
        case 'Error':
          #---------------------------------------------------------------------
          $Error = $Answer['Error'];
          #---------------------------------------------------------------------
          Exit($Error['String']);
        case 'Exception':
          #---------------------------------------------------------------------
          $Exception = $Answer['Exception'];
          #---------------------------------------------------------------------
          Exit($Exception['String']);
        case 'Ok':
          #---------------------------------------------------------------------
          $DomainScheme = Current($Answer['Rows']);
          #---------------------------------------------------------------------
          $DomainSchemeID = $DomainScheme['ID'];
          #---------------------------------------------------------------------
          $Link = Base64_Encode("ShowWindow('/DomainOrder',{DomainName:'{$DomainName}',DomainSchemeID:{$DomainSchemeID},StepID:2});");
          #---------------------------------------------------------------------
          Exit("Доменное имя свободно, перейти к регистрации: http://{$Domain}/UserRegister?Eval={$Link}");
          #---------------------------------------------------------------------
          Exit;
        default:
          Exit('Wrong status');
      }
    default:
      Exit('Wrong status');
  }
}
#-------------------------------------------------------------------------------
# Получение списка тарифов на хостинг, аналогично можно получить для доменов
# обратившись к таблице DomainsSchemes, а для новостей к таблице News
#-------------------------------------------------------------------------------
if($TestID == 2){
  #-----------------------------------------------------------------------------
  $Params = Array(
    'Email'          => $Email,
    'Password'       => $Password,
    'XMLHttpRequest' => TRUE,
    'TableID'        => 'HostingSchemes',
    'ColumnsIDs'     => Array('ID','Name'),
    'SortOn'         => 'ID',
    'IsDesc'         => FALSE,
#    'Conditions'     => 'Name=Визитка',
    'Limits'         => Array(1,100)
  );
  #-----------------------------------------------------------------------------
  $Query = Http_Build_Query($Params);
  #-----------------------------------------------------------------------------
  $Answer = File_Get_Contents("http://{$Domain}/Administrator/API/SelectDB?{$Query}");
  if(!$Answer)
    Exit('Request error');
  #-----------------------------------------------------------------------------
  $Answer = @JSON_Decode($Answer,TRUE);
  if(!$Answer)
    Exit('Bad answer');
  #-----------------------------------------------------------------------------
  switch($Answer['Status']){
    case 'Error':
      #-------------------------------------------------------------------------
      $Error = $Answer['Error'];
      #-------------------------------------------------------------------------
      Exit($Error['String']);
    case 'Exception':
      #-------------------------------------------------------------------------
      $Exception = $Answer['Exception'];
      #-------------------------------------------------------------------------
      Exit($Exception['String']);
    case 'Ok':
      #-------------------------------------------------------------------------
      $Schemes = $Answer['Rows'];
      #-------------------------------------------------------------------------
      foreach($Schemes as $Scheme)
        echo "{$Scheme['ID']} - {$Scheme['Name']}\n";
      #-------------------------------------------------------------------------
      Exit;
    default:
      Exit('Wrong status');
  }
}
#-------------------------------------------------------------------------------

?>
