<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Replace');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$DomainOrder = &$Replace['DomainOrder'];
#-------------------------------------------------------------------------------
$TimeRemainder = Comp_Load('Formats/Date/Remainder',($DomainOrder['StatusDate'] + 2678400 - Time()));
if(Is_Error($TimeRemainder))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$DomainOrder['TimeRemainder'] = $TimeRemainder;
#-------------------------------------------------------------------------------
$Number = Comp_Load('Formats/Order/Number',$DomainOrder['OrderID']);
if(Is_Error($Number))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$DomainOrder['Number'] = $Number;
#-------------------------------------------------------------------------------
$Message = <<<EOT
Здравствуйте, %User.Name%!

Уведомляем Вас о том, оканчивается срок блокировки Вашего заказа №%DomainOrder.Number%, на регистрацию домена [%DomainOrder.DomainName%.%DomainOrder.Name%]. До удаления заказа %DomainOrder.TimeRemainder%.

%From.Sign%
EOT;
#-------------------------------------------------------------------------------
$Replace = Array_ToLine($Replace,'%');
#-------------------------------------------------------------------------------
foreach(Array_Keys($Replace) as $Key)
  $Message = Str_Replace($Key,$Replace[$Key],$Message);
#-------------------------------------------------------------------------------
return Array('Theme'=>'Оканчивается срок блокировки заказа на домен','Message'=>$Message);
#-------------------------------------------------------------------------------

?>
