<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Replace');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Replace['DomainOrder'] = $Replace['Row'];
#-------------------------------------------------------------------------------
$DomainOrder = &$Replace['DomainOrder'];
#-------------------------------------------------------------------------------
$StatusDate = Comp_Load('Formats/Date/Standard',$DomainOrder['StatusDate']);
if(Is_Error($StatusDate))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$DomainOrder['StatusDate'] = $StatusDate;
#-------------------------------------------------------------------------------
$Number = Comp_Load('Formats/Order/Number',$DomainOrder['OrderID']);
if(Is_Error($Number))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$DomainOrder['Number'] = $Number;
#-------------------------------------------------------------------------------
$Message = <<<EOT
Здравствуйте, %User.Name%!

Уведомляем Вас о том, что %DomainOrder.StatusDate% Ваш заказ №%DomainOrder.Number% на регистрацию домена поступил на обработку нашим операторам.
После проверки, Ваш заказ будет немедленно исполнен.

%From.Sign%
EOT;
#-------------------------------------------------------------------------------
$Replace = Array_ToLine($Replace,'%');
#-------------------------------------------------------------------------------
foreach(Array_Keys($Replace) as $Key)
  $Message = Str_Replace($Key,$Replace[$Key],$Message);
#-------------------------------------------------------------------------------
return Array('Theme'=>'Заказ поступил на проверку','Message'=>$Message);
#-------------------------------------------------------------------------------

?>
