<?php

#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Replace');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$DSOrder = &$Replace['DSOrder'];
#-------------------------------------------------------------------------------
$TimeRemainder = Comp_Load('Formats/Date/Remainder',($DSOrder['StatusDate'] + 86400 - Time()));
if(Is_Error($TimeRemainder))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$DSOrder['TimeRemainder'] = $TimeRemainder;
#-------------------------------------------------------------------------------
$Number = Comp_Load('Formats/Order/Number',$DSOrder['OrderID']);
if(Is_Error($Number))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$DSOrder['Number'] = $Number;
#-------------------------------------------------------------------------------
$Message = <<<EOT
Здравствуйте, %User.Name%!

Уведомляем Вас о том, что оканчивается срок блокировки Вашего выделенного сервера, заказ №%DSOrder.Number%, IP адрес %DSOrder.IP%.
До удаления заказа %DSOrder.TimeRemainder%.

%From.Sign%
EOT;
#-------------------------------------------------------------------------------
$Replace = Array_ToLine($Replace,'%');
#-------------------------------------------------------------------------------
foreach(Array_Keys($Replace) as $Key)
  $Message = Str_Replace($Key,$Replace[$Key],$Message);
#-------------------------------------------------------------------------------
return Array('Theme'=>'Оканчивается срок блокировки выделенного сервера','Message'=>$Message);
#-------------------------------------------------------------------------------

?>
