<?php

#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Replace');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Replace['ExtraIPOrder'] = $Replace['Row'];
#-------------------------------------------------------------------------------
$ExtraIPOrder = &$Replace['ExtraIPOrder'];
#-------------------------------------------------------------------------------
$StatusDate = Comp_Load('Formats/Date/Standard',$ExtraIPOrder['StatusDate']);
if(Is_Error($StatusDate))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$ExtraIPOrder['StatusDate'] = $StatusDate;
#-------------------------------------------------------------------------------
$Number = Comp_Load('Formats/Order/Number',$ExtraIPOrder['OrderID']);
if(Is_Error($Number))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$ExtraIPOrder['Number'] = $Number;
#-------------------------------------------------------------------------------
#$Server = DB_Select('ExtraIPs',Array('Address','Url','Ns1Name','Ns2Name'),Array('UNIQ','ID'=>$ExtraIPOrder['ServerID']));
#if(!Is_Array($Server))
#  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#$ExtraIPOrder['Server'] = $Server;
#-------------------------------------------------------------------------------
$Message = <<<EOT
Здравствуйте, %User.Name%!

Уведомляем Вас о том, что %ExtraIPOrder.StatusDate% Ваш заказ №%ExtraIPOrder.Number% на выделенный IP адрес был успешно выполнен.
К вашему заказу добавлен адрес %ExtraIPOrder.Login%

%From.Sign%
EOT;
#-------------------------------------------------------------------------------
$Replace = Array_ToLine($Replace,'%');
#-------------------------------------------------------------------------------
foreach(Array_Keys($Replace) as $Key)
  $Message = Str_Replace($Key,$Replace[$Key],$Message);
#-------------------------------------------------------------------------------
return Array('Theme'=>'Заказ выделенного IP успешно активирован','Message'=>$Message);
#-------------------------------------------------------------------------------

?>
