<?php

#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Replace');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$ExtraIPOrder = &$Replace['ExtraIPOrder'];
#-------------------------------------------------------------------------------
$Number = Comp_Load('Formats/Order/Number',$ExtraIPOrder['OrderID']);
if(Is_Error($Number))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$ExtraIPOrder['Number'] = $Number;
#-------------------------------------------------------------------------------
$Message = <<<EOT
Здравствуйте, %User.Name%!

Уведомляем Вас о том, что оканчивается срок действия Вашего заказа №%ExtraIPOrder.Number% на виртуальный выделенный сервер (ExtraIP).
До окончания заказа %ExtraIPOrder.DaysRemainded% дн.
IP адрес: %ExtraIPOrder.Login%

%From.Sign%
EOT;
#-------------------------------------------------------------------------------
$Replace = Array_ToLine($Replace,'%');
#-------------------------------------------------------------------------------
foreach(Array_Keys($Replace) as $Key)
  $Message = Str_Replace($Key,$Replace[$Key],$Message);
#-------------------------------------------------------------------------------
return Array('Theme'=>'Оканчивается заказ на выделенный IP адрес','Message'=>$Message);
#-------------------------------------------------------------------------------

?>
