<?php

#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Replace');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$HostingOrder = &$Replace['HostingOrder'];
#-------------------------------------------------------------------------------
$Config = Config();
$DeleteTimeout = $HostingOrder['StatusDate'] + $Config['Tasks']['Types']['HostingForDelete']['DeleteTimeout'] * 24 * 3600 - Time();
$TimeRemainder = Comp_Load('Formats/Date/Remainder',$DeleteTimeout);
if(Is_Error($TimeRemainder))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$HostingOrder['TimeRemainder'] = $TimeRemainder;
#-------------------------------------------------------------------------------
$Number = Comp_Load('Formats/Order/Number',$HostingOrder['OrderID']);
if(Is_Error($Number))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$HostingOrder['Number'] = $Number;
#-------------------------------------------------------------------------------
$Message = <<<EOT
Здравствуйте, %User.Name%!

Уведомляем Вас о том, что оканчивается срок блокировки Вашего заказа №%HostingOrder.Number% на хостинг, логин %HostingOrder.Login%, домен %HostingOrder.Domain%.
До удаления заказа %HostingOrder.TimeRemainder%.

%From.Sign%
EOT;
#-------------------------------------------------------------------------------
$Replace = Array_ToLine($Replace,'%');
#-------------------------------------------------------------------------------
foreach(Array_Keys($Replace) as $Key)
  $Message = Str_Replace($Key,$Replace[$Key],$Message);
#-------------------------------------------------------------------------------
return Array('Theme'=>'Оканчивается срок блокировки заказа на хостинг','Message'=>$Message);
#-------------------------------------------------------------------------------

?>
