<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Replace');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Replace['HostingOrder'] = $Replace['Row'];
#-------------------------------------------------------------------------------
$HostingOrder = &$Replace['HostingOrder'];
#-------------------------------------------------------------------------------
$StatusDate = Comp_Load('Formats/Date/Standard',$HostingOrder['StatusDate']);
if(Is_Error($StatusDate))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$HostingOrder['StatusDate'] = $StatusDate;
#-------------------------------------------------------------------------------
$Number = Comp_Load('Formats/Order/Number',$HostingOrder['OrderID']);
if(Is_Error($Number))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$HostingOrder['Number'] = $Number;
#-------------------------------------------------------------------------------
$Message = <<<EOT
Здравствуйте, %User.Name%!

Уведомляем Вас о том, что %HostingOrder.StatusDate% Ваш заказ №%HostingOrder.Number% на хостинг, c паркованным доменом %HostingOrder.Domain%, был удален.

%From.Sign%
EOT;
#-------------------------------------------------------------------------------
$Replace = Array_ToLine($Replace,'%');
#-------------------------------------------------------------------------------
foreach(Array_Keys($Replace) as $Key)
  $Message = Str_Replace($Key,$Replace[$Key],$Message);
#-------------------------------------------------------------------------------
return Array('Theme'=>'Заказ хостинга удален','Message'=>$Message);
#-------------------------------------------------------------------------------

?>
