<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Replace');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Replace['ISPswOrder'] = $Replace['Row'];
#-------------------------------------------------------------------------------
$ISPswOrder = &$Replace['ISPswOrder'];
#-------------------------------------------------------------------------------
$StatusDate = Comp_Load('Formats/Date/Standard',$ISPswOrder['StatusDate']);
if(Is_Error($StatusDate))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$ISPswOrder['StatusDate'] = $StatusDate;
#-------------------------------------------------------------------------------
$Number = Comp_Load('Formats/Order/Number',$ISPswOrder['OrderID']);
if(Is_Error($Number))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$ISPswOrder['Number'] = $Number;
#-------------------------------------------------------------------------------
#$Server = DB_Select('ISPswGroups',Array('Address','Url','Ns1Name','Ns2Name'),Array('UNIQ','ID'=>$ISPswOrder['ServerID']));
#if(!Is_Array($Server))
#  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
#$ISPswOrder['Server'] = $Server;
#-------------------------------------------------------------------------------
$Message = <<<EOT
Здравствуйте, %User.Name%!

Уведомляем Вас о том, что %ISPswOrder.StatusDate% Ваш заказ №%ISPswOrder.Number% на ПО ISPsystems был успешно активирован.

IP адрес лицензии: %ISPswOrder.IP%

Для активации лицензии, используйте слудующую команду:
wget -O /usr/local/ispmgr/etc/ispmgr.lic "http://lic.ispsystem.com/ispmgr.lic?ip=%ISPswOrder.IP%"

Сохраните эти данные в надежном месте, они потребуются для дальнейшей работы.

%From.Sign%
EOT;
#-------------------------------------------------------------------------------
$Replace = Array_ToLine($Replace,'%');
#-------------------------------------------------------------------------------
foreach(Array_Keys($Replace) as $Key)
  $Message = Str_Replace($Key,$Replace[$Key],$Message);
#-------------------------------------------------------------------------------
return Array('Theme'=>'Заказ программного обеспечения успешно активирован','Message'=>$Message);
#-------------------------------------------------------------------------------

?>
