<?php


#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Replace');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$ISPswOrder = &$Replace['ISPswOrder'];
#-------------------------------------------------------------------------------
$Number = Comp_Load('Formats/Order/Number',$ISPswOrder['OrderID']);
if(Is_Error($Number))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$ISPswOrder['Number'] = $Number;
#-------------------------------------------------------------------------------
$Message = <<<EOT
Здравствуйте, %User.Name%!

Уведомляем Вас о том, что оканчивается срок действия Вашего заказа №%ISPswOrder.Number% на ПО ISPsystem.
До окончания заказа %ISPswOrder.DaysRemainded% дн.
IP адрес заказа: %ISPswOrder.IP%.

%From.Sign%
EOT;
#-------------------------------------------------------------------------------
$Replace = Array_ToLine($Replace,'%');
#-------------------------------------------------------------------------------
foreach(Array_Keys($Replace) as $Key)
  $Message = Str_Replace($Key,$Replace[$Key],$Message);
#-------------------------------------------------------------------------------
return Array('Theme'=>'Оканчивается срок действия заказа на программное обеспечение','Message'=>$Message);
#-------------------------------------------------------------------------------

?>
