<?php

#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Replace');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$VPSOrder = &$Replace['VPSOrder'];
#-------------------------------------------------------------------------------
$Number = Comp_Load('Formats/Order/Number',$VPSOrder['OrderID']);
if(Is_Error($Number))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$VPSOrder['Number'] = $Number;
#-------------------------------------------------------------------------------
$Message = <<<EOT
Здравствуйте, %User.Name%!

Уведомляем Вас о том, что оканчивается срок действия Вашего заказа №%VPSOrder.Number% на виртуальный выделенный сервер (VPS).
До окончания заказа %VPSOrder.DaysRemainded% дн.
IP адрес: %VPSOrder.Login%

%From.Sign%
EOT;
#-------------------------------------------------------------------------------
$Replace = Array_ToLine($Replace,'%');
#-------------------------------------------------------------------------------
foreach(Array_Keys($Replace) as $Key)
  $Message = Str_Replace($Key,$Replace[$Key],$Message);
#-------------------------------------------------------------------------------
return Array('Theme'=>'Оканчивается срок действия заказа на виртуальный сервер','Message'=>$Message);
#-------------------------------------------------------------------------------

?>
