<?php

#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Replace');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$VPSOrder = &$Replace['VPSOrder'];
#-------------------------------------------------------------------------------
$Config = Config();
$DeleteTimeout = $VPSOrder['StatusDate'] + $Config['Tasks']['Types']['VPSForDelete']['DeleteTimeout'] * 24 * 3600 - Time();
$TimeRemainder = Comp_Load('Formats/Date/Remainder',$DeleteTimeout);
if(Is_Error($TimeRemainder))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$VPSOrder['TimeRemainder'] = $TimeRemainder;
#-------------------------------------------------------------------------------
$Number = Comp_Load('Formats/Order/Number',$VPSOrder['OrderID']);
if(Is_Error($Number))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$VPSOrder['Number'] = $Number;
#-------------------------------------------------------------------------------
$Message = <<<EOT
Здравствуйте, %User.Name%!

Уведомляем Вас о том, что оканчивается срок блокировки Вашего заказа №%VPSOrder.Number% на виртуальный выделенный сервер (VPS).
До удаления заказа %VPSOrder.TimeRemainder%.

%From.Sign%
EOT;
#-------------------------------------------------------------------------------
$Replace = Array_ToLine($Replace,'%');
#-------------------------------------------------------------------------------
foreach(Array_Keys($Replace) as $Key)
  $Message = Str_Replace($Key,$Replace[$Key],$Message);
#-------------------------------------------------------------------------------
return Array('Theme'=>'Оканчивается срок блокировки заказа на виртуальный сервер','Message'=>$Message);
#-------------------------------------------------------------------------------

?>
