<?php

#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Replace');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Replace['VPSOrder'] = $Replace['Row'];
#-------------------------------------------------------------------------------
$VPSOrder = &$Replace['VPSOrder'];
#-------------------------------------------------------------------------------
$StatusDate = Comp_Load('Formats/Date/Standard',$VPSOrder['StatusDate']);
if(Is_Error($StatusDate))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$VPSOrder['StatusDate'] = $StatusDate;
#-------------------------------------------------------------------------------
$Number = Comp_Load('Formats/Order/Number',$VPSOrder['OrderID']);
if(Is_Error($Number))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$VPSOrder['Number'] = $Number;
#-------------------------------------------------------------------------------
$Server = DB_Select('VPSServers',Array('Address','Url','Ns1Name','Ns2Name'),Array('UNIQ','ID'=>$VPSOrder['ServerID']));
if(!Is_Array($Server))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$VPSOrder['Server'] = $Server;
#-------------------------------------------------------------------------------
$Message = <<<EOT
Здравствуйте, %User.Name%!

Уведомляем Вас о том, что %VPSOrder.StatusDate% Ваш заказ №%VPSOrder.Number% на виртуальный выделенный сервер (VPS) был успешно активирован.

Данные для доступа к панели управления VPS сервером:
  * Адрес панели управления: %VPSOrder.Server.Url%
  * Логин в панель управления: %VPSOrder.Login%
  * Пароль панели управления: %VPSOrder.Password%

Данные для доступа на сервер по SSH:
  * IP адрес сервера: %VPSOrder.Login%
  * Имя пользователя: root
  * Пароль: %VPSOrder.Password%
 
При заказе сервера с панелью управления ISPmanager Lite, Вы можете войти в нее используя следующие данные:
  * Адрес панели ISPmanager: https://%VPSOrder.Login%/manager/ispmgr
  * Логин в панель ISPmanager: root
  * Пароль панели ISPmanger: %VPSOrder.Password%

Сервера имён:
  * Первичный сервер имён: %VPSOrder.Server.Ns1Name%
  * Вторичный сервер имён: %VPSOrder.Server.Ns2Name%


Сохраните эти данные в надежном месте, они потребуются для дальнейшей работы.

%From.Sign%
EOT;
#-------------------------------------------------------------------------------
$Replace = Array_ToLine($Replace,'%');
#-------------------------------------------------------------------------------
foreach(Array_Keys($Replace) as $Key)
  $Message = Str_Replace($Key,$Replace[$Key],$Message);
#-------------------------------------------------------------------------------
return Array('Theme'=>'Заказ виртуального сервера успешно активирован','Message'=>$Message);
#-------------------------------------------------------------------------------

?>
