<?php

#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Replace');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$VPSOrder = &$Replace['VPSOrder'];
#-------------------------------------------------------------------------------
$Number = Comp_Load('Formats/Order/Number',$VPSOrder['OrderID']);
if(Is_Error($Number))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$VPSOrder['Number'] = $Number;
#-------------------------------------------------------------------------------
$Server = DB_Select('VPSServers',Array('Address','Url','Ns1Name','Ns2Name'),Array('UNIQ','ID'=>$VPSOrder['ServerID']));
if(!Is_Array($Server))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$VPSOrder['Server'] = $Server;
#-------------------------------------------------------------------------------
$CurrentDate = Comp_Load('Formats/Date/Standard',Time());
if(Is_Error($CurrentDate))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
$Replace['CurrentDate'] = $CurrentDate;
#-------------------------------------------------------------------------------
$Message = <<<EOT
Здравствуйте, %User.Name%!

Уведомляем Вас о том, что %CurrentDate% пароль на Ваш заказ виртуального выделенного сервера (VPS) №%VPSOrder.Number% был успешно изменен.

Ваши новые данные для доступа к аккаунту на сервере:
  * Адрес панели управления: %VPSOrder.Server.Url%
  * Логин в панель управления: %VPSOrder.Login%
  * Пароль панели управления: %VPSOrder.Password%

Данные для доступа на сервер по SSH:
  * IP адрес сервера: %VPSOrder.Login%
  * Имя пользователя: root
  * Пароль: %VPSOrder.Password%
 
При заказе сервера с панелью управления ISPmanager Lite, Вы можете войти в нее используя следующие данные:
  * Адрес панели ISPmanager: https://%VPSOrder.Login%/manager/ispmgr
  * Логин в панель ISPmanager: root
  * Пароль панели ISPmanger: %VPSOrder.Password%

Сервера имён:
  * Первичный сервер имен: %VPSOrder.Server.Ns1Name%
  * Вторичный сервер имен: %VPSOrder.Server.Ns2Name%

Сохраните эти данные в надежном месте, они потребуются для дальнейшей работы.

%From.Sign%
EOT;
#-------------------------------------------------------------------------------
$Replace = Array_ToLine($Replace,'%');
#-------------------------------------------------------------------------------
foreach(Array_Keys($Replace) as $Key)
  $Message = Str_Replace($Key,$Replace[$Key],$Message);
#-------------------------------------------------------------------------------
return Array('Theme'=>'Пароль для заказа виртуального сервера успешно изменен','Message'=>$Message);
#-------------------------------------------------------------------------------

?>
