INSERT INTO `Clauses`
  (`AuthorID`,`EditorID`,`Partition`,`TemplateID`,`Title`,`Text`)
VALUES
(1,1,'Start','Standard','Добро пожаловать!','<NOBODY>
 <H2>Поздравляем!</H2>
 <P>Вы успешно зарегистрированы в нашей биллинговой системе! Пожалуйста, прочитайте сообщение до конца, т.к. это поможет Вам в дальнейшей работе. Данное сообщение будет доступно в течение 10 мин.</P>
 <P>
  <SPAN>Сейчас Вы находитесь на домашней странице в своем личном </SPAN>
  <U>виртуальном кабинете.</U>
  <SPAN> Именно отсюда будут осуществляться все операции касающиеся </SPAN>
  <U>нашего сотрудничества.</U>
 </P>
 <P>
  <SPAN>С помощью биллинговой системы Вы сможете выписать и оплатить счет для пополнения баланса, выписать договор или заказать услуги, а так же получить техническую поддержку. На основании введенных Вами данных, для Вас сформирован договор публичной оферты и Вы уже можете заказывать услуги, предварительно пополнив баланс договора в разделе Мой офис</SPAN>
  <IMG width="12" height="10" src="/styles/billing/Images/ArrowRight.png" />
  <SPAN>Счета на оплату</SPAN>
  <IMG width="12" height="10" src="/styles/billing/Images/ArrowRight.png" />
  <SPAN>Выписать (оплатить) счет.</SPAN>
 </P>
 <P>
  <SPAN>Если Вы хотите оплачивать счета через банк или заключить договор в письменной форме, нам потребуются Ваши данные для формирования документов, для этого, пожалуйста, пройдите в раздел Мой офис</SPAN>
  <IMG width="12" height="10" src="/styles/billing/Images/ArrowRight.png" />
  <SPAN>Мои профили и зарегистрируйте профиль, указав, что хотите сформировать договор на этот профиль.</SPAN>
 </P>
 <P>Теперь Вы владеете минимальной необходимой информацией и можете продолжить работу. Не забывайте следовать подсказкам, которые помогут Вам при работе в системе.</P>
</NOBODY>');