INSERT INTO `Clauses`
(`AuthorID`,`EditorID`,`Partition`,`Title`,`IsProtected`, `IsXML`, `IsDOM`, `Text`, `IsPublish`)
VALUES
(100, 100, 'Header:/DependUsersStatistic', 'Информация о начислениях по партнёрской программе', 'no', 'yes', 'no', 'В данном разделе предоставлена информация о возможных начислениях в предыдущие периоды (&quot;возможных&quot; — потому, что начисления производятся лишь при наличии соответствующего партнёрского договора). Суммы могут незначительно отличаться от реальных, из-за округления.<br />\n<br />\nЗначения колонок:<br />\n<ul type="square">\n <li>\n  <strong>Год</strong>/<strong>Месяц</strong> — год/месяц начисления\n </li>\n <li>\n  <strong>Пользователей</strong> — число ваших рефералов, оплачивавших услуги в указанный период времени\n </li>\n <li>\n  <strong>Платежей</strong> — число платежей совершённых вашими рефералами\n </li>\n <li>\n  <strong>Сумма</strong> — сумма вашего партнёрского вознаграждения\n </li>\n</ul><br />', 'yes');

