INSERT INTO `Clauses` (`AuthorID`, `EditorID`, `Partition`, `Title`, `IsProtected`, `IsXML`, `IsDOM`, `IsPublish`, `Text`) VALUES

(100, 100, 'Header:/Administrator/Update', 'Инструкция по обновлению биллинга', 'no', 'yes', 'no', 'yes', '<table class="Notice">\n <tbody>\n  <tr>\n   <td>\n    <ul type="square">\n     <li>Продукт предоставляется &quot;как есть&quot;.\n     </li>\n     <li>Все обновления вы выполняете на свой страх и риск - если у вас всё работает, и функционал вас устраивает — ничего не обновляйте.\n     </li>\n     <li>Разработчики не несут ответственности за простой вашей системы, и за недополученную прибыль.\n     </li>\n     <li>В случае любых проблем при обновлении, скопируйте вывод программы обновления (при необходимости, удалив из него пароли и прочую секретную информацию), и создайте тему на официальном <a href="http://forum.joonte.com/" target="_blank">форуме поддержки биллинговой системы</a>.\n     </li><li> <strong>Всегда</strong> делайте полную копию базы и всех файлов биллинга <strong>до</strong> обновления. </li>\n    </ul>\n   </td>\n  </tr>\n </tbody>\n</table><br />');



