<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('UserID','Reason');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
// подтверждаем пользователя, если это необходимо
$User = DB_Select('Users',Array('ID','Email','ConfirmedWas'),Array('UNIQ','ID'=>$UserID));
#--------------------------------------------------------------------------------
switch(ValueOf($User)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return ERROR | @Trigger_Error(400);
case 'array':
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
// юзер в биллинге не подтверждён, но им оплачен счёт как юриком или ИП - подтверждаем
if(SizeOf($User['ConfirmedWas']) < 1){
	#-------------------------------------------------------------------------------
	Debug(SPrintF('[comp/Users/Confirm]: подтверждение UserID = %s; Email = %s; Reason = %s',$UserID,$User['Email'],$Reason));
	#-------------------------------------------------------------------------------
	$Comp = Comp_Load('www/Administrator/API/UserConfirm',Array('UserID'=>$User['ID'],'Reason'=>$Reason));
	if(Is_Error($Comp))
		return ERROR | @Trigger_Error(500);
	#-------------------------------------------------------------------------------
	// активируем задачу проводки счетов
	$IsUpdate = DB_Update('Tasks',Array('IsActive'=>TRUE,'IsExecuted'=>FALSE,'ExecuteDate'=>Time()),Array('Where'=>'`TypeID` = "NotConfirmedInvoices"'));
	if(Is_Error($IsUpdate))
		return ERROR | @Trigger_Error(500);
	#-------------------------------------------------------------------------------
}else{
	#-------------------------------------------------------------------------------
	Debug(SPrintF('[comp/Users/Confirm]: уже подтверждён UserID = %s; Email = %s',$UserID,$User['Email']));
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return TRUE;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------

?>
