<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$Result = Array();
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$CacheID = Md5($__FILE__);
$Out = CacheManager::get($CacheID);
#-------------------------------------------------------------------------------
if($Out)
	return $Result;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Config = Config();
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$Where = Array(
		SPrintF("`TABLE_SCHEMA` = '%s'",$Config['DBConnection']['DbName']),
		"`TABLE_NAME` IN ('Users','Services','Orders','OrdersConsider','Bonuses','Clauses','Contracts','ContractsEnclosures','DomainsOrders','DomainsSchemes','Edesks','EdesksMessages','HostingOrders','HostingSchemes','HostingServers','HostingServersGroups','Invoices','InvoicesItems','OrdersConsider','OrdersFields','OrdersTransfer','Permissions','Politics','Postings','Profiles','PromoCodes','PromoCodesExtinguished','Registrators','ServicesFields','ServicesGroups','Tasks','WorksComplite')"
	);
#-------------------------------------------------------------------------------
$Tables = DB_Select('`INFORMATION_SCHEMA`.`TABLES`',Array('TABLE_NAME','ENGINE'),Array('Where'=>$Where));
#-------------------------------------------------------------------------------
switch(ValueOf($Tables)){
case 'error':
	return ERROR | @Trigger_Error(500);
case 'exception':
	return ERROR | @Trigger_Error(400);
case 'array':
	break;
default:
	return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
foreach($Tables as $Table){
	#-------------------------------------------------------------------------------
	if($Table['ENGINE'] != 'InnoDB'){
		#-------------------------------------------------------------------------------
		$Note = TRUE;
		Debug(SPrintF('[comp/Notes/Administrator/CheckTablesEngines]: Incorrect Table Engine, table = %s',$Table['TABLE_NAME']));
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
if(!IsSet($Note)){
	#-------------------------------------------------------------------------------
	CacheManager::add($CacheID,'OK',100500);
	return $Result;
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
$NoBody = new Tag('NOBODY');
#-------------------------------------------------------------------------------
$NoBody->AddChild(new Tag('P','Структура базы данных некорректна. Для корректной работы биллинговой системы, таблицы должны быть InnoDB, в противном случае, будет некорректный рассчёт оставшихся оплаченных периодов и нарушение ссылочной целостности базы данных. Если вы восстановили биллинг из бэкапа, восстановите заново, включив InnoDB, если это чисттая инсталляция - проведите её заново, включив InnoDB.'));
$NoBody->AddChild(new Tag('P','Список таблиц с некорректным Storage Engine:'));
#-------------------------------------------------------------------------------
foreach($Tables as $Table){
	#-------------------------------------------------------------------------------
	if($Table['ENGINE'] != 'InnoDB'){
		#-------------------------------------------------------------------------------
		$NoBody->AddChild(new Tag('SPAN',SPrintF('Таблица: "%s"; Storage Engine: "%s"',$Table['TABLE_NAME'],$Table['ENGINE'])));
		$NoBody->AddChild(new Tag('BR'));
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
$Result[] = $NoBody;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return $Result;
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------

?>
