<?php
#-------------------------------------------------------------------------------
/** @author Великодный В.В. (Joonte Ltd.) */
/******************************************************************************/
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$CacheID = Md5($__FILE__);
#-------------------------------------------------------------------------------
if (CacheManager::isEnabled()) {
    $Result = CacheManager::get($CacheID);

    if(!Is_Error($Result)) { return $Result; }
}
#-------------------------------------------------------------------------------
$Result = Array();
#-------------------------------------------------------------------------------
$Count = DB_Count('Tasks',Array('Where'=>"(`IsActive` = 'no' OR `Errors` > 0) AND `IsExecuted` = 'no'"));
if(Is_Error($Count))
  return ERROR | @Trigger_Error(500);
#-------------------------------------------------------------------------------
if($Count){
  #-----------------------------------------------------------------------------
  $Result = Array();
  #-----------------------------------------------------------------------------
  $NoBody = new Tag('NOBODY');
#-------------------------------------------------------------------------------
$Parse = <<<EOD
<NOBODY>
 <SPAN>Некоторые задачи</SPAN>
 <SPAN style="font-weight:bold;">%s</SPAN>
 <SPAN> не могут быть выполнены автоматически. Возможно, в ходе автоматического
выполнения этих задач произошли ошибки. Вы можете ознакомиться с причинами, устранить
неполадки и активировать задачи заново.</SPAN>
 <BR />
<A href="/Administrator/Tasks?PatternOutID=Manual">Перейти к задачам »</A>
</NOBODY>
EOD;
#-------------------------------------------------------------------------------
  $NoBody->AddHTML(SPrintF($Parse,$Count));
  #-----------------------------------------------------------------------------
  $Result = Array($NoBody);
}
#-------------------------------------------------------------------------------
if (CacheManager::isEnabled()) {
    CacheManager::add($CacheID, $Result,60);
}
#-------------------------------------------------------------------------------
return $Result;
#-------------------------------------------------------------------------------

?>
