//------------------------------------------------------------------------------
/** @author Бреславский А.В. (Joonte Ltd.) */
//------------------------------------------------------------------------------
// Имя загружаемого файла
var $UploadFileName = null;
// Целевая форма
var $UploadFormName = null;
// Интервал закрытия окна загрузки
var $UploadInterval = null;
//------------------------------------------------------------------------------
function UploadIframeOnLoad(){
  //----------------------------------------------------------------------------
  $Content = window.frames['UploadIframe'].document.body.innerHTML;
  //----------------------------------------------------------------------------
  $Answer = $Content.split('^');
  //----------------------------------------------------------------------------
  if($Answer.length > 2){
    //--------------------------------------------------------------------------
    $Name = $Answer[0]; // Имя файла
    $Size = $Answer[1]; // Размер файла в Кб.
    $Hash = $Answer[2]; // Хешь доступа к файлу на сервере
    //--------------------------------------------------------------------------
    if($Name.length > 5)
      $Name = SPrintF('%s...',$Name.substr(0,5));
    //--------------------------------------------------------------------------
    document.getElementById(SPrintF('Upload%sInfo',$UploadFileName)).innerHTML = SPrintF('%s %u кб. <A style="font-size:11px;" href="javascript:UploadDelete(\'%s\',\'%s\');">[удалить]</A>',$Name,$Size,$UploadFormName,$UploadFileName);
    //--------------------------------------------------------------------------
    var $Form = document.forms[$UploadFormName];
    //--------------------------------------------------------------------------
    if($Form[$UploadFileName])
      $Form[$UploadFileName].value = $Hash;
    else{
      //------------------------------------------------------------------------
      $Input = document.createElement('INPUT');
      $Input.type = 'hidden';
      $Input.name = $UploadFileName;
      $Input.value = $Hash;
      //------------------------------------------------------------------------
      $Form.appendChild($Input);
    }
    //--------------------------------------------------------------------------
    $UploadInterval = window.setInterval('UploadHide()',100);
  }else{
    //--------------------------------------------------------------------------
    Debug($Content);
    //--------------------------------------------------------------------------
    return false;
  }
};
//------------------------------------------------------------------------------
var $Image = new Image();
$Image.src = '/styles/root/Images/Icons/Upload.gif';
//------------------------------------------------------------------------------
function UploadDelete($Form,$FileName){
  //----------------------------------------------------------------------------
  var $Form = document.forms[$Form];
  //----------------------------------------------------------------------------
  if($Form[$FileName])
    $Form[$FileName].value = 'null';
  //----------------------------------------------------------------------------
  document.getElementById(SPrintF('Upload%sInfo',$FileName)).innerHTML = '-';
}
//------------------------------------------------------------------------------
function UploadProgress(){
  //----------------------------------------------------------------------------
  document.getElementById(SPrintF('Upload%sInfo',$UploadFileName)).innerHTML = '<IMG alt="Загрузка файла" width="65" height="16" src="/styles/root/Images/Icons/Upload.gif" />';
  //----------------------------------------------------------------------------
  var $Form = document.forms['UploadForm'];
  //----------------------------------------------------------------------------
  $Form.submit();
  //----------------------------------------------------------------------------
  $Form.Upload.value = '';
}
//------------------------------------------------------------------------------
function UploadShow($event,$Form,$FileName){
  //----------------------------------------------------------------------------
  var $Upload = document.getElementById('Upload');
  //----------------------------------------------------------------------------
  with($Upload.style){
    //--------------------------------------------------------------------------
    display = 'block';
    zIndex  = GetMaxZIndex() + 1;
    //--------------------------------------------------------------------------
    var $Body = document.body;
    //--------------------------------------------------------------------------
    var $OffsetX = $Body.clientWidth  - ($event.clientX + $Upload.offsetWidth);
    var $OffsetY = $Body.clientHeight - ($event.clientY + $Upload.offsetHeight);
    //--------------------------------------------------------------------------
    left = $Body.scrollLeft + $event.clientX + ($OffsetX < 0?$OffsetX:0);
    top  = $Body.scrollTop  + $event.clientY + ($OffsetY < 0?$OffsetY - 20:0) + 20;
  }
  //----------------------------------------------------------------------------
  $UploadFormName = $Form;
  //----------------------------------------------------------------------------
  $UploadFileName = $FileName;
}
//------------------------------------------------------------------------------
function UploadHide(){
  //----------------------------------------------------------------------------
  window.clearInterval($UploadInterval);
  //----------------------------------------------------------------------------
  document.getElementById('Upload').style.display = 'none';
}