<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('Graphs');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$FnNames = Array();	// имена функций, нужны на выхлоп
$JsFuncs = '';		// функции для графиков
$CallBacks = '';	// обратные вызовы, для показа графиков
#-------------------------------------------------------------------------------
//Debug(SprintF('[comp/Charts/Pie]: Graphs = %s',print_r($Graphs,true)));
#-------------------------------------------------------------------------------
foreach(Array_Keys($Graphs) as $Name){
	#-------------------------------------------------------------------------------
	// имя функции для каллбака
	$FnName = SubStr(Md5(MicroTime()),0,8);
	#-------------------------------------------------------------------------------
	$FnNames[] = $FnName;
	#-------------------------------------------------------------------------------
	#-------------------------------------------------------------------------------
	// JS массив данных
	$Data = Array();
	#-------------------------------------------------------------------------------
	foreach(Array_Keys($Graphs[$Name]) as $Key){
		#-------------------------------------------------------------------------------
		$Data[] = SPrintF("['%s',%u]",$Graphs[$Name][$Key][0],$Graphs[$Name][$Key][1]);
		#-------------------------------------------------------------------------------
		//Debug(SprintF('[comp/Charts/Pie]: Key = %s; Graphs[Name][Key] = %s',$Graphs[$Name][$Key][0],$Graphs[$Name][$Key][1]));
		#-------------------------------------------------------------------------------
	}
	#-------------------------------------------------------------------------------
	// строим функции для графиков
	$JsFuncs = SPrintF("%s\n
	function draw_%s() {
		// Create the data table
		var data = new google.visualization.DataTable();
		data.addColumn('string', 'Название');
		data.addColumn('number', 'Количество');
		data.addRows([%s]);

		// опции графика. sliceVisibilityThreshold в 1/100 - если кусок графика менее 1/100 - уходит в Other
		var options = {title:'%s','is3D':true,sliceVisibilityThreshold:1/100,chartArea:{left:10,top:5,width:'100%%',height:'100%%'}};

		// Instantiate and draw the chart
		var chart = new google.visualization.PieChart(document.getElementById('div_%s'));
		chart.draw(data, options);
	}\n",$JsFuncs,$FnName,Implode(',',$Data),$Name,$FnName);
	#-------------------------------------------------------------------------------
	// обратные вызовы
	$CallBacks = SPrintF("%s\n\tgoogle.charts.setOnLoadCallback(draw_%s)",$CallBacks,$FnName);
	#-------------------------------------------------------------------------------
}
#-------------------------------------------------------------------------------
// скрипт на выход
$Script = SPrintF("google.charts.load('current', {'packages':['corechart']});\n\n%s\n%s",$CallBacks,$JsFuncs);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
return Array('Script'=>$Script,'FnNames'=>$FnNames);
#-------------------------------------------------------------------------------
#-------------------------------------------------------------------------------
?>
