<?php

#-------------------------------------------------------------------------------
/** @author Alex Keda, for www.host-food.ru */
/******************************************************************************/
/******************************************************************************/
$__args_list = Array('IsSearch');
/******************************************************************************/
Eval(COMP_INIT);
/******************************************************************************/
/******************************************************************************/
$HostingServers = DB_Select('HostingServers',Array('ID','Address'),Array('SortOn'=>'Address'));
#-------------------------------------------------------------------------------
switch(ValueOf($HostingServers)){
  case 'error':
    return ERROR | @Trigger_Error(500);
  case 'exception':
    return FALSE;
  case 'array':
    #---------------------------------------------------------------------------
    $Filters = Array('Сервера размещения, хостинг');
    #---------------------------------------------------------------------------
    foreach($HostingServers as $HostingServer){
      #-------------------------------------------------------------------------
      $Filter = Array('Name'=>$HostingServer['Address'],'UsersIDs'=>Array());
      #-------------------------------------------------------------------------
      if($IsSearch){
        #-----------------------------------------------------------------------
        $HostingOrders = DB_Select('HostingOrdersOwners','UserID',Array('Where'=>SPrintF('`ServerID` = %u',$HostingServer['ID'])));
        #-----------------------------------------------------------------------
        switch(ValueOf($HostingOrders)){
          case 'error':
            return ERROR | @Trigger_Error(500);
          case 'exception':
            # No more...
          break;
          case 'array':
            #-------------------------------------------------------------------
            $UsersIDs = Array();
            #-------------------------------------------------------------------
            foreach($HostingOrders as $HostingOrder)
              $UsersIDs[] = $HostingOrder['UserID'];
            #-------------------------------------------------------------------
            $UsersIDs = Array_Unique($UsersIDs);
            #-------------------------------------------------------------------
            $Filter['UsersIDs'] = $UsersIDs;
          break;
          default:
            return ERROR | @Trigger_Error(101);
        }
      }
      #-------------------------------------------------------------------------
      $Filters[$HostingServer['Address']] = $Filter;
    }
    #---------------------------------------------------------------------------
    return $Filters;
  default:
    return ERROR | @Trigger_Error(101);
}
#-------------------------------------------------------------------------------


?>
